define config.end_game_transition = fade
define f = Character("คุณพ่อ", color="#000000")
define b = Character("เบ็ก", color="#000000")
define e = Character("เอลนี่", color="#a54848")
define l = Character("ลานี่", color="#30a8b8")
define el = Character("ลานี่ & เอลนี่", color="#9a26a5")
define c = Character("คนขับรถ", color="#000000")
define j = Character("ผู้ประกาศข่าว", color="#000000")
define d = Character("ดิเอโก้", color="#000000")
define a = Character("เบลนด้า", color="#1d1a4b")
define r = Character("ร้อดดิโก้", color="#331a1a")
define w = Character("???", color="#000000")
define m = Character("เสียงในใจ", color="#474747")
define p = Character("หมอ", color="#474747")
default persistent.end = False

label before_main_menu:
  play music "main.mp3" fadeout 1 loop
  return

transform grayed:
  matrixcolor SaturationMatrix(0) * BrightnessMatrix(-0.25)

transform reset_color:
  matrixcolor SaturationMatrix(1) * BrightnessMatrix(0)

transform left:
  xcenter 0.25

transform right:
  xcenter 0.75

transform center:
  xcenter 0.5

label start:
  scene intro
  play music "soft.mp3" fadeout 1 loop
 
  j " สวัสดีครับท่านผู้ฟังทุกท่าน และนี่คือรายการแจ้งฝนฟ้าอากาศ รายการที่จะคอยแจ้งข่าวสารเกี่ยวกับฝนฟ้าอากาศให้คุณทราบอย่างสม่ำเสมอ!"
  j " วันนี้ผมมาอยู่กับผมจอร์ชเช่นเคยนะครับ "
  
  scene intro2
  j " ในวันนี้มีรายงานด่วนจากทีมงานที่พึ่งลงพื้นที่ไปเมื่อหลายวันก่อน ทีมงานพบว่าสภาพอากาศบริเวณชายฝั่งไม่ค่อยสู้ดีนัก "
  j " ระดับน้ำรอบชายฝั่งPaitaกำลังสูงขึ้นอย่างต่อเนื่อง และคาดว่าจะเพิ่มขึ้นเรื่อยๆ จนถึงสิ้นปีส่งผลให้บ้านเรือนเสียหายไปหลายหลัง "
  j " แนะนำให้ผู้อาศัยทุกท่านรีบอพยพโดยด่วน เพื่อความปลอดภัยของชาวเมืองทุกท่าน "
  j " ย้ำ! ขอให้ผู้อาศัยทุกท่านรีบอพยพโดยด่วน "

  scene introb
  show son with dissolve
  " เสียงวิทยุทำให้ทุกอย่างหยุดลง ตัวคุณที่เป็นเด็กไม่รู้ประสีประสามองผู้เป็นพ่อที่นิ่งไป หลังจากที่ได้ยินเสียงจากวิทยุด้วยแววตาสับสน "
  f " เราเองก็คงจะทำงานนี้ต่อไปได้อีกไม่นานแล้วสินะ ถ้าสถานการณ์ยังแย่แบบนี้ต่อไปคงต้องขนของเร็วกว่าที่คิด "

  scene 2father
  with dissolve
  scene 3father with dissolve
  scene 2father 
  with dissolve
  " คุณได้ยินเสียงถอนหายใจ น้ำเสียงของคุณพ่อดูเหนื่อยๆ เล็กน้อย "
  f " เบ็ก ทำไมลูกไม่ไปเล่นสักหน่อยล่ะ พวกเพื่อนๆ กำลังรออยู่ไม่ใช่เหรอ"

  scene who
  with dissolve
  " คำพูดของคุณพ่อทำให้ถึงเพื่อนทั้งสองคนที่คุณได้เป็นเพื่อนกันที่ชายหาด "

  scene run 
  with dissolve
  " คุณพยักหน้าเป็นการตอบรับ วางงานทุกอย่างเอาไว้ และวิ่งไปที่สถานนัดพบที่พวกคุณทั้งสามคนได้นัดกันไว้ "

  scene who
  with dissolve
  " คุณวิ่งมาสักพัก ผ่านชายหาดผ่านเรือประมงมากมาย จนรู้สึกว่าขาของคุณเริ่มล้า "
  " ในจังหวะที่คุณรู้สึกอ่อนแรงและกำลังจะล้ม ก็มีมือคู่นึงมาคว้าคุณเอาไว้ มือคู่นั้นเป็นของ... "

 
  menu:

        "คนซ้าย":
            jump Elny

        "คนขวา":
            jump Lany

  label Elny:

        scene beachdayblur
        show  fall down1
        " ปรากฏว่าเจ้าของมือหนาที่จับคุณไว้ก็คือ เอลนี่ คุณได้ยินคนตรงหน้าบ่นกับตัวเองเบาๆ ถึงความซุ่มซ่ามของคุณ "
        e " ซุ่มซ่ามจริงๆ "

        show fall down2

        " แม้คำพูดจะดูใจร้ายไปหน่อยแต่จริงๆ แล้วเอลนี่ก็เป็นคนที่ใจดีมากไม่ต่างจากผู้เป็นน้องสาว "
        " เสียอย่างเพียงอย่างเดียวก็คือการที่เจ้าตัวใช้คำพูดไม่เก่งและขี้อายไปเสียหน่อย "

        e " จะให้จับอีกนานมั้ยเนี่ย เห็นมั้ยว่ามันเมื่อย "

        e " ......... "
        
        show  fall down3

        e " ดูจากสีหน้าแล้วน่าจะยังสบายดีนี่ งั้นก็เลิกเหม่อแล้วรีบลุกขึ้นมาได้ละ "

        jump continue

  label Lany:

        scene beachday
        show lfall down1

        " เมื่อคุณลืมตาขึ้นมา พบว่าตัวเองไม่ได้ล้มไปกับพื้น เพราะ ลานี่ จับมือคุณเอาไว้ได้ทัน ในขณะที่เธอก็พยายามสังเกตไปด้วยว่าคุณบาดเจ็บตรงไหนรึเปล่า "
        l " เป็นอะไรรึเปล่าคะ บาดเจ็บตรงไหนรึเปล่า ลุกขึ้นไหวมั้ย "
        l " .......คือว่า"

        " คุณจ้องมองใบหน้าของเด็กสาวอย่างลืมตัว เพราะเธอจับมือคุณไว้ ใบหน้าของพวกคุณจึงไม่ได้ห่างกันมากนัก "
        " ดวงตาของเธอประดับไว้ด้วยความกังวลและมันก็เป็นแบบนี้ตั้งแต่ครั้งแรกที่ลานี่กับเด็กชายได้พบกัน "
        show lfall down2

        l " ..... "

        

        " เมื่อเด็กชายเริ่มสังเกตสีหน้ากระอั่กกระอ่วนของลานี่ได้เพราะเขาไม่รีบลุกขึ้น ทำให้เด็กชายรู้ตัวว่าเขาเผลอจ้องหน้าเธอนานเกินไปจนได้ "

        show lfall down3
        l " อ๊า ลุกขึ้นได้แล้วสินะคะ ดีแล้วละค่ะ "

        jump continue

  label continue:

        scene who1
        with dissolve

        " หลังจากคุณลุกยืนขึ้น ร่างของคนสองคนที่คุ้นเคยก็ปรากฏขึ้นตรงหน้าคุณ "
        " คุณกล่าวคำขอบคุณหลังจากที่โดนช่วยเอาไว้ "

        scene beachdayblur
        show elny angry at left 
        show lany at right, grayed
        e " วันหลังจะไปไหนก็หัดดูทางหน่อยสิ "

        show elny sigh at grayed
        show lany smile at reset_color
        l " ต้องระวังไม่ให้บาดเจ็บ ไม่งั้นเดี๋ยวจะเป็นแผลเป็นเอาได้นะคะ "

        show elny angry at reset_color
        show lany sigh at grayed
        e " ก็ตามที่ลานี่บอก ถ้าเป็นอะไรไปจะทำยังไงฮะ จำไม่ได้รึไงว่าครั้งล่าสุดที่เธอล้มน่ะเธอร้องไห้หนักแค่ไหน??" #elny angry and lany sigh at grayed
        b " อะไรเล่า! เมื่อกี้ก็ไม่ได้ล้มสักหน่อยนี่เอลนี่ขี้บ่น " #elnny angry and lany sigh, both at grayed

        show elny angry at reset_color
        e " นี่! " #elny angry at reset_color
        b " แบร่!! "

        show elny sigh 
        e " เฮ้อ.. เพราะงี้ยังไงล่ะ ฉันถึงได้ไม่ชอบพวกเด็กๆ " #elny sigh

        show elny sigh2 at grayed
        show lany sigh at reset_color
        l " อ.. เอลนี่ อย่าพูดแบบนั้นกับเด็กๆ สิ " #elny sigh2 at grayed and lany sigh at reset_color

        show lany smile
        l " เอาเป็นว่าไม่เจ็บตัวก็ดีแล้วล่ะ เพราะงั้นใจเย็นก่อนนะทั้งสองคน " #elny sigh2 at grayed and lany smile

        show elny sigh2 at reset_color
        show lany smile at grayed
        e " ..... " #elny sigh2 at reset_color and lany smile at grayed

        show elny
        e " เพราะลานี่หรอกนะ ฉันถึงใจเย็นลงน่ะ " #elny and lany smile

        show elny at grayed
        show lany smile at reset_color
        l " แล้วทำไมวันนี้ถึงรีบมาขนาดนี้ละค่ะ ปกติเธอจะมาหาพวกเราช้ากว่านี้นี่นา " #elny at grayed and lany smile at reset_color

        show elny at reset_color
        show lany smile at grayed
        e " นั่นสิ ขอฉันฟังเหตุผลหน่อยว่าอะไรทำให้เธอต้องรีบวิ่งมาขนาดนี้ " #elny at reset_color and lany smile at grayed

        show elny at grayed
        " คุณมองทั้งสองคนก่อนจะเริ่มเล่าสิ่งที่ตัวเองได้ยินมาจากวิทยุ " #elny at grayed and lany smile 


        scene beachdayblur
        #(only)elny sigh2 at center, reset_color 

        show elny sigh2 at center, reset_color 
        with dissolve
        e " ..... "
        e " เข้าใจล่ะ ว่าทำไมตาแก่นั่นถึงอยากให้เธอรีบมาหาพวกเรา "
        e " เธอ.."
        
        show elny sigh3
        e " ต้องย้ายบ้านเร็วๆ นี้แล้วไงล่ะ " #(only)elny sigh3 

        show elny sigh2 
        b " ม.. หมายความว่ายังไงน่ะ เอลนี่พูดเรื่องอะไรอยู่เหรอ " #(only)elny sigh2 at grayed

        show elny sigh3 
        e " ตาแก่นั่นคงอยากให้เธออยู่กับพวกเรามากๆ จะได้สร้างความทรงจำดีๆ ก่อนจากกัน " #(only)elny sigh3 at reset_color
        e " แต่พูดไปเด็กอย่างเธอก็ไม่เข้าใจหรอก สรุปสั้นๆ ก็คือถ้าเขาไม่ย้ายออกไปเร็วๆ นี้ตัวเธอเองรวมถึงครอบครัวคงไม่รอดแน่ " 

        show elny sigh4 
        b " ไม่เห็นจะเข้าใจเลย! ทำไมฉันต้องย้ายออกไปด้วยล่ะ แล้วทั้งสองคนจะตามมาด้วยรึเปล่า " #(only)elny sigh3 at grayed

        show elny sigh3 
        e " พวกฉันไปไหนไม่ได้หรอกนะ " #(only)elny sigh3 at reset_color
        
        show elny sigh 
        b " ทำไมย้ายไม่ได้ล่ะ! " #(only)elny sigh at grayed

        show elny angry 
        e " เป็นเด็กแท้ๆ อย่าถามมากจะได้มั้ย ถ้าฉันพูดไปแล้วคิดว่าตัวเองจะเข้าใจรึไง " #(only)elny angry, reset_color

        scene beachdayblur 

        show elny angry at center
        b " ก็ต้องเข้าใจสิ เพราะพวกเราเป็นเพื่อนกันนี่นา! " #elny sigh3 at left and lany shock at right
      
        scene beachdayblur
        show elny sigh3 at left
        show lany sigh at right
        el " ......" #elny sigh2 and lany sigh at grayed

        show elny sigh3 
        show lany sigh at grayed
        e " เอาเป็นว่าพวกเราก็มีเหตุผลของพวกเราแหละน่า " #elny sigh3 and lany sigh at grayed

        show elny sigh2 at grayed
        show lany sigh at reset_color
        l " เพราะงั้นอยากให้เข้าใจแล้วก็อย่าโกธรพวกเราเลยนะคะ " #elny sigh3 at grayed and lany sigh at reset_color

        b " ....... "

        scene beachdayblur

        show elny at center
        e " ที่นี้ก็เข้าใจแล้วใช่มั้ย เอาล่ะ จากนี้จะขอแนะนำในฐานะเพื่อนละกันนะ " #(only)elny at reset_color with dissolve
        e " ถ้าการคาดการณ์ของฉันไม่ผิด อีกไม่นานน้ำจะสูงขึ้น และในอีกไม่กี่วันที่นี่จะกลายเป็นทะเลด้วยแน่นอน "
        e " เพราะงั้นหลังจากวันนี้ก็เชื่อฟังที่ตาแก่พูดแล้วอย่ามาที่นี่อีก เข้าใจมั้ย.."
        b " ....ไม่เห็นจะเข้าใจเลย " 

        show elny angry
        e " เห็นมั้ยล่ะ! เพราะงั้นตั้งแต่พรุ่งนี้เป็นต้นไปก็อยู่ที่บ้านและอย่ามาที่ทะเล เพราะมันอันตราย เข้าใจมั้ย! " #(only)elny angry
        b " อะไรเนี่ย ทำไมต้องปิดบังกันด้วยเล่า! ทั้งสองคนไม่เห็นจะอธิบายอะไรเลย! ก็ได้! จะไม่มาที่ชายหาดอีกแล้ว "
        b " เอลนี่ใจร้าย! เอลนี่ขี้งก! "
        
        show elny sigh2 
        " เบ็กวิ่งออกไปและไม่หันกลับมามองทั้งคู่อีก โดยที่ไม่รู้เลยว่าใบหน้าของทั้งคู่ประดับความเศร้าสร้อยไว้หลังจากที่เด็กชายวิ่งหนีไปแล้ว " #(only)elny sigh2
        " หลังจากแผ่นหลังเด็กชายห่างไปไกล ลานี่ก็ได้เอ่ยถามพี่ชาย "

        l " จะดีเหรอเอลนี่ ไม่อธิบายอะไรให้เด็กคนนั้นฟังน่ะ แล้วก็เรื่องตัวตนของพวกเรา..."
        show elny sigh3
        e " ช่างเถอะลานี่ ให้เด็กนั่นคิดไปแบบนั้น ดีแล้วล่ะ " #(only)elny sigh3

        play music "dream.mp3" fadeout 1 loop
        scene bs
        with dissolve

        b " ลานี่.. เอลนี่.."
        b " ทั้งสองคน....."
        " ....... "
        " ........... "

        scene bs
        with dissolve
        with hpunch

        b " เหวอ!! "


        scene bedroomday
        play music "morning.mp3" fadeout 1 loop
        
        show wake 1 at center
        b " อูย เจ็บๆ อะไรเนี่ย ฝันหรอกเหรอ.. เพราะจะได้กลับไปที่บ้านเกิดรึเปล่านะก็เลยฝันถึงสองคนนั้นอีก " #wake 1 at center 

        show wake 3
        b " นี่มันก็ผ่านมา20ปีได้แล้วสินะ หลังจากที่เรากับญาติย้ายมาตอนนั้น " #wake 3
        b " พ่อเองก็เสียไประหว่างนั้นแล้วด้วย จากเหตุการณ์เอลนีโญเมื่อ20ปีก่อน ทำไมพ่อถึงไม่ย้ายออกมาพร้อมกับเรากันนะ " 

        show wake 4
        b " อาชีพชาวประมงมีอะไรสำคัญนักหนาถึงกับต้องสละชีวิตเพื่อมันด้วย.. " #wake 4

        show wake 2
        b " แต่เดี๋ยว.. แดดแยงตาขนาดนี้นี่มันกี่โมงแล้วเนี่ย! " #wake 2
        b " ...... " 

        show wake 1
        b " 11 โมง!! ไม่ได้การแล้ว ต้องรีบไปแล้วก่อนที่จะไม่ทันรถ!! " #wake 1

        scene bs
        with dissolve

        scene cityday
        with dissolve
        play music "city.mp3" fadeout 1 loop

        show wait 1 at center
        b " โอย ให้ตายเถอะคนเยอะชะมัด.. จะมีรถบ้างมั้ยนะเวลาป่านนี้แล้ว " #wait 1 at center
        b " คือว่า ขอโทษนะครับ พอจะไปส่งผมที่หาดPaitaได้มั้ยครับ "

        scene cityday

        show driver 3 at right
        show wait 1 at left, grayed
        c " อะไรนะ หาดPaita? หนุ่มๆ แบบนี้มีธุระอะไรถึงต้องไปที่นั่นล่ะ " #driver 3 at right and wait 1 at left, grayed

        show driver at grayed
        show wait 2 at reset_color
        b " ถ้าให้พูดก็คงยาวน่ะครับ พอดีไม่ได้กลับไปนานแล้วเลยจะกลับไปเยี่ยมหลุมศพของพ่อหน่อยนะครับ " #driver 3 at grayed and wait 2 at reset_color

        show driver 2 at reset_color
        show wait 2 at grayed
        c " อย่างงั้นเหรอ อย่าบอกนะว่า พ่อหนุ่มก็เป็นคนที่ต้องหนีจากเหตุการณ์น้ำท่วมจากเอลนีโญเมื่อ20ปีก่อนเหมือนกันเรอะ " #driver 2 at reset_color and wait 2 at grayed

        show driver 2 at grayed
        show wait 2 at reset_color
        b " จะพูดอย่างนั้นก็ได้แหละครับ ผมเองตั้งแต่ย้ายบ้านไปก็ไม่ได้กลับไปอีกเลยน่ะครับ " #driver 2 at grayed and wait 2 at reset_color
        
        show driver 1 at reset_color
        show wait 3 at grayed
        c " คนบ้านเดียวกันนี่เอง! งั้นก็ขึ้นมาสิ เดี๋ยวลุงจะพาไปส่งให้รวดเดียวถึงเลย " #driver 1 at reset_color and wait 3 at grayed

        scene bus
        play music "car.mp3" fadeout 1 loop

        
        " มันก็นานมาแล้วตั้งแต่ที่คุณจะได้เดินทางกลับบ้าน ครั้งล่าสุดที่คุณได้กลิ่นของทะเลเห็นจะเป็นเมื่อ20ปีก่อน "
        " คุณนั่งบนรถบัสเงียบๆ เพียงลำพังเพราะเวลานี้ไม่ใช่เวลารถวิ่ง แต่ลุงคนขับก็ยังอาสาไปส่งทั้งๆ ที่คุณมาสายขนาดนี้ "
        " คงเป็นเพราะว่าคุณเคยมาจากที่ชายหาดนั่นละมั้ง "

        scene bs
        with dissolve
        play music "dream.mp3" fadeout 1 loop


        " คุณหลับตาลง นึกถึงช่วงเวลาดีๆ ที่เคยมีในสมัยยังเป็นเด็ก "
        " ทันใดนั้นใบหน้าของคนสองคนก็พุดขึ้นมาในใจ "

        scene who2
        " สิ่งที่จำได้มีเพียงแค่ชื่อและใบหน้าอันแสนเรือนราง "
        " เป้าหมายอีกอย่างในการกลับไปบ้านเกิดในครั้งนี้ คือการตามหาเพื่อนสมัยเด็กของตัวเองอีกครั้ง.. "
        " เพราะคุณยังจำได้ดีว่าก่อนจากมาคุณพูดจาแย่ๆ ใส่พวกเขาไป ทั้งๆ ที่พวกเขาทำไปทั้งหมดก็เพราะเป็นห่วง "

        b " สองคนนั้นแค่เตือนเราเท่านั้นเอง เราที่เป็นเด็กแต่ไปว่าเขาแบบนั้น "
        b " แย่ที่สุดเลย.."

        scene bs
        with dissolve

        c " เอ้า ถึงแล้วล่ะไอ้หนุ่ม! ตื่นได้แล้วๆ "

        scene arrival
        play music "soft.mp3" fadeout 1 loop

        " คุณลืมตาขึ้นมาก็พบว่าคุณมาถึงชายหาดเป็นที่เรียบร้อย "
        " คุณรีบลงมาจากรถ ก่อนจะเจอแสงแดดยามบ่ายกระทบเข้ากับร่างกาย "

        c " ลุงต้องไปแล้วล่ะไอ้หนุ่ม เพราะอีกเดี๋ยวก็ต้องกลับไปทำงานแล้ว "
        c " ทะเลที่นี่ไม่ได้เปลี่ยนไปเลย ขอเที่ยวให้สนุกล่ะ! "

        " ..... "
        scene beachday
        with fade

        " เป็นไปตามที่คุณลุงคนขับรถพูด ทุกอย่างยังคงเหมือนเดิม ชายหาดไม่เคยเปลี่ยนไปเลย "
        " คุณใช้สายตาทอดมองออกไปเรื่อยๆ หวังจะเก็บบรรยากาศระลึกถึงความหลังเท่าที่ทำได้ "
        " หางตาของคุณก็เหลือบไปเห็นใครบางคนเข้า "

        show lanyb dark at center
        " ด้วยส่วนสูงที่คุ้นเคยและการแต่งกายที่ชวนให้รู้สึกคิดถึงอย่างบอกไม่ถูก "
        " คุณตัดสินใจที่จะลองหันไปหาคนๆ นั้น และแล้วร่างคนที่คุ้นเคยก็ปรากฏสู่สายของคุณ "

        show lanyb 1 with dissolve
        b " ลานี่.. "

        show lanyb 2 
        l " เบ็ก? นั่นเบ็กเหรอ.."

        " เป็นเธอจริงๆ คุณไม่ได้ดูผิดจริงๆ ด้วย! "

        b " ลานี่! ใช่ลานี่จริงๆ ด้วยดีใจจังที่ได้เจอกันอีก ตอนนั้นก่อนที่จะย้ายออกไป ขอโทษนะที่พูดไม่ดีใส่น่ะ " 

        show lanyb 3
        l " ไม่เป็นไรหรอกจ้ะ ตอนนั้นเธอก็ยังเด็กด้วยนี่นา พวกเราไม่โกธรหรอกนะที่เธอจะทำตัวแบบนั้นน่ะ "
        b " ช่วงนี้เป็นยังไงบ้างเหรอ ว่าแต่ลานี่ ทำไมเธอดูแทบไม่เปลี่ยนไปเลยล่ะ ฉันรู้สึกว่าเธอไม่ได้สูงขึ้นเลยนะ "
        b " แล้วก็ทำไมเธอถึงดู.. เศร้าๆ ล่ะลานี่ มีอะไรรึเปล่า "

        show lanyb cry2
        l " ไม่มีอะไรหรอก ก็แค่ฉันดีใจที่ได้เจอเธอน่ะเบ็ก แล้วก็จริงๆ แล้วที่ร่างกายฉันไม่ได้เปลี่ยนไปเลยมันมีเหตุผลอยู่ล่ะ "
        l " ฉันรู้อยู่แล้วว่าสุดท้ายยังไงก็ต้องได้พูดเรื่องนี้สักวัน "
        l " ฉันกับพี่ชายฉันไม่ได้ตั้งใจจะปิดบังเธอเลยนะเบ็ก จริงๆ แล้วพวกเราไม่ได้เป็นมนุษย์หรอกนะ "

        show lanyb cry3
        l " ความจริงก็คือ พวกเราเป็นปรากฏการณ์ทางสมุทรศาสตร์
        ที่จำแลงกายมาต่างหากล่ะ.. "
        
        " คุณมองหน้าลานี่เหมือนว่าเธอเป็นบ้าไปแล้ว ซึ่งหญิงสาวก็ไม่ได้โกธรอะไร "
        " เพราะนั่นก็ควรจะเป็นรีแอคชั่นปกติที่มนุษย์ควรจะมีให้สิ่งเหนือธรรมชาติอย่างพวกเธอจริงๆ นั่นแหละ "
        b " ลานี่ตลกจังพูดอะไรกันเนี่ย- "
        l " ฉันขอโทษนะที่จู่ๆ ก็พูดอะไรแปลกๆ แต่ที่ฉันพูดไม่ใช่เรื่องโกหกหรอกนะ ฉันจะแสดงให้เธอดูเองว่าฉันไม่ใช่มนุษย์ "

        scene dance
        with dissolve
        " ทันทีที่ลานี่พูดจบ หญิงสาวเดินตรงไปที่ทะเลจนน้ำทะเลสูงถึงหัวเข่า
        ก่อนจะตวัดมือของตัวเองขึ้น " 
        " และเริ่มเต้นรำไปพร้อมกับสายน้ำราวกับเธอเป็นหนึ่งเดียวกับมัน "
        
        b " เธอ...ควบคุมน้ำได้?? "

        scene beachday
        with dissolve
        show lanyb 1 
        " แม้จะรู้สึกกลัวแต่เบ็กก็กลั้นใจถามเธอ "

        l " อื้ม ในตอนที่พวกเราเกิดมา รู้สึกตัวอีกทีก็ทำแบบนี้ได้แล้วล่ะ "
        l " พวกเราก็ไม่รู้ด้วยซ้ำว่าทำไมพวกเราถึงต้องเกิดมา สิ่งเดียวที่พวกเรารู้ก็คือพวกเรามีหน้าที่ที่ต้องทำ " #ซูมไปที่ลานี่ที่กำลังเล่นกับน้ำที่เป็นรูปร่างปลาบนมือ

        " ถึงคุณจะไม่อยากเชื่อแต่จะให้ทำยังไงได้อีก ในเมื่อความจริงมาประเคนตรงหน้าแบบนี้ " #ตัดกลับมาที่เบ็กที่เหงื่อตก #เบ็ก at righht with lany at left
        b " ฉันงงไปหมดแล้วลานี่ คือนี่มันอย่างกับอยู่ในหนังรึการ์ตูนเลย "
        b " ไม่ได้ล้อเล่นจริงๆ ด้วยสินะ "

        show lanyb 3 with dissolve
        l " ถ้าเธออยากลองจับ จะลงมาในน้ำก็ได้นะ "
        b " ม ไม่เป็นไร ขอบใจนะ "

        " คุณปฎิเสธเธอไปตรงๆ ก่อนจะสังเกตได้ว่าเอลนี่ไม่ได้อยู่ด้วย "
        b " จะว่าไปตอนนี้เอลนี่เป็นยังไงบ้างเหรอลานี่ "
        show lanyb t
        l " ....... "
        " สีหน้าของลานี่ซีดลง เธอจับมือของคุณให้มานั่งที่โคดหินใกล้ๆ ก่อนจะเริ่มพูดอีกครั้ง "
        
        l " เอลนี่เขาแยกตัวไปอยู่คนเดียวแล้วน่ะ ตั้งแต่เมื่อปีก่อนที่เหตุการณ์ เอลนีโญ เกิดขึ้นที่นี่ "
        b " เอลนีโญ? "
        l " จริงสิ ฉันลืมบอกชื่อเต็มของพวกเราไปเลย "

        show lanyb 2
        l " ชื่อเต็มของฉันคือลานีญา และพี่ชายของฉันเอลนีโญ พวกเราก็คือปรากฏการณ์ทางสมุทรศาสตร์ที่กำลังเกิดขึ้นในประเทศนี้ยังไงล่ะ "
        show lanyb 1
        b " ได้ยังไงล่ะลานี่ แล้วลานี่ที่ฉันเห็นตรงหน้าคืออะไรกันล่ะ "
        l " ฉันก็ไม่รู้เหมือนกัน แต่สิ่งที่เกิดขึ้นอยู่นี่ก็คือพวกเราจริงๆ "
        l " แต่ในศตวรรษที่17 พวกเราถูกค้นพบโดยชาวเปรูว่าพวกเรา
        คือสาเหตุของการเปลี่ยนแปลงอย่างผิดปกติในทะเล "
        l " ตั้งแต่ตอนนั้นมาพวกเราก็มีร่างกายและจิตสำนึกขึ้นแล้วล่ะ "

        show lanyb 2
        l " ฉันกับพี่ชายมีร่างกายที่เป็นอมตะ ไม่รู้สึกหิวและไม่มีวันแก่ แถมพวกเราก็ออกห่างจากทะเลไม่ได้ด้วย "
        b " งั้นแสดงว่าที่พวกเธอไม่ย้ายบ้านไปกับฉันตอนนั้นก็.... "

        show lanyb 1
        l " ใช่ ไม่ใช่ว่าพวกฉันไม่อยากตามเธอไปนะเบ็ก แต่พวกเราไปไม่ได้ต่างหาก "
        b " ลานี่... "
        show lanyb cry3
        l " อย่าทำหน้าเศร้าสิเบ็ก มันไม่ใช่ความผิดเธอหรอกนะ ก็ตอนนั้นพวกเราเลือกที่จะไม่อธิบายเองนี่นา "
        l " พวกฉันเป็นปรากฏการณ์ที่ไม่มีที่มาแถมยังสร้างปัญหาไว้ตั้งมากมายขนาดนี้อีก "
        l " เป็นตัวตนที่ไร้ประโยชน์ เพราะงั้นตอนนั้นเอลนี่เลยเลือก
        ที่จะเก็บไว้เป็นความลับจากเธอยังไงล่ะ "
        show lanyb cry4
        b " แต่เธอก็ไม่ได้อยากให้มันเป็นแบบนี้นี่! พวกเธอไม่ได้อยากทำร้ายใครสักหน่อย "
        show lanyb cry
        l " ..... "
        b " ถึงพวกเธอจะไม่ใช่มนุษย์ แต่ตอนนี้เธอก็มีร่างกายแล้วก็มีความรู้สึกนึกคิดเป็นของตัวเองนี่?! "
        b " ถ้าเลือกได้พวกเธอก็คงไม่ได้อยากทำร้ายโลกใบนี้แล้วก็ใช้ชีวิตเหมือนคนทั่วไป เพราะงั้น- "
        b " อย่าพูดเหมือนกับว่าตัวเองไม่ควรเกิดมาจะได้มั้ยเล่า "

        #maybe elny sudenly appear cuz he sense beck has come back from far away. then they begin to argue while lany try to protect beck from her brother. elny just live at the beach but far away from his sister.
        
        show lanyb cry3
        l " ขอบคุณนะเบ็กที่พูดแบบนั้นน่ะ ฉันขอบคุณมากจริงๆ ที่พยายามเข้าใจพวกเรานะ
        แต่ฉันก็ไม่อยากให้เธอต้องมายุ่งเกี่ยวกับพวกเราไปมากกว่านี้แล้วล่ะ "

        b " หมายความว่ายังไงน่ะลานี่ "
        show lanyb cry2
        l " ฉันคิดมาสักพักแล้วล่ะตั้งแต่ที่เธอจากไป ตั้งแต่ที่เอลนี่เปลี่ยนไป เบ็ก รู้รึเปล่าว่าตอนนี้เขาเป็นยังไงบ้าง "
        l " จริงสิ ฉันพูดอะไรไปเนี่ยเธอจะไปรู้ได้ยังไง งั้นฉันจะอธิบายให้เธอฟังเองว่าตอนนั้นมันเกิดอะไรขึ้น..."

        #flashback come in
        #So many fuckin cutscene
        l " เธอรู้อยู่แล้วใช่มั้ย ว่าโลกนี้มีสิ่งที่เรียกว่าวัฏจักรของสภาพอากาศ เดิมที่ก็มีแค่พวกเขาที่อยู่บนโลกใบนี้นี่แหละ "

        l " อย่างที่ฉันพูดไปก่อนหน้านี้ เมื่อราวๆ ศตวรรษที่17ในตอนที่พวกเราถูกค้นพบ ในตอนนั้นฉันยังไม่เกิดมาหรอกนะมีแค่เอลนี่เท่านั้น "

        scene ex1
        with dissolve
        l " ในตอนนั้นเองที่ชาวประมงคนนั้นสังเกตถึงความผิดปกติ
        ของจำนวนของปลาในน้ำที่ลดน้อยลง "

        scene rainning
        with dissolve
        l " แถมยังพบว่าช่วงท้ายปีที่ควรจะหนาวจู่ๆ ก็ฝนตก "

        l " ก็เลยสัญนิษฐานกันว่าเป็นปรากฏการณ์เหนือธรรมชาติในวันที่พระเยซูประสูติน่ะ
        จากนั้นเขาก็ถูกตั้งชื่อว่า เอลนีโญ ที่แปลว่าเด็กชายในภาษาสเปนด้วยล่ะ "
        l " ไม่นานหลังจากนั้น เอลนี่ก็มีตัวตนและจิตใจขึ้นมา "

        scene beachday
        with dissolve
        show lanyb 1 with dissolve
        l " หลังจากนั้นผ่านมาจนศตวรรษที่20 ตอนนั้นที่ฉันก็เกิดมาสภาพอากาศตอนนั้นแย่ลงมากๆ "

        scene dirt
        with dissolve
        l " เปรูไม่มีฝนตกเลยแถมพื้นดินก็เริ่มแห้งแล้ง ฉันก็รู้ตัวได้ในทันที
        ว่าฉันคือปรากฏการณ์ตรงกับข้ามกับพี่ชายของฉัน "

        scene dirt2
        with dissolve
        l " และฉันก็ถูกตั้งชื่อโดยมนุษย์ว่า ลานีญา ที่แปลว่าเด็กสาวในสเปนตามพี่ชาย "

        scene beachday
        with dissolve
        show lanyb 3 with dissolve
        l " ในตอนที่ฉันรู้สึกตัวฉันแทบไม่รู้อะไรเกี่ยวกับตัวเองเลย ก็ได้เอลนี่นี่แหละช่วยเอาไว้ "
        l " พวกเราสองพี่น้องอยู่ด้วยกันที่ชายหาดมาเป็นปีๆ ได้เจอผู้คนมากมาย รวมถึงเธอด้วยนะเบ็ก "
        show lanyb t
        l " ก่อนหน้านี้เอลนี่ก็ไม่ได้อาการแย่ขนาดนี้หรอกนะ แต่ตั้งแต่ที่พ่อของเธอเสียไป เขาก็อาการแย่ลงมากๆ เลยล่ะ "
        l " โดยปกติพี่ชายกับฉันจะพลัดกันทำหน้าที่น่ะ จะมีหน้าที่ดูแลสภาพอากาศเป็นหลัก "
        l " ส่วนฉันก็แค่คอยมาช่วยเขาบ้างในตอนที่เขา
        ทำท่าจะรับมือกับอากาศแปรปรวนคนเดียวไม่ไหวนี่แหละ "

        #pollution
        l " ปกติแล้วปรากฏการณ์เอลนีโญไม่เคยแปรปรวนหนักขนาดนี้มาก่อนหรอก
        แต่10ปีที่ผ่านมานี้ โลกได้เปลี่ยนแปลงไป "
        l " มีมลพิษเกิดขึ้นมากมายทั่วโลก อาการของพวกเราก็แย่ลงเรื่อยๆ "

        #lany take effect from pollution
        l " ขนาดฉันเองก็ยังแทบจะคุมตัวเองไม่ไหวเลยนะ
        แต่เอลนี่ที่มีหน้าที่หลักในการคุมสภาพอากาศก็ได้รับผลกระทบเยอะที่สุด "

        scene argue
        with dissolve
        l " เขาเริ่มไม่ได้ยินเสียงรอบข้างหรือว่าเสียงฉัน บางทีก็ทำลายข้าวของไปทั่ว
        อย่างเลวร้ายที่สุดคือเขาแยกไม่ออกว่าฉันเป็นน้องสาวของเขา "    
        l " ตอนที่พี่เขาได้สติขึ้นมาอีกทีตอนนั้นพี่ก็พยายามไล่ฉันออกไปห่างๆ
        เพราะเขากลัวว่าตัวเองจะทำร้ายฉันขึ้นมา "
        l " ฉันเองก็พยายามคุยกับเขาแล้ว เพราะร่างกายที่เป็นอมตะ
        ฉันเลยไม่มีทางตายได้อยู่แล้ว แต่เขาก็เลือกที่จะจากฉันไป "

        scene beachday
        with dissolve
        show lanyb t with dissolve
        l " เป็นคนที่หัวรั้นมากเลยนะ คนๆ นั้น "
        
        " เมื่อนึกถึงพฤติกรรมปากไม่ตรงกับใจแถมยังหัวดื้อของเอลนี่ ลานี่ถอนหายใจ "

        show lanyb 1
        l " ในเมื่อเธอรู้เรื่องทั้งหมดแล้ว ก็ถึงเวลาที่เธอต้องกลับไปแล้วล่ะเบ็ก
        ฉันน่ะว่าไปอย่างแต่เธอน่ะเป็นแค่มนุษย์นะ "
        l " ฉันจะไม่ยอมให้เธอได้ไปเจอเอลนี่ในสภาพนั้นหรอก
        รีบกลับไปแล้วก็อย่าได้กลับมาที่นี่อีก ลืมเรื่องพวกเราไปซะ "   
        l " จะให้ฉันแบบนั้นยังไงละ หลังจากที่ฉันรู้ว่าพวกเธอกำลังลำบากมากแค่ไหน?? "

        show lanyb w
        l " มันไม่สำคัญอีกแล้วเบ็ก ตอนนี้เธอต้องรีบกลับไปนะ เดี๋ยวนี้เลย "

        " สีหน้าอีกฝ่ายดูซีเรียสขึ้นอย่างเห็นได้ชัด คุณสัมผัสได้ว่าจู่ๆ
        ลานี่ก็ดูร้อนรนขึ้นมามาก คุณพยายามจะอธิบายให้เธอฟัง "

        show lanyb shock
        stop music fadeout 1
        " แต่แล้วก็มีเสียงเด็กหนุ่มดังขึ้นจากด้านหลังเด็กสาว
        มันเป็นเสียงที่คุณยังจำได้ดี "

        " ราวกับว่าคุณพึ่งได้ยินเมื่อวาน "

        e " ก็ว่าได้ยินเสียงคุ้นๆ ที่แท้ก็เป็นนายนี่เอง "
        b " เอลนี่!! นั่นนายใช่มั้ยฉันมีเรื่องจะ- "

        scene argue2
        with dissolve
        " ทันทีที่คุณจะพยายามเดินไปหาเอลนี่ เด็กสาวก็เดินมาขวาง
        ระหว่างเด็กหนุ่มกับคุณไว้ก่อนจะหันไปหาพี่ชาย "

        play music "intense.mp3" fadeout 1 
        " เอลนี่ปรากฏตัวขึ้นในสภาพที่ดูย่ำแย่ แววตาดูหมองลงไปมาก 
        ขอบตาก็ดำคล้ำ ผมกระเซอะกระเซิงดูเหมือนกับไม่ใช่เอลนี่ที่คุนรู้จัก "
        l " หยุดนะเอลนี่ พี่จะทำร้ายเขาไม่ได้นะ!! เขาก็แค่อยากจะช่วยพี่เท่านั้นเอง ?!"
        e " ฉันไม่ต้องการให้ใครช่วยทั้งนั้น ถอยไปซะลานี่ "

        scene scary
        with dissolve
        e " ถ้าเจ้าเด็กนั่นอยากจะช่วยฉันนักก็ให้มันมาเจอฉันสิ "
        " เอลนี่ไม่สนใจคำท้วง ทั้งยังจ้องมาที่เบ็กเขม็ง คล้ายกับว่ากำลังแค้นอะไรบางอย่าง "
        " คุณเริ่มกระสับกระส่าย ราวกับว่าสิ่งที่อยู่ตรงหน้าไม่ใช่คน "
        " ถึงรูปร่างหน้าตาจะคล้ายกัน แต่เอลนี่ตอนนี้ก็ทำเอาคุณกลัวจนก้าวขาไม่ออก "

        scene bs
        with dissolve
        with hpunch
        " ลานี่หน้าซีดตอนที่เอลนี่เดินใกล้เข้ามาอีกก้าว เธอรีบหันกลับมาหาคุณก่อนจะรีบพลักคุณออกไปให้ไกลที่สุดด้วยพลังของเธอ "
        " คุณถูกลานี่พลักเข้าอย่างจังจนคุณล้มถลาไปไกล เมื่อลุกขึ้นมาอีกทีก็พบว่าลานี่กับเอลนี่จากไปแล้ว "
        " เย็นวันนั้นเพราะเหตุการณ์เมื่อครู่ทำให้คุณไม่สามารถทนอยู่ที่นี่ต่อไปได้
        และรีบเรียกรถกลับบ้านของคุณด้วยความกลัว"

        scene bedroomday
        with fade
        play music "morning.mp3" fadeout 1 

        " ตั้งแต่เรื่องวันนั้นก็ผ่านมาสองวันได้แล้ว "
        " คุณก็ไม่ได้กลับไปที่ชายหาดอีกเลยตั้งแต่ตอนนั้น คุณไม่สามารถสลัดความกลัวที่มีต่อเอลนี่ได้ 
        แม้คุณอยากจะช่วยเขามากแค่ไหนก็ตาม "
        " คุณพร่ำคิดกับตัวเองตลอดสองวันนี้ว่าคุณควรจะทำตามที่ลานี่บอกหรือจะกลับไปที่ชายหาดนั่นดี "

        b " ออกไปข้างนอกให้สมองแล่นสักหน่อยดีกว่า "

        scene bs
        with fade
        " คุณที่คิดได้แบบนั้นก็ลุกขึ้นไปอาบน้ำก่อนจะเตรียมตัวให้พร้อมออกไปเดินเล่นในเมือง "
        " เมื่อเตรียมตัวเสร็จคุณก็รีบออกไปทันทีโดยที่ไม่ลืมล็อคห้อง "

        scene cityday
        with fade
        play music "city.mp3" fadeout 1 loop
        " ในเมืองยังสดใสเช่นเคย ผู้คนพลุกพล่านและรถมากมายขับผ่าน "
        " คุณตัดสินใจที่จะไปทานข้าวเช้าที่ร้านประจำ ขาของคุณเดินไปอย่างมั่นคง "

        scene restuarant11
        with dissolve
        play music "resam.mp3" fadeout 1 loop
        " ไม่นานคุณก็เดินมาถึงร้านประจำ มีสาวเสิร์ฟออกมาต้อนรับและพาคุณ
        ไปยังที่นั่งข้างหน้าต่างที่มีคนนั่งอยู่ก่อนแล้ว "
        " เธอกล่าวขอโทษ เพราะตอนนี้ในร้านเป็นเวลาเร่งรีบทำให้ไม่ค่อยมีที่ว่างในร้านมากนัก "
        " คุณบอกปัดสาวเสิร์ฟก่อนจะสั่งเมนูเดิมอย่างที่คุณสั่งประจำ "

        scene restuarant1
        with dissolve
        " เมื่อคุณเงยหน้าขึ้นมาจากเมนูคุณก็เห็นใบหน้าที่คุ้นเคย "
        " และสายตาของคุณกับเขาก็สบเข้าด้วยกัน "


        b " คุณลุงดิเอโก้? "

        scene restuarant2
        d " อ้าว นี่มันเจ้าร้อดตัวน้อยนี่! บังเอิญจังเลย ไม่เจอกันตั้ง5ปีโตขึ้นอีกแล้วนะ "
        b " คุณก็ยังดูหนุ่มเหมือนเคยเลยนะครับ ว่าแต่ผมบอกแล้วนี่ครับว่าอย่าเรียกผมแบบนั้น "
        d " อ้อ โทษทีๆ พอดีว่านายหน้าตาเหมือนพ่อของนายมากเลยน่ะสิเลยอดไม่ได้น่ะ "
        scene restuarant1
        d " ว่าแต่เป็นยังไงบ้างล่ะตั้งแต่ที่นายขอย้ายออกไปเพราะบอกว่าอยากยืนด้วยลำแข้งตัวเอง "
        d " ทั้งๆ ที่จะอยู่บ้านฉันตลอดไปก็ได้แท้ๆ ยังไงพวกเราก็เป็นครอบครัวกันนี่ "
        b " ไม่ได้หรอกครับดิเอโก้ ผมเองก็โตแล้วด้วยจะมัวแต่ให้คูณดูแลได้ยังไงละ "

        scene restuarant2
        with dissolve
        d " ยังทำตัวโตเกินไวไม่เปลี่ยนเลยนะ "
        d " แต่วันนี้สีหน้านายดูแย่ลงนะ เป็นอะไรล่ะนอนไม่พอรึไง "

        scene bs
        with fade

        " คำพูดของดิเอโก้ทำให้คุณนึกถึงเรื่องของสองพี่น้อง
        บางทีคุณคงจะคิดมากเกินไปจนเก็บสีหน้าเอาไว้แล้วไม่อยู่จริงๆ "
        
        scene restuarant1
        with dissolve
        b " ก็นิดนึงน่ะครับ พอดีว่าผมทะเลาะกับเพื่อนมาน่ะ "
        d " เพื่อน? "
        b " อื้ม เป็นเพื่อนสมัยเด็กที่เคยสนิทกันมากๆ แต่ดูเหมือนเขาจะไม่อยากคุยกับผมแล้ว "

        " คุณตัดสินใจที่จะไม่เล่าเรื่องทั้งหมดให้เกี่ยวกับสองพี่น้องให้ดิเอโก้ฟัง "
        " แทนที่คุณจะได้รับการตอบกลับจากดิเอโก้ในทันที ดิเอโก้กลับทำสีหน้าครุ่นคิดแทน "


        scene restuarant3
        with dissolve
        b " ดิเอโก้?? "
        d " ว- ว่ายังไงนะเบ็ก "
        b " ก็คุณดูเหม่อๆ น่ะสิ "
        d " อ้อ คือว่านะเบ็ก เด็กที่นายพูดถึงคงไม่ใช่สองพี่น้องที่อยู่ที่ทะเลหรอกใช่มั้ย? "
        b " คุณรู้ได้ยังไงน่ะ "
        d " จะเริ่มเล่าจากตรงไหนดีละเนี่ย "
        b " ครับ?? หมายความว่ายังไง... "
        d " โอ๊ะ โทษทีๆ อาหารมาเสิร์ฟจนได้ ลุงขอทานก่อนละกันนะ "
        
        scene bs
        with dissolve
        " ดิเอโก้ยิ้มให้คุณก่อนที่คุณจะเริ่มจัดการกับอาหารตรงหน้าที่พึ่งมาเสิร์ฟสดๆ ร้อนๆ ให้หมด "
        " หลังจากที่จัดการกับอาหารตรงหน้าเสร็จ เขาก็เริ่มเล่า "

        scene frestuarant1
        with dissolve
        d " จากที่เธอเล่ามาเมื่อกี้ฉันเดาว่าลานี่คงบอกแล้วสินะ ว่าจริงๆ แล้วพวกเธอเป็นใคร "
        b " ครับ ได้ยินว่าพวกเธอคือปรากฏการณ์ทางสมุทธศาสตร์ "
        d " ใช่แล้ว แถมพวกเขายังรูปร่างเหมือนมนุษย์แต่ก็ไม่แก่ไม่ตายด้วย "
        d " พวกลุงกับร้อดดิโก้เองก็เคยเจอพวกเอลนี่ตั้งแต่สมัยเด็กๆ แล้วล่ะ "
        b " งั้นก็หมายความว่าพวกคุณเป็นเพื่อนสมัยเด็กกันเหรอครับ?! "
        d " ตกใจล่ะสิ ฮ่าๆ ใช่ พวกเราเป็นเพื่อนสมัยเด็กกัน
        พนันได้เลยว่าตอนนี้เอลนี่ยังเตี้ยเหมือนเดิมแน่นอน "

        scene frestuarant4
        " เมื่อดิเอโก้พูดถึงเอลนี่ก็อดทำให้คุณนึกถึงเหตุการณ์เมื่อวันก่อนไม่ได้ "
        " คุณยังคงรู้สึกหวาดกลัวเอลนี่ไม่หาย "

        b " นั่นสินะครับ ฮ่าๆ "
        d " เป็นอะไรไปล่ะเบ็ก ทำไมจู่ๆ ก็หน้าซีดไปละ "

        scene bs
        with fade
        " คุณลังเลสักครู่ก่อนจะเล่าเรื่องทั้งหมดให้ดิเอโก้ฟัง "

        play music "main.mp3" fadeout 1 loop
        scene frestuarant5
        with dissolve
        d " เจ้าเด็กบ้า!! ถ้าไม่ได้ลานี่ช่วยเอาไว้รู้มั้ยจะเกิดอะไรขึ้น?! "
        b " ผมก็แค่อยากจะเจอเอลนี่เท่านั้นเอง "
        d " ให้ตายสิ แต่ไม่เป็นอะไรก็ดีแล้วล่ะ "
        b " ผมไม่เห็นเข้าใจเลยว่าทำไมเอลนี่ถึงต้องโกธรผมขนาดนั้นด้วย "

        scene frestuarant4
        d " เบ็ก ลุงเข้าใจว่านายอยากจะเจอเอลนี่นะแต่ว่าตอนนี้น่ะยังไม่ได้หรอก "
        b " ทำไมล่ะครับดิเอโก้! นี่มันเกิดเรื่องอะไรขึ้นกันแน่ "
        b " มีอะไรบางอย่างที่ผมยังไม่รู้เหรอครับ?! "
        d " ใจเย็นๆ ก่อนเบ็ค ยังจำได้ใช่มั้ยว่าแม่ของนายเสียไปได้ยังไง "

        " คุณทำหน้าสับสนกับคำถาม "
        b " ครับ พ่อของผมบอกว่าเธอเสียชีวิตหลังจากที่คลอดผม "

        scene frestuarant3
        d " ใช่แล้ว แม่ของนายเสียชีวิตไปทันทีหลังจากที่คลอดนาย 
        แต่จริงๆ แล้วมีบางอย่างที่ร้อดดิโก้ยังไม่ได้บอกนาย "

        scene bs
        with dissolve
        play music "sadfight.mp3" fadeout 1 loop

        scene drive
        with dissolve
        d " วันนั้นตอนที่เธอกำลังจะคลอด ก่อนจะถึงโรงพยาบาลดันมีพายุฝนเข้าพอดี
        ทำให้เราไม่สามารถขับรถเร็วมากกว่านี้ได้"
        d " มันเป็นเรื่องที่ช่วยไม่ได้ถ้าเกิดจะทำให้ไปถึงมือหมอช้า "
        d " ไม่มีใครโทษว่ามันเป็นความผิดของใครที่เธอจากไป
        เพราะเดิมทีเแม่ของนายก็มีร่างกายที่อ่อนแออยู่แล้ว "

        scene grief
        with dissolve
        d " แต่หลังจากที่เอลนี่รู้เรื่อง หมอนั่นก็โทษตัวเองซ้ำๆ 
        ว่าที่แม่ของนายตายเป็นเพราะตัวเองเป็นตัวต้นเหตุที่ทำให้เกิดพายุ "
        d " ถ้าได้ฟังจากลานี่นายคงเข้าใจแล้วสินะว่า ปรากฏการณ์เอลนีโญทำอะไรได้บ้าง "

        scene frestuarant3
        with dissolve
        d " แน่นอนว่าพวกเรารู้ดีอยู่แล้วว่าเอลนี่ไม่ได้เป็นคนทำให้พายุเกิดขึ้น "
        d " พวกเราพูดยังไงหมอนั่นก้ไม่ยอมฟังกันเลย "
        d " แถมยังหนีหายไปดื้อๆ ไม่ยอมโผล่มาให้เห็นหน้าอีกเลย "

        scene frestuarant1
        d " พอเอลนี่กับลานี่หายตัวไป พ่อของนายก็เก็บตัวแล้วก็ทิ้งนายไว้ให้ฉันดูแลยังไงล่ะ "
        d " แล้วอยู่มาวันนึงนายก็หายไปพวกฉันต้องออกตามหากันแทบแย่ "
        b " ขอโทษนะครับที่ตอนเด็กๆ ผมทำให้ต้องลำบากบ่อยๆ "
        scene frestuarant2
        d " ไม่เป็นไรหรอกๆ ฉันเองก็ผิดด้วยที่ดูแลนายไม่ดีกว่านี้ 
        ตอนนั้นฉันบังเอิญไปเจอนายอยู่ที่ทะเลเข้า "

        scene bne
        with dissolve
        d " นายกำลังอยู่กับเอลนี่ กำลังคุยกันที่ชายหาดนั่น ดูสนุกมากๆ เลยล่ะ "
        d " แต่ก็ไม่รู้ว่าทำไมเอลนี่ที่หายตัวไปจู่ๆ ก็โผล่ออกมาหรอกนะ "
        b " ผมเหรอครับ? "
        d " ใช่ นายในวัยสี่ขวบเป็นคนไปเจอหมอนั่นและหลังจากนั้นก็
        กลายเป็นว่าพวกนายดันกลายเป็นเพื่อนสนิทกันอีก "
        d " ฉันนี่ดีใจจนแทบน้ำตาไหลเลยนะ พ่อของนายก็รีบมาหานายทันทีทั้งน้ำตาเลย "
        d " ตอนที่รู้ว่าเอลนี่กลับมาแล้วน่ะ "
        d " หมอนั่นเองก็อยากจะขอโทษเอลนี่เหมือนกัน 
        แต่ดูเหมือนว่านอกจากนายแล้ว- "
        d " เอลนี่ก็ไม่โผล่ออกมาให้ใครเห็นเลยน่ะสิ "

        scene frestuarant2
        with dissolve
        d " เดิมทีแล้วพวกเธอทั้งคู่ไม่น่ามีโอกาสได้เจอกันเลยแท้ๆ "
        d " จะบอกว่าเป็นเพราะโชคชะตานำพาก็คงจะใช่ "

        scene frestuarant4
        d " แล้วก็เกี่ยวกับสาเหตุว่าทำไมพ่อของนายถึงยึดติดกับทะเลนี้นัก "
        b " ครับ ผมยังจำได้ ไม่ว่าจะพูดยังไงพ่อก็ไม่ยอมย้ายออกมาสักที "
        b " มันแปลกมากเลยไม่ใช่เหรอครับ? อะไรที่ทำให้พ่อของผมต้องทำถึงขนาดนั้นด้วย "

        scene bs
        with dissolve
        play music "main.mp3" fadeout 1 loop
        " คุณเผลอกำหมัดโดยที่ไม่รู้ตัวจนซีดขาว ความทรงจำต่างๆ 
        เมื่อหลายปีก่อนมันย้อนเข้ามาอีกครั้ง "
        " นึกถึงหน้าของพ่อ สีหน้าอันเศร้าสร้อยแต่ก็เต็มเปี่ยมไปด้วยความมุ่งมั่น "
        " พ่อยืนยันจะอยู่ที่นั่นจนช่วงสุดท้ายของชีวิต "
        " ลุงดิเอโก้ตบไหล่ๆ ของคุณเบาๆ "

        scene frestuarant3
        with dissolve
        d " ลุงรู้ว่าเรื่องแบบนี้มันทำใจยาก ลุงเองก็ไม่เห็นด้วยเหมือนกัน
        ที่ต้องเห็นน้องชายตายไปต่อหน้าต่อตา "
        d " ร้อดดิโก้น่ะเป็นคนที่ยึดติดมากว่าที่คิดน่ะ ทั้งเรื่องการตายของเบลนด้า "
        d " แล้วก็เรื่องของเอลนี่ ไม่ใช่ว่าร้อดดิโก้เกลียดนายหรอกนะ "
        d " ถึงจะเป็นทั้งน้องชายตัววุ่นแล้วก็ทำหน้าที่พ่อได้ไม่ดีนัก "
        d " ถึงอย่างงั้นก็อย่าเกลียดพ่อของตัวเองเลยนะเบ็ก "

        scene frestuarant1
        d " ถึงจะไม่แสดงออกมาแต่จริงๆ แล้วเขาก็รักนายมากนะ "
        b " เรื่องนั้นผมก็พอจะเดาได้ครับ แต่ผมก็แค่....
        หวังว่าพวกเราจะได้ใช้เวลาอยู่ด้วยกันมากกว่านี้ "
        b " ได้ฟังเรื่องของเอลนี่แล้วก็ลานี่จากปากพ่อเอง "
        b " ถึงจะได้รู้ความจริงแล้ว ผมก็ยังทำใจไม่ได้อยู่ดีครับ "

        b " แต่ว่าถึงผมยังไม่หายโกธรพ่อแต่ผมก็อยากเอาไว้จัดการทีหลังน่ะครับ "

        scene frestuarant3
        d " หมายความว่ายังไงน่ะเบ็ก "
        b " ผมอยากจะไปจัดการเรื่องของเอลนี่กับลานี่ก่อนน่ะครับ "
        b " อยากจะไปปรับความเข้าใจกับเขาครับ ไว้ทำเรื่องทุกอย่างเสร็จเมื่อไร "

        scene frestuarant1
        b " ผมคงจะหายโกธรพ่อสักนิดล่ะมั้งครับ "

        " หลังจากนั้นคุณกับลุงดิเอโก้ก็ร่ำลากัน แม้จะยังสับสนกับเรื่องในอดีต
        ที่พึ่งได้รับรู้แต่คุณก็ไม่ได้อยากจะมัวย่ำอยู่กับที่ "
        " คุณทบทวนถึงเรื่องราวต่างๆ และเหตุการณ์ที่คุณได้พบ
        ตอนที่มาถึงชายหาดครั้งแรก "
        " และนั่นทำให้คุณสรุปได้ว่า คุณต้องไปคืนดีกับเอลนี่ให้ได้
        และจัดการเรื่องเข้าใจผิดนี่ให้หายไปสักที! "

        scene bs
        with dissolve

        scene beachnight
        with dissolve
        play music "intense.mp3" fadeout 1 loop

        " เมื่อคุณเดินทางมาถึงที่ชายหาดอีกครั้ง คุณเดินมาตามทางก่อนจะพบ
        สองร่างกำลังตะเกียกตะกายกันอยู่บนพื้น"
        " ด้วยความสงสัยคุณจึงเดินเข้าไปใกล้ๆ ก็พบกับเอลนี่ที่กำลังบีบคอลานี่อยู่?! "

        b " เอลนี่หยุดนะ!!!! "

        scene choice
        with dissolve
        " เจ้าของชื่อละสายตาขึ้นมาเจอคุณก็ปล่อยมือออกจากคอบาง
        และพุ่งเข้ามาเพื่อที่จะคว้าคอคุณแทนทันที! "

  menu:

        " คุณจะทำยังไง? "

        "วิ่งหนีไปให้ไกลที่สุด":
            jump BadEnd

        "พยายามจะคุยด้วย":
            jump Next

  label BadEnd:

              scene bd1
              with dissolve
              play music "sadfight.mp3" fadeout 1 loop

              " ถึงแม้คุณจะรู้เรื่องต่างๆ และอดีตของเอลนี่มาแล้ว
              แต่คุณยังกลับยังคงรู้สึกกลัวเด็กตรงหน้า "
              " อย่างไรซะ แค่ตัวตนของพวกคุณก็ต่างกันแล้ว
              นั่นย่อมทำให้คุณรู้สึกหวาดกลัวเป็นธรรมดา "
              " คุณเลือกที่จะวิ่งหนีไปอย่างคนขี้ขลาด
              และทิ้งสองพี่น้องไว้ตรงนั้น โดยไม่หันกลับไปอีก "

              return

  label Next:

              scene beachnight
              with dissolve

              show elnyb angry with dissolve
              " คุณเลือกที่จะไม่หนีและพยายามจะคุยกับเอลนี่ แต่เขาก็ไม่ฟัง "
              " เอลนี่ออกแรงบีบที่คอของคุณ ทำให้คุณรู้สึกเริ่มขาดอากาศหายใจ "
              " แต่เพราะคุณยังไม่ยอมแพ้ก็เลยพยายามขัดขืนสุดความสามารถ
              และพยายามเรียกสติเอลนี่ให้กลับมาด้วย "

              b " ได้สติสักทีสิเอลนี่!!!! นี่ฉันเองนะ เบ็กไง?! "

              show elnyb angry2
              e " หุบปาก! ออกไปให้พ้นก่อนที่ฉันจะหักคอแกซะ "

              b " ฉันไม่ไป! ฉันมีเรื่องที่จะต้องคุยกับนายนะเอลนี่?! "

              show elnyb angry
              e " แต่ฉันไม่มี "

              scene choice2
              with dissolve
              " แรงบีบที่คอของคุณเพิ่มขึ้นอย่างมหาศาลจนตาเริ่มพร่ามัว "
              " อากาศที่ใช้หายใจเริ่มลดน้อยลงเรื่อยๆ
              ถ้าหากคุณไม่รีบทำอะไรสักอย่าง คงไม่พ้นต้องจบอยู่ที่นี่แน่ "


  menu:

        " คุณจะทำอะไร? "

        "พยายามเรียกให้ลานี่ช่วย":
            jump BadEnd2

        "ต่อสู้กลับ":
            jump Next2

  label Next2:

              scene beachnight
              with dissolve
              show elnyb angry2 with dissolve
              

              " คุณต่อยเข้าไปที่หน้าเอลนี่อย่างแรงเพื่อเรียกสติ "
              " ทำให้เอลนี่ลุกออกไปจากตัวคุณได้สำเร็จ "
              " เอลนี่กุมใบหน้าด้วยความเจ็บปวดและมองไปที่คุณด้วยความโกธร "
              " แต่คุณก็ไม่ได้ยอมแพ้และลุกขึ้นเผชิญหน้ากับเขา "

              jump continue2


  label BadEnd2:

              scene choice3
              with dissolve
              play music "sadfight.mp3" fadeout 1 loop

              " คุณพยายามเรียกให้ลานี่ช่วยแต่เด็กสาวกลับอ่อนแรงเกินกว่าจะลุกขึ้น "
              " ทำให้ลานี่ไม่สามารถช่วยคุณได้ "
              " แรงบีบอันมหาศาลถาโถมเข้ามาที่ช่วงคอของคุณ "
              " ตาของคุณเริ่มค่อยๆ พร่ามัวจนสุดท้ายคุณก็สิ้นใจ "        

              #scene bad end's picture that i have to draw myself | badend2 by your hand

              return

  label continue2:

              " เอลนี่พร้อมที่กระโจนเข้าหาคุณอีกครั้งแต่คุณก็หยุดเขาไว้ "
              show elnyb confuse
              b " ฟังนะเอลนี่ ฉันรู้ทุกเรื่องที่เกิดขึ้นแล้ว!! "

              " ได้ผล! เอลนี่นิ่งค้างไปจริงๆ ด้วย คุณคิด "
              b " ลุงดิเอโก้น่ะเป็นคนบอกฉันทั้งหมดแล้วว่าที่
              นายกลายเป็นแบบนี้เพราะเรื่องเมื่อหลายปีก่อน!"
              show elnyb angry2
              e " ถ้ารู้อย่างนั้นแล้วทำไมนายถึงยังไม่หนีไปอีก?! อยากเป็นเหมือนพ่อกับแม่นักรึไง! "
              b " ไม่ใช่สักหน่อยเอลนี่ ทุกอย่างมันไม่ใช่ความผิดของนายเลยนะ "
              e " ที่พวกท่านจากไปมันก็เป็นแค่อุบัติเหตุ
              ฉันไม่เคยว่านายเป็นต้นเหตุของเรื่องแม้แต่นิดเดียว! "
              show elnyb confuse
              e " แต่เพราะฉันทุกคนถึง- "
              b " แล้วฉันเองก็เห็นนายแล้วก็ลานี่เหมือนเป็นเหมือนครอบครัว "

              " เอลนี่นิ่งไปหลังจากที่ได้ยิน "

              b " ถึงฉันเสียทั้งพ่อแล้วก็แม่ไปแล้วแต่ฉันก็ยังมีพวกนาย
              ที่คอยอยู่ข้างฉันมาตั้งแต่เด็กๆ นี่ "
              b " ฉันไม่อยากเสียคนในครอบครัวไปมากกว่านี้แล้วเอลนี่ "
              b " ช่วยกลับมาได้มั้ย กลับมาหาลานี่ แล้วก็ฉัน? "
              show elnyb confuse2
              e " ทำไม "
              e " ทำไมถึงต้องมาให้อภัยสัตว์ประหลาดอย่างฉันด้วย "
              e " เพราะฉันควบคุมเหตุการณ์เอลนีโญไม่ได้ เรื่องมันถึงได้กลายเป็นแบบนี้ "
              l " พี่คะ... "
              e " รู้แล้วก็ยังอยากจะนับฉันเป็นครอบครัวอีกรึไง "
              b " นับสิ สำหรับฉันเอลนี่ก็ยังเป็นเอลนี่คนเดิมนั่นแหละ "
              l " ฉันก็ด้วย ต่อให้เอลนี่จะทำตัวห่างเหินกับฉัน
              แต่เอลนี่ก็ยังเป็นพี่ของฉันเสมอนะ "
              show elnyb calm
              e " ต่อให้ฉันจะไม่ใช่มนุษย์ เป็นแค่สัตว์ประหลาดฆ่าคนน่ะเหรอ "

              show elnyb confuse2
              b " ไม่ว่าใครจะพูดยังไงสำหรับฉันนายคือคนสำคัญของฉันเอลนี่ "
              b " กลับมาเถอะนะ ขอร้องล่ะ "
              l " กลับมาหาพวกเราเถอะนะเอลนี่ "

              play music "soft.mp3" fadeout 1 loop
              " คุณยื่นมือออกไปหาเอลนี่ช้าๆ ภายในตาของเขาเต็มไปด้วยความลังเล "
              " ทว่าตั้งแต่ที่คุณได้ก้าวขาเข้ามาในเหตุการณ์นี้ ทำให้เอลนี่รู้สึกวางใจมากยิ่งขึ้น "

              show elnyb calm2
              " ทำให้เอลนี่เลือกที่จะจับมือคุณเอาไว้ และเลือกที่จะยอมรับในตัวตนของตัวเอง "
              
              e " ฉันจะไม่อ้างว่าเรื่องทั้งหมดเป็นเพราะว่าฉันคุมตัวเองไม่ได้
              แต่ว่าฉันก็จะไม่ลืมสิ่งที่เกิดขึ้นแล้วก็เรื่องในวันนี้ด้วย "
              show elnyb smile
              e " ขอบคุณมากนะลานี่ที่คอยอยู่กับฉันมาตลอด
              ถึงแม้ว่าฉันจะไม่เคยเป็นพี่ที่ดีได้เลย "
              e " แล้วก็เบ็ก... "

              scene end
              with dissolve
              e " ขอบคุณนะ ที่ยังเชื่อในตัวฉัน "
              e " ไม่ว่าอะไรจะเกิดขึ้น ฉันสัญญาว่าหลังจากนี้ฉันจะไม่หนีอีกแล้ว "
              e " จะเผชิญหน้ากับทุกๆ อย่าง อย่างตรงไปตรงมา "
              e " พร้อมๆ กับพวกนาย "

              stop music fadeout 1 

              $ persistent.end = True

              scene #the ending, three of them hug and smile
              return

              




        #เบ็คตัดสินใจที่จะลืมเรื่องพ่อไปก่อน ก็คือยังโกธรอยู่ แล้วไปคิดเรื่องสองพี่น้องแทน พอหลังจากจับต้นชนปลายได้ก็เลยรีบไปหาทั้งสองคน
        #ทั้งสองคนยังอยู่ที่หาด และเอลนี่ก็กำลังทำร้ายลานี่ ก็คือเบ็กจะไดเห็นว่าที่ลานีี่บอกว่าเอลนี่เริ่มไม่เป็นตัวของตัวเองนี่มันเป็นยังไง
        #แล้วพอเอลนี่เห็นเบ็กก็พุ่งเข้าไปคว้าคอทันที แล้วก็พยายามขู่เบ็กให้กลัว
        #แต่เบ็กก็ไม่ยอมแพ้ แล้วก็พยายามเถียงเอลนี่ ทั้งคู่ทะเลาะกันไปมาก่อนที่เบ็กจะบอกเอลนี่ว่าตัวเองรู้ความจริงทุกเรื่องแล้ว แล้วก็ไม่โกธร
        #เอลนี่ก็เลยยอมใจเย็นลงแล้วยอมให้เบ็กปลอบตัวเอง
        #ลานี่ก็ปรับความเข้าใจกับพี่ชาย และเอลนี่ก็สัญญาว่าจะไม่เก็บทุกอย่างไว้กับตัวเองแบบนี้อีก
      