define config.end_game_transition = fade
define f = Character("คุณพ่อ", color="#000000")
define b = Character("เบ็ก", color="#000000")
define e = Character("เอลนี่", color="#a54848")
define l = Character("ลานี่", color="#30a8b8")
define el = Character("ลานี่ & เอลนี่", color="#9a26a5")
define c = Character("คนขับรถ", color="#000000")
define j = Character("ผู้ประกาศข่าว", color="#000000")
define d = Character("ดิเอโก้", color="#000000")
define a = Character("เบลนด้า", color="#1d1a4b")
define r = Character("ร้อดดิโก้", color="#331a1a")
define w = Character("???", color="#000000")
define m = Character("เสียงในใจ", color="#474747")
define p = Character("หมอ", color="#474747")
default persistent.end = False

label before_main_menu:
  play music "main.mp3" fadeout 1 loop
  return

transform grayed:
  matrixcolor SaturationMatrix(0) * BrightnessMatrix(-0.25)

transform reset_color:
  matrixcolor SaturationMatrix(1) * BrightnessMatrix(0)

transform left:
  xcenter 0.25

transform right:
  xcenter 0.75

transform center:
  xcenter 0.5

label start:
  scene intro
  play music "soft.mp3" fadeout 1 loop
 
  j " สวัสดีครับทุกท่านและนี่คือรายการที่จะคอยแจ้งข่าว
  เกี่ยวกับฝนฟ้าอากาศให้คุณทราบอย่างสม่ำเสมอ!"
  j " วันนี้ผมมาอยู่กับผมจอร์ชเช่นเคยนะครับ "
  
  scene intro2
  j " ในวันนี้มีรายงานด่วนจากทีมงานที่พึ่งลงพื้นที่ไปเมื่อหลายวันก่อน
  พบว่าสภาพอากาศบริเวณชายฝั่งไม่ค่อยสู้ดีนัก "
  j " เพราะปรากฏการณ์เอลนีโญทำให้ระดับน้ำรอบชายฝั่งกำลังสูงขึ้นอย่างต่อเนื่อง 
  และคาดว่าจะเพิ่มขึ้นเรื่อยๆ ไปจนถึงสิ้นปีอาจส่งผลให้บ้านเรือนและทรัพย์สินเสียหายได้ "
  j " แนะนำให้ผู้อาศัยทุกท่านรีบอพยพโดยด่วน เพื่อความปลอดภัยของทุกคนนะครับ "

  scene introb
  show son with dissolve
  " เสียงวิทยุทำให้ทุกอย่างหยุดลง คุณมองพ่อของคุณที่อยู่ๆ ก็ยืนนิ่งอยู่กับที่ไป "
  " พ่อของคุณมองไปที่ทะเลด้วยแววตาเศร้าๆ "
  f " เราเองก็คงจะทำงานนี้ต่อไปได้อีกไม่นานแล้วสินะ
  ถ้าสถานการณ์ยังแย่แบบนี้ต่อไปคงต้องติดต่อดิเอโก้เร็วกว่าที่คิด "

  scene 2father
  with dissolve
  scene 3father with dissolve
  scene 2father 
  with dissolve
  " คุณได้ยินเสียงถอนหายใจ น้ำเสียงของคุณพ่อดูเหนื่อยๆ เล็กน้อย 
  แต่ก็เปลี่ยนกลับเป็นรอยยิ้มทันที เหมือนกับว่าเมื่อกี้ไม่มีอะไรเกิดขึ้น "
  f " ทำไมลูกไม่ไปเล่นสักหน่อยล่ะเบ็ก พวกเพื่อนๆ กำลังรออยู่ไม่ใช่เหรอ "

  scene who
  with dissolve
  " คำพูดของคุณพ่อทำให้ถึงเพื่อนทั้งสองคนที่คุณได้เป็นเพื่อนกันที่ชายหาด "

  scene run 
  with dissolve
  " คุณวางงานทุกอย่างเอาไว้ โดยที่ไม่ลืมบอกลาพ่อของคุณ
  แล้ววิ่งไปที่เดิมที่ที่คุณชอบไปเล่นกับเพือนๆ "

  scene who
  with dissolve
  " คุณวิ่งผ่านชายหาดผ่านเรือประมงมากมายจนรู้สึกว่าขาของคุณเริ่มหมดแรง "
  " สุดท้ายคุณก็สะดุดขาตัวเอง แทนที่จะล้มลงหน้าคมำ คุณดันไม่รู้สึกเจ็บ "
  " เพราะมีมือคู่นึงมาคว้าคุณเอาไว้ได้ทัน มือคู่นั้นเป็นของ... "

 
  menu:

        "คนซ้าย":
            jump Elny

        "คนขวา":
            jump Lany

  label Elny:

        scene beachdayblur
        show  fall down1 with dissolve
        " คนที่จับมือคุณไว้ก็คือ เอลนี่ คุณได้ยินคนตรงหน้าบ่นกับตัวเองเบาๆ
        ถึงความซุ่มซ่ามของคุณ "
        e " เธอนี่ซุ่มซ่ามจริงๆ "

        show fall down2

        " แม้คำพูดจะดูใจร้ายไปหน่อยแต่จริงๆ แล้วเอลนี่ก็เป็นคนที่ใจดีมากไม่ต่างจากผู้เป็นน้องสาว "
        " เสียอย่างเพียงอย่างเดียวก็คือการที่เจ้าตัวใช้คำพูดไม่เก่งกับปากเสียไปหน่อย "

        e " จะให้จับอีกนานมั้ยเนี่ย เห็นมั้ยว่ามันเมื่อย "

        e " ......... "
        
        show  fall down3

        e " ดูจากสีหน้าแล้วน่าจะยังสบายดีนี่ งั้นก็เลิกเหม่อแล้วรีบลุกขึ้นมาได้ละ "

        jump continue

  label Lany:

        scene beachday
        show lfall down1 with dissolve

        " เมื่อคุณลืมตาขึ้นมาและพบว่าตัวเองไม่ได้ล้มไปกับพื้นเพราะ 'ลานี่' จับมือคุณเอาไว้ได้ทัน
        ลานี่เองก็พยายามสังเกตไปด้วยว่าคุณบาดเจ็บตรงไหนรึเปล่า "

        l " เป็นอะไรรึเปล่าคะ เจ็บตรงไหนรึเปล่า ลุกขึ้นไหวมั้ย "
        l " .......คือว่า "

        " ใบหน้าของพวกคุณไม่ได้ห่างกันมากนัก คุณเลยเผลอเหม่อมองด้วยความลืมตัว "
        " เอลนี่ยังขี้กังวลเหมือนเดิมไม่เปลี่ยน นิสัยแบบนี้ลานี่ก็มีมาตั้งแต่แรกที่ได้เจอกันแล้ว "
        show lfall down2

        l " ..... "

        " คุณรีบลุกขึ้นทันที เมื่อรู้ตัวว่าเผลอจ้องหน้าเธอนานเกินไป "

        show lfall down3
        l " อ๊า ลุกขึ้นได้แล้วสินะคะ ดีแล้วละค่ะ "

        jump continue

  label continue:

        scene who1
        with dissolve

        " หลังจากคุณลุกยืนขึ้น คุณก็เห็นลานี่กับเอลนี่ยืนอยู่ตรงนั้น "
        " คุณพูดขอบคุณหลังจากที่โดนช่วยเอาไว้ "

        scene beachdayblur
        show elny angry at left
        show lany at right, grayed
        e " วันหลังจะไปไหนก็หัดดูทางหน่อยสิ "

        show elny sigh at grayed
        show lany smile at reset_color
        l " ต้องระวังไม่ให้บาดเจ็บ ไม่งั้นเดี๋ยวจะเป็นแผลเป็นเอาได้นะ "

        show elny angry at reset_color
        show lany sigh at grayed
        e " ก็ตามที่ลานี่บอก ถ้าเป็นอะไรไปจะทำยังไงหะ
        จำไม่ได้รึไงว่าครั้งล่าสุดที่เธอล้มน่ะเธอร้องไห้หนักแค่ไหน??" #elny angry and lany sigh at grayed
        b " อะไรเล่า! เมื่อกี้ก็ไม่ได้ล้มสักหน่อยนี่เอลนี่ขี้บ่น " #elnny angry and lany sigh, both at grayed

        show elny angry at reset_color
        e " นี่! " #elny angry at reset_color
        b " แบร่!! "

        show elny sigh 
        e " เฮ้อ เพราะงี้ไงถึงได้ไม่ชอบพวกเด็กๆ " #elny sigh

        show elny sigh2 at grayed
        show lany sigh at reset_color
        l " เอลนี่ อย่าพูดแบบนั้นกับเด็กๆ สิ " #elny sigh2 at grayed and lany sigh at reset_color

        show lany smile
        l " เอาเป็นว่าไม่เจ็บตัวก็ดีแล้วล่ะ เพราะงั้นใจเย็นก่อนนะทั้งสองคน " #elny sigh2 at grayed and lany smile

        show elny sigh2 at reset_color
        show lany smile at grayed
        e " ..... " #elny sigh2 at reset_color and lany smile at grayed

        show elny
        e " เพราะลานี่หรอกนะ ฉันถึงใจเย็นลงน่ะ " #elny and lany smile

        show elny at grayed
        show lany smile at reset_color
        l " แล้วทำไมวันนี้ถึงรีบมาขนาดนี้ละคะ ปกติเธอจะมาหาพวกเราช้ากว่านี้นี่นา " #elny at grayed and lany smile at reset_color

        show elny at reset_color
        show lany smile at grayed
        e " นั่นสิ ขอฉันฟังเหตุผลหน่อยเถอะว่าอะไรทำให้เธอต้องรีบวิ่งมาขนาดนี้ " #elny at reset_color and lany smile at grayed

        show elny at grayed
        " คุณมองทั้งสองคนก่อนจะเริ่มเล่าเหตุการณ์ที่เกิดขึ้นก่อนหน้านี้ " #elny at grayed and lany smile 


        scene beachdayblur
        #(only)elny sigh2 at center, reset_color 

        show elny sigh2 at center, reset_color 
        with dissolve
        e " ..... "
        e " เข้าใจล่ะ ว่าทำไมพ่อของเธอถึงอยากให้เธอรีบมาหาพวกเรา "
        e " เธอ- "
        
        show elny sigh3
        e " ต้องย้ายบ้านเร็วๆ นี้แล้วไงล่ะ " #(only)elny sigh3 

        show elny sigh2 
        b " ม- หมายความว่ายังไงน่ะ เอลนี่พูดอะไรน่ะ " #(only)elny sigh2 at grayed

        show elny sigh3 
        e " ก็เขาคงอยากให้เธออยู่กับพวกเราเยอะๆ
        จะได้สร้างความทรงจำดีๆ ก่อนจากกันไง " #(only)elny sigh3 at reset_color
        e " แต่จะให้พูดว่าทำไมไป เด็กอย่างเธอก็ไม่เข้าใจหรอก
        แต่ถ้าให้สรุปสั้นๆ ก็คือถ้าไม่ย้ายออกไป "
        e " ตัวเธอเองรวมถึงครอบครัวคงไม่รอดแน่ "

        show elny sigh4 
        b " ไม่เห็นจะเข้าใจเลย ทำไมฉันต้องย้ายออกไปด้วยล่ะ
        แล้วทั้งสองคนจะตามมาด้วยรึเปล่า " #(only)elny sigh3 at grayed

        show elny sigh3 
        e " ไม่ไป " #(only)elny sigh3 at reset_color
        
        show elny sigh 
        b " ทำไมล่ะ! " #(only)elny sigh at grayed

        show elny angry 
        e " เป็นเด็กแท้ๆ อย่าถามมากจะได้มั้ย
        ถ้าฉันพูดไปแล้วคิดว่าตัวเองจะเข้าใจรึไง " #(only)elny angry, reset_color

        scene beachdayblur 

        show elny angry at center
        b " ก็ต้องเข้าใจสิ เพราะพวกเราเป็นเพื่อนกันนี่นา! " #elny sigh3 at left and lany shock at right
      
        scene beachdayblur
        show elny sigh3 at left
        show lany sigh at right
        el " ......" #elny sigh2 and lany sigh at grayed

        show elny sigh3 
        show lany sigh at grayed
        e " เอาเป็นว่าพวกเราก็มีเหตุผลของพวกเราแหละน่า " #elny sigh3 and lany sigh at grayed

        show elny sigh2 at grayed
        show lany sigh at reset_color
        l " เพราะงั้นอยากให้เข้าใจแล้วก็ทำตามที่เอลนี่พูดเถอะนะคะ " #elny sigh3 at grayed and lany sigh at reset_color

        b " ขนาดลานี่ก็ยังเข้าข้างเอลนี่เหรอ... "

        scene beachdayblur

        show elny at center
        e " ที่นี้ก็เข้าใจแล้วใช่มั้ย งั้นขอแนะนำในฐานะเพื่อนหน่อยละกัน " #(only)elny at reset_color with dissolve
        e " ถ้าฉันเดาไม่ผิด อีกไม่นานน้ำจะสูงขึ้นและอีกไม่กี่วัน
        ที่นี่จะกลายเป็นทะเล "
        e " เพราะงั้นหลังจากวันนี้ก็เชื่อฟังที่พ่อของตัวเองพูด
        แล้วอย่ามาที่นี่อีก เข้าใจมั้ย "
        b " ไม่เห็นจะเข้าใจเลย " 

        show elny angry
        e " เห็นมั้ยล่ะ! เพราะงั้นตั้งแต่พรุ่งนี้เป็นต้นไปก็อยู่ที่บ้าน
        และอย่ามาที่ทะเลอีกเพราะมันอันตราย! " #(only)elny angry
        b " อะไรเนี่ย ทำไมต้องปิดบังกันด้วยเล่า! ทั้งสองคนไม่เห็นจะอธิบายอะไรเลย! 
        เอาแบบนั้นใช่มั้ย ก็ได้! จะไม่มาที่ชายหาดอีกแล้ว "
        b " เอลนี่ใจร้าย! เอลนี่ขี้งก! "
        
        show elny sigh2 
        " คุณวิ่งออกไปและไม่หันกลับมามองทั้งคู่อีก โดยที่ไม่รู้เลยว่าทั้งเอลนี่แล้วก็ลานี่
        ก็พากันทำหน้าเศร้าหลังจากที่คุณวิ่งหนีไปแล้ว " #(only)elny sigh2
        " หลังจากแผ่นหลังเด็กชายห่างไปไกล ลานี่ก็พูดขึ้น "

        l " จะดีเหรอเอลนี่ ที่ไม่อธิบายอะไรให้เด็กคนนั้นฟังน่ะ
        แล้วก็เกี่ยวกับตัวตนของพวกเรา "
        show elny sigh3
        e " ทำไมจะไม่ดีล่ะ ปล่อยให้ไม่รู้อะไรไปนั่นแหละดีแล้วล่ะ
        สำหรับเด็กขี้แยแบบนั้น " #(only)elny sigh3

        play music "dream.mp3" fadeout 1 loop
        scene bs
        with dissolve

        b " ลานี่ เอลนี่.."
        b " ขอโทษนะ... "
        " ....... "
        " ........... "

        scene bs
        with dissolve
        
        b " เหวอ!! "
        play sound "fall.mp3"
        with hpunch


        scene bedroomday
        play music "morning.mp3" fadeout 1 loop
        
        show wake 1 at center
        b " อูย เจ็บๆ นี่เรานอนดิ้นจนตกเตียงเลยเหรอ.. 
        เพราะจะได้กลับไปที่บ้านเก่ารึเปล่านะก็เลยฝันถึงสองคนนั้นอีก " #wake 1 at center 

        show wake 3
        b " นี่มันก็ผ่านมา20ปีได้แล้วสินะ หลังจากที่เรากับญาติย้ายมาตอนนั้น " #wake 3
        b " พ่อเองก็เสียไปตั้งแต่ตอนนั้นด้วย
        ทำไมตอนนั้นพ่อถึงไม่ย้ายบ้านมาพร้อมกับเรากันนะ " 

        show wake 4
        b " ไม่ว่าจะขอร้องแค่ไหน พ่อก็ไม่ยอมย้ายออกมากับเราสักที 
        อาชีพชาวประมงมันสำคัญนักรึไง ถึงกับต้องทิ้งเราไว้คนเดียวด้วย " #wake 4

        show wake 2
        b " เลิกคิดดีกว่า เดี๋ยวนะ..ตอนนี้มันกี่โมงแล้วเนี่ย " #wake 2
        b " ...... " 

        show wake 1
        b " หะ 11 โมง!! ต้องรีบไปแล้วก่อนที่จะไม่ทันรถ!! " #wake 1

        scene bs
        with dissolve

        scene cityday
        with dissolve
        play music "city.mp3" fadeout 1 loop

        show wait 1 at center
        b " คนเยอะชะมัด เวลานี้จะยังมีคนพาเราไปส่งได้มั้ยเนี่ย " #wait 1 at center
        b " ขอโทษด้วยนะครับ พอจะไปส่งผมแถวๆ ชายหาดได้รึเปล่าอะครับ "

        scene cityday

        show driver 3 at right
        show wait 1 at left, grayed
        c " ชายหาด? มีธุระอะไรถึงต้องไปที่นั่นล่ะ
        มันอันตรายนะช่วงนี้น่ะ " #driver 3 at right and wait 1 at left, grayed

        show driver at grayed
        show wait 2 at reset_color
        b " พอดีไม่ได้กลับไปนานแล้วเลยจะกลับไปเยี่ยมหลุมศพของพ่อหน่อยน่ะ " #driver 3 at grayed and wait 2 at reset_color

        show driver 2 at reset_color
        show wait 2 at grayed
        c " เหรอ อย่าบอกนะว่า พ่อของเธอก็เสียชีวิตในเหตุการณ์น้ำท่วมเรอะ " #driver 2 at reset_color and wait 2 at grayed

        show driver 2 at grayed
        show wait 2 at reset_color
        b " ครับ ท่านเสียไปได้20ปีได้แล้วล่ะครับ " #driver 2 at grayed and wait 2 at reset_color
        
        show driver 1 at reset_color
        show wait 3 at grayed
        c " เสียใจด้วยนะ ลุงเองก็เข้าใจ ลำบากมามากเลยน่ะสิท่า " #driver 1 at reset_color and wait 3 at grayed
        c " ได้ยินว่าน้ำท่วมที่เกิดจากเอลนีโญครั้งนั้นพรากทั้งชีวิต
        และที่อยู่ของคนหลายคนไปเลยนี่นะ "
        show driver 3 at grayed
        show wait 1 at reset_color
        b " เอลนีโญ?"
        show driver 3 at reset_color
        show wait 2 at grayed
        c " ใช่ สมัยก่อนตอนลุงเด็กๆ ก็มีเรื่องแบบนั้นเกิดขึ้นเหมือนกัน "
        show driver 3 at reset_color
        show wait 1 at grayed
        c " ลุงเองก็เสียทั้งบ้านแล้วก็พ่อกับแม่ไปในเหตุการณ์นั้นเหมือนกัน
        ไหนๆ แล้วงัันให้ลุงไปส่งมั้ยละ "
        c " ไม่คิดค่ารถหรอก ถือซะว่าเป็นคนเคยที่ลำบากมาเหมือนกันน่ะ "
        b " จริงเหรอครับ?! ขอบคุณมากๆ เลยนะครับลุง! "

        scene bus
        with dissolve
        play music "car.mp3" fadeout 1 loop

        " คุณเดินตามคุณลุงใจดีไปขึ้นรถบัสและเลือกที่นั่งใกล้กระจกที่สุด
        เพื่อจะได้มองวิวดีๆ ระหว่างทาง "
        " คุณนั่งลงและมองออกไปข้างนอก เพลิดเพลินไปกับวิว
        ที่ไม่ได้เห็นมานานตั้งแต่เด็ก "
        " ตอนนี้คุณอยู่บนรถคนเดียวเพราะเวลานี้ไม่ใช่เวลารถวิ่ง
        ทำให้ไม่มีใครนอกจากคุณใช้บริการ "

        scene bs
        with dissolve
        play music "dream.mp3" fadeout 1 loop

        " คุณหลับตาลง นึกถึงช่วงเวลาดีๆ ที่เคยมีในสมัยยังเป็นเด็ก "
        " แล้วใบหน้าลางๆ ก็พุดขึ้นมาในใจ "

        scene who2
        " สิ่งที่จำได้มีแค่ชื่อและหน้าตาลางๆ "
        " นอกจากธุระเยี่ยมหลุมศพของพ่อ คุณก็ยังหวังอีกว่า
        จะได้ไปพบกับเพื่่อนสมัยเด็กที่เคยเล่นด้วยกันบ่อยๆ อีกครั้ง "
        " เพราะคุณยังจำได้ดีว่าก่อนจากมาคุณพูดไม่ดีใส่ทั้งสองคนไป "

        b " ที่เอลนี่กับลานี่พูดแบบนั้นเพราะเป็นห่วงเราแท้ๆ "
        b " ทำไมเราต้องไปเถียงเขาแบบนั้นด้วยนะ "
        b " แย่ที่สุดเลย "

        scene bs
        with dissolve

        " คุณลืมตาขึ้นมาก็พบว่าคุณมาถึงชายหาดเป็นที่เรียบร้อย "
        " คุณรีบลงมาจากรถ ก่อนจะเจอแสงแดดยามบ่ายกระทบเข้ากับร่างกาย "

        c " เอ้า ถึงแล้วล่ะ! "

        scene arrival
        play music "soft.mp3" fadeout 1 loop

        c " ลุงไปก่อนนะเพราะอีกเดี๋ยวก็ต้องกลับไปทำงานแล้ว "
        c " มาเที่ยวทั้งทีแต่ก็ระวังๆ ด้วยล่ะ โชคดีนะไอ้หนุ่ม! "

        " ..... "

        scene beachday
        with fade

        " คุณก้าวลงไปเหยียบพื้นทรายในรอบหลายปี
        ทุกอย่างยังคงเหมือนเดิมและชายหาดที่นี่ก็ไม่เคยเปลี่ยนไปเลย "
        " คุณมองออกไปรอบๆ หวังจะเก็บบรรยากาศดีๆ
        เท่าที่ทำได้ จนคุณก็เหลือบไปเห็นใครบางคนเข้า "

        show lanyb dark at center
        " คนๆ นั้นแต่งกายสะดุดตา ทำให้คุณรู้สึกคุ้นเคยอย่างบอกไม่ถูก "
        " คุณตัดสินใจที่จะลองเข้าไปทักทายและแล้วคนที่คุ้นเคยดี
        ก็อยู่ตรงหน้าของคุณ "

        show lanyb 1 with dissolve
        b " ลานี่? "

        show lanyb 2 
        l " เอ๊ะ? "

        " เป็นเธอจริงๆ คุณไม่ได้ดูผิดจริงๆ ด้วย! "

        b " ลานี่! ใช่ลานี่จริงๆ ด้วยดีใจจังที่ได้เจอกันอีก
        ตอนนั้นก่อนที่จะย้ายออกไป ขอโทษจริงๆ นะที่พูดไม่ดีใส่น่ะ " 

        show lanyb 3
        l " ไม่เป็นไรหรอกจ้ะ ตอนนั้นเธอก็ยังเด็กด้วยนี่นา
        พวกเราไม่โกธรหรอกนะที่เธอจะทำตัวแบบนั้นน่ะ "
        b " ช่วงนี้เป็นยังไงบ้างเหรอ ว่าแต่ลานี่
        ทำไมเธอดูแทบไม่เปลี่ยนไปเลยล่ะ ฉันรู้สึกว่าเธอไม่ได้สูงขึ้นเลยนะ "
        b " แล้วก็ทำไมเะอถึงดูเศร้าๆ ละ นี่ฉันคิดไปเองรึเปล่า? "

        show lanyb cry2
        l " ไม่มีอะไรหรอก ก็แค่ฉันดีใจที่ได้เจอเธอน่ะแล้วก็
        จริงๆ แล้วที่ร่างกายฉันไม่ได้เปลี่ยนไปเลยมันมีเหตุผลอยู่ล่ะ "
        l " รู้อยู่แล้วว่าสุดท้ายยังไงก็ต้องได้พูดเรื่องนี้สักวัน "
        b " พูดเรื่องอะไรน่ะลานี่ "
        l " ฉันกับพี่ชายฉันไม่ได้ตั้งใจจะปิดบังเธอเลยนะเบ็ก
        จริงๆ แล้วพวกเราไม่ได้เป็นมนุษย์หรอกนะ "

        show lanyb 3
        l " ความจริงก็คือ พวกเราน่ะเป็นปรากฏการณ์ทางสมุทรศาสตร์
        ที่จำแลงกายมาต่างหากล่ะ "
        
        " คุณมองหน้าลานี่เหมือนว่าเธอเป็นบ้าไปแล้ว
        ซึ่งหญิงสาวก็ไม่ได้โกธรอะไร "
        " เพราะนั่นก็ควรจะเป็นรีแอคชั่นปกติที่มนุษย์ควรจะมี
        ให้สิ่งเหนือธรรมชาติอย่างพวกเธอจริงๆ นั่นแหละ "
        b " ลานี่ตลกจังพูดอะไรกันเนี่ย- "
        l " ฉันขอโทษนะที่จู่ๆ ก็พูดอะไรแปลกๆ แต่ที่ฉันพูดไม่ใช่เรื่องโกหกหรอกนะ
        ฉันจะแสดงให้เธอดูเองว่าฉันไม่ใช่มนุษย์ "

        scene dance
        with dissolve
        " ทันทีที่ลานี่พูดจบ หญิงสาวเดินตรงไปที่ทะเลจนน้ำทะเลสูงถึงหัวเข่า
        ก่อนจะตวัดมือของตัวเองขึ้น " 
        " และเริ่มเต้นรำไปพร้อมกับสายน้ำราวกับเธอเป็นหนึ่งเดียวกับมัน "
        
        b " เธอ...ควบคุมน้ำได้?? "

        scene beachday
        with dissolve
        show lanyb 1 
        " แม้จะรู้สึกกลัวแต่คุณก็กลั้นใจถามเธอ "

        l " อื้ม ในตอนที่พวกเราเกิดมา รู้สึกตัวอีกทีก็ทำแบบนี้ได้แล้วล่ะ "
        l " พวกเราก็ไม่รู้ด้วยซ้ำว่าทำไมพวกเราถึงต้องเกิดมา สิ่งเดียวที่พวกเรารู้
        ก็คือพวกเราคืออะไรแล้วก็ทำอะไรได้เท่านั้นเอง " #ซูมไปที่ลานี่ที่กำลังเล่นกับน้ำที่เป็นรูปร่างปลาบนมือ

        " ถึงคุณจะไม่อยากเชื่อแต่จะให้ทำยังไงได้อีก
        ในเมื่อความจริงมาประเคนตรงหน้าแบบนี้ " #ตัดกลับมาที่เบ็กที่เหงื่อตก #เบ็ก at righht with lany at left
        b " ฉันงงไปหมดแล้วลานี่ คือนี่มันอย่างกับอยู่ในหนังรึการ์ตูนเลย "
        b " ไม่ได้ล้อเล่นจริงๆ ด้วยสินะ "

        show lanyb 3 with dissolve
        l " ถ้าเธออยากลองจับ จะลงมาในน้ำก็ได้นะ "
        b " ม- ไม่เป็นไร ขอบใจนะ "

        " คุณปฎิเสธเธอไปตรงๆ ก่อนจะสังเกตได้ว่าเอลนี่ไม่ได้อยู่ด้วย "
        b " จะว่าไปตอนนี้เอลนี่เป็นยังไงบ้างเหรอลานี่ "
        show lanyb t
        l " ....... "
        " สีหน้าของลานี่ซีดลง เธอจับมือของคุณ
        ให้มานั่งที่โคดหินใกล้ๆ ก่อนจะเริ่มพูดอีกครั้ง "
        
        l " เอลนี่เขาแยกตัวไปอยู่คนเดียวแล้วน่ะ
        ตั้งแต่เมื่อปีก่อนที่เหตุการณ์ เอลนีโญ เกิดขึ้นที่นี่ "
        b " เอลนีโญ? "
        l " จริงสิ ฉันลืมบอกชื่อเต็มของพวกเราไปเลย "

        show lanyb 2
        l " ชื่อเต็มของฉันคือลานีญา และพี่ชายของฉันเอลนี่ก็คือเอลนีโญ
        พวกเราก็คือปรากฏการณ์ทางสมุทรศาสตร์ที่กำลังเกิดขึ้นในประเทศนี้ยังไงล่ะ "
        show lanyb 1
        b " ได้ยังไงล่ะลานี่ แล้วลานี่ที่ฉันเห็นตรงหน้าคืออะไรกันล่ะ "
        l " ฉันก็ไม่รู้เหมือนกัน พวกเราที่่เธอเคยเห็นและสัมผัส
        คือปรากฏการณ์ทางสมุทรศาสตร์จริงๆ "
        l " พวกเราถูกค้นพบโดยชาวเปรูในศตวรรษที่17 ว่าพวกเรา
        คือสาเหตุของการเปลี่ยนแปลงอย่างผิดปกติในทะเล "
        l " ตั้งแต่ตอนนั้นมาพวกเราก็มีร่างกายและจิตสำนึกขึ้นแล้วล่ะ "
        show lanyb 3
        l " ไม่รู้ว่าทำไม แต่คงพระเจ้าคงสาปเราละมั้ง "

        show lanyb 2
        l " แต่ร่างกายนี้เป็นอมตะ ไม่รู้สึกหิวและไม่มีวันแก่
        อีกอย่างคือพวกเราก็ออกห่างจากทะเลไม่ได้ด้วย "
        l " คิดว่าน่าจะเกี่ยวพันธ์กับเรื่องที่พวกเราเกิดมาจากทะเลด้วยละมั้งนะ "
        b " งั้นแสดงว่าที่พวกเธอไม่ย้ายบ้านไปกับฉันตอนนั้นก็เป็นเพราะ- "

        show lanyb 1
        l " ใช่แล้วล่ะ พวกเราไปไม่ได้น่ะ ไม่ว่าจะพยายามแค่ไหน  "
        b " ลานี่... "
        show lanyb cry3
        l " อย่าทำหน้าเศร้าเลย เธอไม่ผิดหรอกนะ
        ตอนนั้นพวกเราเลือกที่จะไม่อธิบายเกี่ยวกับตัวของพวกเราเองนี่นา "
        l " พวกฉันเป็นปรากฏการณ์ที่ไม่มีที่มาแถมยัง
        สร้างปัญหาไว้ตั้งมากมายขนาดนี้อีก "
        l " เป็นตัวตนที่ไร้ประโยชน์และไม่เป็นที่ต้องการก็ไม่แปลกใจหรอก
        เพราะงั้นตอนนั้นเอลถึงเลือกที่จะเก็บไว้เป็นความลับจากเธอยังไงล่ะ "
        show lanyb cry4
        b " แต่ว่าพวกเธอก็ไม่ได้อยากทำร้ายใครสักหน่อยนี่ "
        show lanyb cry5
        l " ..... "
        b " ถึงพวกเธอจะไม่ใช่มนุษย์ แต่ตอนนี้เธอก็มีร่างกายแล้วก็
        มีความรู้สึกนึกคิดเป็นของตัวเองนะ "
        b " ถ้าเลือกได้พวกเธอก็ไม่อยากเกิดมาเป็นแบบนี้
        แล้วก็ใช้ชีวิตเหมือนคนทั่วไปใช่มั้ยล่ะ?! เพราะงั้น- "
        b " อย่าพูดเหมือนกับว่าตัวเองไม่ควรเกิดมาจะได้มั้ยเล่า "

        #maybe elny sudenly appear cuz he sense beck has come back from far away. then they begin to argue while lany try to protect beck from her brother. elny just live at the beach but far away from his sister.
        
        show lanyb cry3
        l " ขอบคุณนะที่พูดแบบนั้นน่ะ ขอบคุณมากจริงๆ ที่พยายามเข้าใจพวกเรานะ
        แต่ฉันก็ไม่อยากให้เธอต้องมายุ่งเกี่ยวกับพวกเราไปมากกว่านี้แล้วล่ะ "

        b " หมายความว่ายังไงน่ะลานี่ "
        show lanyb cry2
        l " ฉันคิดมาสักพักแล้วล่ะตั้งแต่ที่เธอจากไป ตั้งแต่ที่เอลนี่เปลี่ยนไป
        รู้รึเปล่าว่าตอนนี้เขาเป็นยังไงบ้าง "
        b " หมายความว่ายังไงน่ะลานี่ เกิดอะไรขึ้นกับพวกเธอกันแน่? "
        l " ฉันจะอธิบายให้เธอฟังเองนะ ถึงต้นกำเนิดและความน่ากลัวของพวกเรา
        เอลนีโญและลานีญาต่อมนุษย์และโลกใบนี้ "

        #flashback come in
        #So many fuckin cutscene
        l " เธอรู้อยู่แล้วใช่มั้ย ว่าโลกนี้มีสิ่งที่เรียกว่าวัฏจักรน้ำอยู่
        สิ่งนี้มีสำคัญและเกี่ยวพันธ์ไปถึงสภาพอากาศอย่างมาก "
        l " วัฏจักรน้ำมักจะเกิดขึ้นในทุกพื้นที่ที่มีแหล่งน้ำและจะเกิดขึ้นอย่างมาก
        ในพื้นที่ที่ใกล้กับเส้นศูนย์สูตร ซึ่งหนึ่งในนั้นก็คือเปรูหรือที่ที่เรากำลังยืนอยู่นี่แหละ "
        l " เพราะในบริเวณประเทศเปรูหรือทวีปอเมริกาใต้ "
        l " ทำให้แทนที่จะมี4ฤดูตามปกติเหมือนประเทศอื่น เปรูจึงมีแค่ฤดูร้อนและฤดูฝน "
        l " และอย่างที่ฉันพูดไปก่อนหน้านี้ เมื่อราวๆ ศตวรรษที่17เป็นตอนที่เอลนี่ถูกชาวประมงจากเปรูค้นพบโดยบังเอิญ "

        scene ex1
        with dissolve
        l " เขาสังเกตได้ว่าจำนวนของปลาในน้ำลดน้อยลงจนผิดปกติ "

        scene rainning
        with dissolve
        l " แถมยังพบว่าช่วงท้ายปีที่ควรจะหนาวจู่ๆ ก็ฝนตกและอากาศก็เริ่มแปรปรวนหนักขึ้นจนผิดปกติ "

        l " คนในยุคนั้นก็เลยสัญนิษฐานกันว่าเป็นปรากฏการณ์เหนือธรรมชาติในวันที่พระเยซูประสูติน่ะ
        ถัดมานักวิทยาศาสตร์ก็พบว่าพวกเราไม่ใช่ปรากฏการณ์เหนือธรรมชาติ "
        l " แต่เกิดจากการแปรปรวนของสภาพอากาศที่เกี่ยวข้องกับทะเล
        จนกลายเป็นปรากฏการณ์ทางสมุทรศาสตร์ต่างหาก "
        l " และพวกเขาก็ตั้งชื่อปรากฏการณ์นั้นว่า เอลนีโญ ที่แปลว่าเด็กชายในภาษาสเปน "
        l " ไม่นานหลังจากนั้น เอลนี่ก็มีร่างกายและจิตใจขึ้นมา "

        scene beachday
        with dissolve
        show lanyb 1 with dissolve
        l " หลังจากนั้นผ่านมาจนศตวรรษที่20 ช่วงนั้นเป็นช่วงที่ฉันก็เกิดมา ทำให้
        สภาพการเป็นอยู่ของชาวไร่ชาวสวนตอนนั้นแย่ลงมากๆ เลยล่ะ "

        scene dirt
        with dissolve
        l " เปรูไม่มีฝนตกเลยจนพื้นดินแห้งแล้งและอากาศเริ่มเย็นลง ทำให้ฉันรู้ตัวได้ในทันที
        ว่าฉันคือปรากฏการณ์ตรงกับข้ามกับพี่ชายของฉัน "

        scene dirt2
        with dissolve
        l " และฉันก็ถูกตั้งชื่อว่า ลานีญา ที่แปลว่าเด็กสาวในสเปนตามพี่ชาย
        และจากนั้นก็เริ่มมีรี่างกายและจิตใจขึ้นมาเหมือนกัน "

        scene beachday #change to lany and elny live happily 2gether
        with dissolve
        show lanyb 3 with dissolve
        l " ในตอนที่ฉันรู้สึกตัวฉันแทบไม่รู้อะไรเกี่ยวกับตัวเองเลย ก็ได้เอลนี่นี่แหละช่วยเอาไว้
        เขาเป็นคนอธิบายเรื่องวราวต่างๆ ให้ฉันฟังแล้วก็พามาอยู่ด้วยกัน "
        l " พวกเราสองคนใช้ชีวิตอยู่ด้วยกันและคอยดูแลชายหาดมาเป็นปีๆ 
        ได้เจอผู้คนมากมาย รวมถึงเธอด้วยนะ "

        b " แล้วเธอมีพลังเหนือมนุษย์อะไรนอกจากควบคุมน้ำรึเปล่าน่ะลานี่ "
        scene beachday
        with dissolve
        show dlany with dissolve
        l " ไม่เลย จริงๆ แล้วถึงจะพูดว่ารู้ว่าทำอะไรได้ แต่ก็คุมสภาพอากาศจริงๆ ไม่ได้หรอก "
        l " ปกติแล้วหลักการการทำงานของปรากฏการณ์ทางสมุทรศาสตร์เอลนีโญ ลานีญา 
        ก็คือพวกเราจะพลัดกันทำหน้าที่น่ะ และส่วนใหญ่ที่นี่จะมีเอลนีโญเกิดขึ้นบ่อยมากกว่า "
        l " ส่วนฉันก็จะปรากฏขึ้นมาในช่วงเวลาที่ลมการค้าพัดรุนแรงขึ้น
        จนลมร้อนพัดไปทางทวีปเอเชียได้ "

        l " ส่วนเอลนีโญจะเกิดขึ้นก็ต่อเมื่อลมการค้าไม่สามารถพัดน้ำอุ่นจากเปรูไปแถบเอเชียได้ "
        l " จนทำให้น้ำอุ่นก็ค้างอยู่แถวชายฝั่งเปรู ทำให้อากาศที่นี่อุ่นขึ้น "
        l " พอน้ำแถวชายฝั่งมีอุณหภูมิสูงขึ้น ก็จะเกิดการระเหยขึ้นไปยังชั้นบรรยากาศ 
        จนทำให้ฝนตกมากกว่าเดิมจนทำให้หลายพื้นที่เกิดน้ำท่วมขัง "
        l " แล้วพอน้ำอุ่นขึ้น แพลงตอนที่โตในน้ำเย็นและเป็นอาหารของพวกปลา
        ไม่สามารถอยู่ได้จำนวนปลาก็ลดน้องลง "
        l " ชาวประมงก็จะได้รับผลกระทบในช่วงนี้ค่อนข้างมาก "

        scene beachday
        with dissolve
        show dlany with dissolve
        l " มากถึงขั้นว่าปีนึงรายได้ในการส่งออกปลานอกประเทศของเปรู
        หายไปหลายล้านเลยล่ะ "

        b " แล้วลานี่ล่ะ "
        show lanyb what
        l " ฉันเหรอ? "

        show lanyb smile
        l " ปรากฏการณ์ลานีญาก็คล้ายๆ กับเอลนีโญนีแหละ ต่างกันนิดเดียวคือลมการค้าจะรุนแรงขึ้น 
        จนพัดน้ำอุ่นไปทวีปเอเชียได้ ทำให้ผิวน้ำของเปรูถูกแทนด้วยน้ำเย็นที่ขึ้นมาจากใต้ผิวน้ำอย่างรวดเร็ว "

        #underwater scene | camera from underwater, see many fish
        l " กลับกันปลาจะยิ่งเพิ่มจำนวนมากขึ้นเพราะแพลงตอนมีจำนวนมากขึ้นด้วยเหมือนกัน "
        l " อุตสหกรรมส่งออกปลาก็เลยจะทำรายได้มากขึ้นเป็นพิเศษในช่วงนี้น่ะ "

        #factory releash rot water and gas | draw side by side
        l " ในขณะนั้นเองที่โลกก็เริ่มเปลี่ยนแปลงไป เริ่มมีมลพิษจากโรงงานอุตสหกรรม
        ปล่อยแก๊สและของเสียทั่วดาวเคราะห์ "
        l " ร่างกายของพวกเราปรากฏการณ์ทางสมุทรศาสาสตร์เอลนีโญ ลานีญา
        ก็ได้รับผลกระทบไปด้วย "

        #lany and elny sick
        l " ในเวลานั้นเอลนี่แล้วก็ฉันเองก็ได้รับผลกระทบจากมลพิษก็เริ่มมีอาการแปลกๆ
        คล้ายกับคนเป็นไข้ไม่สบาย นอกนั้นก็ไม่ได้แสดงอาการผิดปกติอะไรทางร่ายกายเลยนะ "
        l " ทำให้บางทีสภาพอากาศก็แปรปรวนบ่อยมากขึ้น แต่ไม่เคยมีครั้งไหนเลย
        ที่หนักจนสร้างความเดือดร้อนให้ชาวบ้านแถวๆ ชายหาด "

        #flood and destroy all the house | i can draw after the flood too
        l " แต่หลังจากที่พ่อของเธอเสียไปในเหตุการณ์เอลนีโญ จู่ๆ เอลนี่เขาก็มีอาการแปลกไป"
        l " ในตอนนั้นเองปรากฏการณ์เอลนีโญก็เริ่มแปรปรวนรุนแรงมากขึ้น ฝนเริ่มตกหนัก
        จนถึงขั้นมีพายุแรงจนบ้านของทุกคนใกล้ๆ ชายหาดเสียหายไปหลายหลัง "

        #elny condition getting worse
        l " เอลนี่เองก็อาการของเอลนี่ก็แย่ลง บางครั้งก็ชอบเหม่อลอย ไม่ก็อารมณ์เสียง่ายกว่าปกติบ้างล่ะ "
        l " หรืออย่างแย่ที่สุดคือเขาแยกไม่ออกว่าฉันเป็นใคร แล้วก็พยายามจะทำร้ายฉัน
        ถึงจะรู้สึกเสียใจแต่ฉันก็เข้าใจว่าตอนนี้เอลนี่ไม่เป็นตัวของตัวเอง "
        l " เพราะปรากฏการณ์เอลนีโญได้รับผลกระทบ ร่างกายของเอลนี่ก็เลยได้รับผลกระทบไปด้วย"

        scene beachday
        with dissolve
        show lanyb what2 with dissolve
        l " แต่ในสถานการณ์นี้การที่เอลนี่มีอาการทางจิตนี่ค่่อนข้างแปลกมากเลยนะ
        เรื่องที่แปลกมากเลยนะ สำหรับพวกเราที่ไม่ใช่มนุษย์ที่จะมีอาการทางจิตแสดงออกมาได้แบบนี้ "

        scene argue
        with dissolve  
        l " แล้วตอนที่เอลนีเขาได้สติขึ้นมาอีกที ตอนนั้นเขาก็พยายามไล่ฉันออกไปห่างๆ
        เพราะเขากลัวว่าตัวเองจะทำร้ายฉันขึ้นมาอีก "
        l " ฉันเองก็พยายามคุยกับเขาแล้วว่า ฉันเป็นอมตะไม่มีทางเป็นอะไรไปอยู่แล้ว 
        แต่เขาก็เลือกที่จะแยกตัวไปอยู่คนเดียวอยู่ดี "

        scene beachday
        with dissolve
        show lanyb t with dissolve
        l " เป็นคนที่หัวรั้นมากเลยนะ คนๆ นั้น "
        " เมื่อนึกถึงนิสัยปากไม่ตรงกับใจแถมยังหัวดื้อของเอลนี่ ลานี่ถอนหายใจ "

        show lanyb 1
        l " ในเมื่อเธอรู้เรื่องทั้งหมดแล้ว ก็ถึงเวลาที่เธอต้องกลับไปแล้วล่ะ
        ฉันน่ะว่าไปอย่างแต่เธอน่ะเป็นแค่มนุษย์นะ "
        l " ฉันจะไม่ยอมให้เธอได้ไปเจอเอลนี่ในสภาพนั้นหรอก
        รีบกลับไปแล้วก็อย่าได้กลับมาที่นี่อีก ลืมเรื่องพวกเราไปซะ "   
        b " จะให้ฉันแบบนั้นยังไงละ พอรู้ว่าตอนนี้พวกเธอกำลังมีปัญหาน่ะ?? "

        show lanyb w
        l " มันไม่สำคัญอีกแล้ว ตอนนี้เธอต้องรีบกลับไปนะ เดี๋ยวนี้เลย "

        " สีหน้าอีกฝ่ายดูซีเรียสขึ้นอย่างเห็นได้ชัด คุณสัมผัสได้ว่าจู่ๆ
        ลานี่ก็ดูร้อนรนขึ้นมามาก คุณพยายามจะอธิบายให้เธอฟัง "

        show lanyb shock
        stop music fadeout 1
        " แต่แล้วก็มีเสียงเด็กหนุ่มดังขึ้นจากด้านหลังเด็กสาว
        มันเป็นเสียงที่คุณยังจำได้ดี "

        " ราวกับว่าคุณพึ่งได้ยินเมื่อวาน "

        e " ก็ว่าได้ยินเสียงคุ้นๆ ที่แท้ก็เป็นนายนี่เอง "
        b " เอลนี่!! นั่นนายใช่มั้ยฉันมีเรื่องจะ- "

        scene argue2
        with dissolve
        " ทันทีที่คุณจะพยายามเดินไปหาเอลนี่ เด็กสาวก็เดินมาขวางคุณไว้
        และหันไปหาพี่ชาย "

        play music "intense.mp3" fadeout 1 
        " เอลนี่โผล่มาในสภาพที่ดูโทรมมากๆ แววตาดูหมองลง 
        ขอบตาก็ดำคล้ำ ผมกระเซอะกระเซิงดูเหมือนกับไม่ใช่เอลนี่ที่คุณรู้จัก "
        l " หยุดนะเอลนี่ พี่จะทำร้ายเขาไม่ได้นะ!! เขาก็แค่อยากจะช่วยพี่เท่านั้นเอง ?!"
        e " ฉันไม่ต้องการให้ใครช่วยทั้งนั้น ถอยไปซะลานี่ "

        scene scary
        with dissolve
        e " หยุดปกป้องเด็กนั่นแล้วส่งมันมาให้ฉันซะ "
        " เอลนี่ไม่สนใจคำท้วง ทั้งยังจ้องมาที่คุณเขม็ง
        คล้ายกับว่ากำลังคิดแค้นอะไรบางอย่าง "
        " คุณเริ่มทำอะไรไม่ถูก รู้สึกเหมือนว่าอยากจะออกไปจากตรงนี้ให้เร็วที่สุด "
        " ถึงรูปร่างหน้าตาจะคล้ายกันแต่เอลนี่ตอนนี้ดูน่ากลัวมากๆ
        จนคุณไม่กล้าที่จะเดินเข้าไปคุยด้วยเลย "

        scene bs
        with dissolve
        with hpunch
        " ลานี่หน้าซีดตอนที่เอลนี่เดินใกล้เข้ามาอีกก้าว เธอรีบหันกลับมาหาคุณ
        ก่อนจะรีบพลักคุณออกไปให้ไกลที่สุดด้วยพลังของเธอ "

        l " ขอโทษด้วยนะ "
        " คุณถูกลานี่พลักเข้าอย่างจัง จนคุณล้มไปไกล
        พอลืมตาขึ้นมาอีกทีทั้งสองคนก็ได้หายไปจากตรงนั้นแล้ว "
        " คุณทนอยู่ที่นี่ต่อไปไม่ได้และด้วยความกลัว
        เลยรีบเรียกรถกลับบ้านทันที "

        scene bedroomday
        with fade
        play music "morning.mp3" fadeout 1 

        " ตั้งแต่เรื่องวันนั้นก็ผ่านมาสองวันได้แล้ว "
        " คุณไม่ได้กลับไปที่ชายหาด เพราะคุณเองก็ยังไม่หายกลัวเอลนี่เลย "
        " คุณคิดกับตัวเองตลอดสองวันนี้ว่าคุณควรลืมทุกอย่างไปตามที่ลานี่บอก
        หรือจะกลับไปที่ชายหาดนั่นดี "

        b " ออกไปเดินเล่นข้างนอกหน่อยดีกว่า "

        scene bs
        with fade
        " คุณที่คิดได้แบบนั้นก็ลุกขึ้นไปอาบน้ำก่อนจะเตรียมตัวให้พร้อมออกไปเดินเล่นในเมือง "
        " เมื่อเตรียมตัวเสร็จคุณก็รีบออกไปทันทีโดยที่ไม่ลืมล็อคห้อง "

        scene cityday
        with fade
        play music "city.mp3" fadeout 1 loop
        " ในเมืองยังสดใสเช่นเคย ผู้คนพลุกพล่านและรถมากมายขับผ่าน "
        " คุณตัดสินใจที่จะไปทานข้าวเช้าที่ร้านประจำ "

        scene restuarant11
        with dissolve
        play music "resam.mp3" fadeout 1 loop
        " ไม่นานคุณก็เดินมาถึงร้านประจำ มีสาวเสิร์ฟออกมาต้อนรับและพาคุณ
        ไปยังที่นั่งข้างหน้าต่างที่มีคนนั่งอยู่ก่อนแล้ว "
        " เธอกล่าวขอโทษ เพราะตอนนี้ในร้านเป็นเวลาเร่งรีบทำให้ไม่ค่อยมีที่ว่างในร้านมากนัก "
        " คุณบอกปัดสาวเสิร์ฟก่อนจะสั่งเมนูเดิมอย่างที่คุณสั่งประจำ "

        scene restuarant1
        with dissolve
        " เมื่อคุณเงยหน้าขึ้นมาจากเมนูคุณก็เห็นใบหน้าที่คุ้นเคย "
        " และสายตาของคุณกับเขาก็สบเข้าด้วยกัน "


        b " คุณลุงดิเอโก้? "

        scene restuarant2
        d " อ้าว นี่มันเจ้าร้อดตัวน้อยนี่! บังเอิญจังเลย ไม่เจอกันตั้ง5ปีโตขึ้นอีกแล้วนะ "
        b " คุณก็ยังดูหนุ่มเหมือนเคยเลยนะครับ แต่เคยบอกแล้วนี่ครับว่าอย่าเรียกผมแบบนั้น "
        d " อ้อ โทษทีๆ พอดีว่าเธอหน้าตาเหมือนพ่อของเธอมากเลยน่ะสิ ก็เลยเผลอ "
        scene restuarant1
        d " ว่าแต่เป็นยังไงบ้างล่ะตั้งแต่ที่เธอขอย้ายออกไปเพราะบอกว่าอยากยืนด้วยลำแข้งตัวเอง "
        d " ทั้งๆ ที่จะอยู่บ้านฉันตลอดไปก็ได้แท้ๆ ยังไงพวกเราก็เป็นครอบครัวกันนี่ "
        b " ไม่ได้หรอกดิเอโก้ ผมเองก็โตแล้วด้วยจะมัวแต่ให้คูณดูแลได้ยังไงละ "

        scene restuarant2
        with dissolve
        d " เด็กๆ นี่โตกันไวจริงๆ เลยนะ เฮ้อ "
        d " แต่วันนี้สีหน้าเธอดูแย่ลงนะ เป็นอะไรล่ะนอนไม่พอรึไง "

        scene bs
        with fade

        " คำพูดของดิเอโก้ทำให้คุณนึกถึงเรื่องของสองพี่น้อง
        บางทีคุณคงจะเครียดเกินไปจนเก็บสีหน้าเอาไว้แล้วไม่อยู่จริงๆ "
        
        scene restuarant1
        with dissolve
        b " ก็นิดนึงน่ะครับ พอดีว่าทะเลาะกับเพื่อนมาน่ะ "
        d " เพื่อน? "
        b " ครับ เป็นเพื่อนสมัยเด็กที่เคยสนิทกันมากๆ
        แต่ดูเหมือนเขาจะไม่อยากคุยกับผมแล้ว "

        " คุณตัดสินใจที่จะไม่เล่าเรื่องทั้งหมดเกี่ยวกับสองพี่น้องให้ดิเอโก้ฟัง "
        " แทนที่คุณจะได้รับการตอบกลับจากดิเอโก้ในทันที
        ดิเอโก้กลับลังเลแล้วก็คิดอะไรบางอย่างแทน "


        scene restuarant3
        with dissolve
        b " ดิเอโก้?? "
        d " ว- ว่ายังไงนะ "
        b " ก็คุณดูเหม่อๆ น่ะสิ "
        d " อ้อ คือว่านะ เด็กที่พูดถึงคงไม่ใช่สองพี่น้องที่อยู่ที่ทะเลหรอกใช่มั้ย? "
        b " คุณรู้ได้ยังไงน่ะ "
        d " จะว่ายังไงดีล่ะ พอดีลุงก็รู้จักนะสองคนนั้นน่ะ "
        b " หมายความว่ายังไงนะครับ?? "
        d " โอ๊ะ โทษทีๆ อาหารมาเสิร์ฟจนได้ ลุงขอทานก่อนละกันนะ "
        
        scene bs
        with dissolve
        " ดิเอโก้ยิ้มให้คุณก่อนที่คุณจะเริ่มจัดการ
        กับอาหารตรงหน้าที่พึ่งมาเสิร์ฟสดๆ ร้อนๆ ให้หมด "
        " หลังจากที่จัดการกับอาหารตรงหน้าเสร็จเขาก็เริ่มเล่า "

        scene frestuarant1
        with dissolve
        d " จากที่เธอเล่ามาเมื่อกี้ฉันเดาว่าลานี่คงบอกแล้วสินะ
        ว่าตัวจริงของพวกเขาคืออะไร "
        b " ครับ ได้ยินว่าพวกเธอคือปรากฏการณ์ทางสมุทธศาสตร์ "
        d " ใช่แล้ว แถมพวกเขายังมีรูปร่างเหมือนมนุษย์แต่ก็ไม่แก่ไม่ตายด้วย "
        d " พวกลุงกับร้อดดิโก้เองก็เคยเจอพวกเอลนี่ตั้งแต่สมัยเด็กๆ แล้วล่ะ "
        b " งั้นก็หมายความว่าพวกคุณเป็นเพื่อนสมัยเด็กกันเหรอครับ?! "
        d " ตกใจล่ะสิ ฮ่าๆ ใช่ พวกเราเป็นเพื่อนสมัยเด็กกัน
        พนันได้เลยว่าตอนนี้เอลนี่ก็น่าจะยังเตี้ยเหมือนเดิมแน่ๆ "

        scene frestuarant4
        " เมื่อดิเอโก้พูดถึงเอลนี่ก็ทำให้คุณนึกถึงเหตุการณ์เมื่อวันก่อน "
        " คุณยังคงรู้สึกหวาดกลัวเอลนี่ไม่หาย จนมือของคุณเริ่มสั่น "

        b " นั่นสินะ ฮ่าๆ "
        d " เป็นอะไรไปล่ะเบ็ก ทำไมถึงสั่นไปแบบนั้น? "

        scene bs
        with fade
        " คุณลังเลสักครู่ก่อนจะเล่าเรื่องทั้งหมดให้ดิเอโก้ฟัง "

        play music "main.mp3" fadeout 1 loop
        scene frestuarant5
        with dissolve
        d " เจ้าเด็กบ้า!! ถ้าไม่ได้ลานี่ช่วยเอาไว้รู้มั้ยจะเกิดอะไรขึ้น?! "
        b " ผ- ผมก็แค่อยากจะเจอเอลนี่เท่านั้นเอง "
        d " ให้ตายสิ ไม่เป็นอะไรก็ดีแล้ว "
        b " ไม่เห็นเข้าใจเลยว่าทำไมเอลนี่ถึงต้องโกธรกันขนาดนั้นด้วย "

        scene frestuarant4
        d " ลุงเข้าใจว่าเธออยากจะเจอเอลนี่นะ แต่ว่าฟังจากที่ลานี่เล่าตอนนี้น่ะยังไม่ได้หรอก
        เพราะเอลนี่น่ะน่าจะกำลังรู้สึกยึดติดกับอะไรบางอย่างอยู่ "
        b " ทำไมล่ะดิเอโก้! นี่มันเกิดเรื่องอะไรขึ้นกันแน่ "
        b " มีอะไรบางอย่างที่ผมยังไม่รู้อย่างงั้นเหรอ?! "
        d " ใจเย็นๆ ก่อนเบ็ก ยังจำได้ใช่มั้ยว่าแม่ของเธอเสียไปได้ยังไง "

        " คุณทำหน้าสับสนกับคำถาม "
        b " อืม พ่อเคยบอกผมไว้ว่าเธอเสียชีวิตหลังจากที่คลอดผมออกมา "

        scene frestuarant3
        d " ใช่แล้ว แม่ของเธอเสียชีวิตไปทันทีหลังจากที่คลอดเธอ 
        แต่จริงๆ แล้วมีบางอย่างที่ร้อดดิโก้ยังไม่ได้บอกนายอยู่ "

        scene bs
        with dissolve
        play music "sadfight.mp3" fadeout 1 loop

        scene drive
        with dissolve
        d " วันนั้นตอนที่เธอกำลังจะคลอด ก่อนจะถึงโรงพยาบาลดันมีพายุฝนเข้าพอดี
        ทำให้เราไม่สามารถขับรถเร็วมากกว่านี้ได้"
        d " มันเป็นเรื่องที่ช่วยไม่ได้ถ้าเกิดจะทำให้ไปถึงมือหมอช้า "
        d " ไม่มีใครโทษว่ามันเป็นความผิดของใครที่เธอจากไป
        เพราะเดิมทีเแม่ของเธอก็มีร่างกายที่อ่อนแออยู่แล้ว "

        scene grief
        with dissolve
        d " แต่หลังจากที่เอลนี่รู้เรื่อง หมอนั่นก็โทษตัวเองซ้ำๆ 
        ว่าที่แม่ของเธอตายเป็นเพราะตัวเองเป็นตัวต้นเหตุที่ทำให้เกิดพายุ "
        d " ถ้าได้ฟังจากลานี่เธอคงเข้าใจแล้วสินะว่า ปรากฏการณ์เอลนีโญทำอะไรได้บ้าง "

        scene frestuarant3
        with dissolve
        d " แน่นอนว่าพวกเรารู้ดีอยู่แล้วว่าเอลนี่ไม่ได้เป็นคนทำให้พายุเกิดขึ้น
        มันเป็นภัยที่เกิดขึ้นจากธรรมชาติ ไม่มีทางที่ใครจะไปหยุดไว้ได้อยู่แล้ว "
        d " แต่พอพวกเราจะอธิบาย หมอนั่นก้ไม่ยอมฟังกันเลย "
        d " แถมยังหนีหายไปดื้อๆ ไม่ยอมโผล่มาให้เห็นหน้าอีก "

        scene frestuarant1
        d " พอเอลนี่กับลานี่หายตัวไป พ่อของเธอที่ทนรับความจริงไม่ได้
        ก็เก็บตัวแล้วก็ทิ้งเธอไว้ให้ฉันดูแลยังไงล่ะ "
        d " แล้วอยู่มาวันนึงเธอก็หายไปฉันต้องออกตามหาแทบแย่ "
        b " ขอโทษนะที่ตอนเด็กๆ ฉันทำให้ต้องลำบากบ่อยๆ "
        scene frestuarant2
        d " ไม่เป็นไรหรอกๆ ฉันเองก็ผิดด้วยที่ดูแลเธอไม่ดีกว่านี้ 
        ตอนนั้นฉันบังเอิญไปเจอเธออยู่ที่ทะเลเข้า "

        scene bne
        with dissolve
        d " เธฮอยู่กับเอลนี่ กำลังคุยกันที่ชายหาดนั่น ดูสนุกมากๆ เลยล่ะ "
        d " แต่ก็ไม่รู้ว่าทำไมเอลนี่ถึงเลือกโผล่มาให้เธอเห็นหรอกนะ "
        b " ฉันเหรอ? "
        d " ใช่ เธอในวัยสี่ขวบเป็นคนไปเจอหมอนั่นและหลังจากนั้นก็
        กลายเป็นว่าพวกเธอดันกลายเป็นเพื่อนสนิทกันอีก "
        d " ฉันนี่ดีใจจนแทบน้ำตาไหลเลยนะ พ่อของเธอก็รีบมาหาเธอทันทีทั้งน้ำตาเลย "
        d " ตอนที่รู้ว่าเอลนี่กลับมาแล้วน่ะ "
        d " หมอนั่นเองก็อยากจะขอโทษเอลนี่เหมือนกัน 
        แต่ดูเหมือนว่านอกจากนายแล้ว "
        d " เอลนี่ก็ไม่โผล่ออกมาให้ใครเห็นเลยน่ะสิ "

        scene frestuarant2
        with dissolve
        d " เดิมทีแล้วพวกเธอทั้งคู่ไม่น่ามีโอกาสได้เจอกันเลยแท้ๆ "
        d " จะบอกว่าเป็นเพราะโชคชะตานำพาก็คงจะใช่ "

        scene frestuarant4
        d " แล้วก็เกี่ยวกับสาเหตุว่าทำไมพ่อของเธอถึงยึดติดกับทะเลนี้นัก "
        b " อืม ฉันยังจำได้ ไม่ว่าจะพูดยังไงพ่อก็ไม่ยอมย้ายออกมาสักที "
        b " มันแปลกมากเลยไม่ใช่เหรอ? อะไรที่ทำให้พ่อต้องทำถึงขนาดนั้นด้วย "

        scene bs
        with dissolve
        play music "main.mp3" fadeout 1 loop
        " คุณเผลอกำหมัดโดยที่ไม่รู้ตัวจนซีดขาว ความทรงจำต่างๆ 
        เมื่อหลายปีก่อนมันย้อนเข้ามาอีกครั้ง "
        " นึกถึงหน้าของพ่อ นึกถึงสีหน้าสุดท้ายก่อนที่พ่อจะจากไป "
        " พ่อยืนยันจะอยู่ที่นั่นจนช่วงสุดท้ายของชีวิต "
        " ลุงดิเอโก้ตบไหล่ๆ ของคุณเบาๆ "

        scene frestuarant3
        with dissolve
        d " ลุงรู้ว่าเรื่องแบบนี้มันทำใจยาก ลุงเองก็ไม่เห็นด้วยเหมือนกัน
        ที่ต้องเห็นน้องชายตายไปต่อหน้าต่อตา "
        d " ร้อดดิโก้น่ะเป็นคนที่ยึดติดมากว่าที่คิดน่ะ ทั้งเรื่องการตายของภรรยา "
        d " แล้วก็เรื่องของเอลนี่ ไม่ใช่ว่าร้อดดิโก้เกลียดเธอหรอกนะ "
        d " ถึงจะเป็นทั้งน้องชายตัววุ่นแล้วก็ทำหน้าที่พ่อได้ไม่ดีนัก "
        d " ถึงอย่างงั้นก็อย่าเกลียดพ่อของตัวเองเลยนะเบ็ก "

        scene frestuarant1
        d " ถึงจะไม่แสดงออกมาแต่จริงๆ แล้วเขาก็รักเธอมากนะ "
        b " เรื่องนั้นก็พอจะเดาได้อยู่หรอก แต่ผมก็แค่
        หวังว่าพวกเราจะได้ใช้เวลาอยู่ด้วยกันมากกว่านี้ "
        b " ได้ฟังเรื่องของเอลนี่แล้วก็ลานี่จากปากพ่อเอง "
        b " ถึงจะได้รู้ความจริงแล้ว ผมก็ยังทำใจไม่ได้อยู่ดีครับ "

        b " แต่ว่าถึงผมยังไม่หายโกธรพ่อ แต่ผมก็อยากเอาไว้จัดการทีหลังน่ะ "

        scene frestuarant3
        d " หมายความว่ายังไงน่ะ "
        b " ผมอยากจะไปจัดการเรื่องของเอลนี่กับลานี่ก่อนน่ะ "
        b " อยากจะไปปรับความเข้าใจกับเขา ไว้ทำเรื่องทุกอย่างเสร็จเมื่อไร "

        scene frestuarant1
        b " คงจะหายโกธรพ่อสักนิดล่ะมั้ง "

        " หลังจากนั้นคุณกับลุงดิเอโก้ก็ร่ำลากัน แม้จะยังสับสนกับเรื่องในอดีต
        ที่พึ่งได้รับรู้แต่คุณก็ไม่ได้อยากจะมัวย่ำอยู่กับที่ "
        " คุณคิดทบทวนถึงเรื่องราวต่างๆ และคิดถึงตอนที่คุณมาถึงชายหาดครั้งแรก "
        " นั่นทำให้คุณสรุปได้ว่า คุณต้องไปคืนดีกับเอลนี่ให้ได้
        และจัดการเรื่องเข้าใจผิดนี่ให้หายไปสักที! "

        scene bs
        with dissolve

        scene beachnight
        with dissolve
        play music "intense.mp3" fadeout 1 loop

        " เมื่อคุณเดินทางมาถึงที่ชายหาดอีกครั้งก็เจอคนสองคน
        กำลังตะเกียกตะกายกันอยู่บนพื้น"
        " คุณเดินเข้าไปใกล้ๆ ก็เห็นเอลนี่ที่กำลังทำร้ายลานี่อยู่?! "

        b " เอลนี่หยุดนะ!!!! "

        scene choice
        with dissolve
        " เอลนี่เงยหน้าขึ้นมาเจอคุณ ก็ปล่อยมือออกจากคอของลานี่
        และพุ่งเข้ามาหาคุณแทนทันที! "

  menu:

        " คุณจะทำยังไง? "

        "วิ่งหนีไปให้ไกลที่สุด":
            jump BadEnd

        "พยายามจะคุยด้วย":
            jump Next

  label BadEnd:

              scene bd1
              with dissolve
              play music "sadfight.mp3" fadeout 1 loop

              " ถึงแม้คุณจะรู้เรื่องต่างๆ และอดีตของเอลนี่มาแล้ว
              แต่คุณยังกลับยังคงรู้สึกกลัวเด็กตรงหน้า "
              " อย่างไรซะ แค่ตัวตนของพวกคุณก็ต่างกันแล้ว
              นั่นย่อมทำให้คุณรู้สึกหวาดกลัวเป็นธรรมดา "
              " คุณเลือกที่จะวิ่งหนีไปอย่างคนขี้ขลาด
              และทิ้งสองพี่น้องไว้ตรงนั้น โดยไม่หันกลับไปอีก "

              return #prepare to change to jump tp end credit then return

  label Next:

              scene beachnight
              with dissolve

              show elnyb angry with dissolve
              " คุณเลือกที่จะไม่หนีและพยายามจะคุยกับเอลนี่ แต่เขาก็ไม่ฟัง "
              " เอลนี่ออกแรงบีบที่คอของคุณ ทำให้คุณรู้สึกเริ่มขาดอากาศหายใจ "
              " แต่คุณยังพยายามขัดขืนเต็มที่
              และพยายามเรียกสติเอลนี่ให้กลับมาด้วย "

              b " ได้สติสักทีสิเอลนี่!!!! นี่ฉันเองนะ เบ็กไง! "

              show elnyb angry2
              e " หุบปาก! ก่อนที่ฉันจะหักคอแกซะ "

              b " ไม่! ฉันมีเรื่องต้องคุยกับนายนะเอลนี่?! "

              show elnyb angry
              e " แต่ฉันไม่มี "

              scene choice2
              with dissolve
              " แรงบีบที่คอของคุณเพิ่มขึ้นจนภาพที่คุณเห็นเริ่มเบลอ "
              " อากาศที่ใช้หายใจเริ่มลดน้อยลงเรื่อยๆ
              ถ้าหากคุณไม่รีบทำอะไรสักอย่าง คงไม่พ้นต้องจบอยู่ที่นี่แน่ "


  menu:

        " คุณจะทำอะไร? "

        "พยายามเรียกให้ลานี่ช่วย":
            jump BadEnd2

        "ต่อสู้กลับ":
            jump Next2

  label Next2:

              scene beachnight
              with dissolve
              show elnyb angry2 with dissolve
              

              " คุณต่อยเข้าไปที่หน้าเอลนี่อย่างแรงเพื่อเรียกสติ "
              " ทำให้เอลนี่ลุกออกไปจากตัวคุณได้สำเร็จ "
              " แต่เอลนี่กุมใบหน้าด้วยความเจ็บปวดและมองไปที่คุณด้วยความโกธร "
              " คุณก็ไม่ได้ยอมแพ้ พยายามทำใจดีสู้เสื้อ
              และลุกขึ้นเผชิญหน้ากับเอลนี่ "

              jump continue2


  label BadEnd2:

              scene choice3
              with dissolve
              play music "sadfight.mp3" fadeout 1 loop

              " คุณพยายามเรียกให้ลานี่ช่วย ลานี่พยายามจะลุกขึ้นแต่ก็ไม่ไหว "
              " ทำให้ลานี่ไม่สามารถช่วยคุณได้และนอนมองคุณด้วยสายตาสิ้นหวังทั้งแบบนั้น "
              " แรงบีบถาโถมเข้ามาที่ช่วงคอของคุณ เอลนี่ออกแรงจนคุณเริ่มสำลักและขาดอากาศ "
              " ภาพทุกอย่างค่อยๆ มืดลง จนสุดท้ายคุณก็หมดลมหายใจไปในที่สุด "        

              #scene bad end's picture that i have to draw myself | badend2 by your hand

              return #prepare to change to jump tp end credit then return

  label continue2:

              " เอลนี่พร้อมที่กระโจนเข้าหาคุณอีกครั้งแต่คุณก็หยุดเขาไว้ "
              show elnyb confuse
              b " ฟังนะเอลนี่ ฉันรู้ทุกเรื่องที่เกิดขึ้นแล้ว!! "

              " (ได้ผล! เอลนี่นิ่งค้างไปจริงๆ ด้วย) "
              b " ลุงดิเอโก้น่ะเป็นคนบอกฉันทั้งหมดแล้วว่าที่
              นายกลายเป็นแบบนี้เพราะเรื่องเมื่อหลายปีก่อน!"
              show elnyb angry2
              e " ถ้ารู้อย่างนั้นแล้วทำไมนายถึงยังไม่หนีไปอีก?! อยากเป็นเหมือนพ่อกับแม่นักรึไง! "
              b " ไม่ใช่สักหน่อยเอลนี่ ทั้งการตายของพ่อกับแม่ฉัน
              มันไม่ใช่ความผิดของนายเลยนะ "
              e " ที่พวกท่านจากไปมันก็เป็นแค่อุบัติเหตุ ฉันไม่เคยคิดว่า
              นายเป็นต้นเหตุของเรื่องแม้แต่นิดเดียวเลยนะ! "
              show elnyb confuse
              e " แต่เพราะฉันคือเอลนีโญ เพราะฉัน- "
              b " มันไม่สำคัญสักหน่อย! เอลนี่ก็คือเอลนี่แค่นั้นก็พอแล้วนี่?! "
              b " อีกอย่างฉันเองก็เห็นนายแล้วก็ลานี่เหมือนเป็นเหมือนครอบครัวไปแล้ว "

              " เอลนี่นิ่งไปหลังจากที่ได้ยิน "

              b " ถึงฉันเสียทั้งพ่อแล้วก็แม่ไปแล้วแต่ฉันก็ยังมีพวกนาย
              ที่คอยอยู่ข้างฉันมาตั้งแต่เด็กๆ นี่ "
              b " ฉันไม่อยากเสียคนในครอบครัวไปมากกว่านี้แล้วเอลนี่ "
              b " เพราะงั้นช่วยกลับมาได้มั้ย กลับมาหาลานี่ แล้วก็ทุกคน? "
              show elnyb confuse2
              e " ทำไม "
              e " ทำไมถึงต้องมาให้อภัยสัตว์ประหลาดอย่างฉันด้วย "
              e " เพราะฉันไม่สามารถควบคุมเหตุการณ์เอลนีโญได้
              เรื่องมันถึงได้กลายเป็นแบบนี้ "
              l " พี่คะ... "
              e " รู้แล้วก็ยังอยากจะนับฉันเป็นครอบครัวอีกรึไง "
              b " เรื่องที่ผ่านไปแล้วก็ปล่อยให้มันเป็นแค่อดีตเถอะ
              อีกอย่างนายก้ไม่ได้ตั้งใจให้มันเป็นแบบนี้เหมือนกันนี่ "
              l " ฉันก็ด้วย ต่อให้เอลนี่จะทำตัวห่างเหินหรือทำไม่ดีกับฉันแค่ไหน
              แต่เอลนี่ก็ยังเป็นพี่ของฉันเสมอนะ "
              show elnyb calm
              e " ต่อให้ฉันจะไม่ใช่มนุษย์ เป็นแค่สัตว์ประหลาดฆ่าคนน่ะเหรอ "

              show elnyb confuse2
              b " ไม่ว่าใครจะพูดยังไง สำหรับฉันนายคือครอบครัว
              คนสำคัญของฉันเอลนี่ "
              b " ไม่จำเป็นโทษตัวเองอีกแล้วนะ นายไม่ได้อยู่ตัวคนเดียวเลยนะเอลนี่ "
              l " กลับมาหาพวกเราเถอะนะคะพี่ "

              play music "soft.mp3" fadeout 1 loop
              " คุณยื่นมือออกไปหาเอลนี่ช้าๆ ภายในตาของเขาเต็มไปด้วยความลังเล "
              " แต่ว่าตั้งแต่ที่คุณได้เลือกที่จะพยายามเอาชนะความกลัวของตัวเองเพื่อคืนดีกับเอลนี่
              ก็ทำให้เอลนี่เริ่มกล้าที่จะยอมรับตัวเองมากขึ้นทีละนิด "

              show elnyb calm2
              " สุดท้ายเอลนี่เลือกที่จะจับมือคุณเอาไว้ "
              
              e " ฉันจะไม่ลืมสิ่งที่เกิดขึ้นแล้วก็เรื่องในวันนี้ คำพูดที่นายพูดกับฉันในวันนี้
              มันจะสลักอยู่ในใจฉันตลอดไป "
              show elnyb smile
              e " ขอบคุณมากนะลานี่ที่คอยอยู่กับฉันมาตลอด
              ถึงแม้ว่าฉันจะไม่เคยเป็นพี่ชายที่ดีให้เธอได้เลย "
              e " แล้วก็เธอ- "

              scene end
              with dissolve
              e " แม้จะผ่านไปหลายปีแล้วแต่ก็ยังเชื่อและให้โอกาสฉันอีก
              ขอบคุณมากๆ เลยนะ เบ็ก "
              e " ไม่ว่าอะไรจะเกิดขึ้น หลังจากนี้ฉันจะไม่หนีอีกแล้ว "
              e " จะเผชิญหน้ากับทุกอย่างอย่างตรงไปตรงมา "
              e " พร้อมกันกับพวกนาย "

              stop music fadeout 1 

              $ persistent.end = True

              scene #the ending, three of them hug and smile and then credit
              
              return

              




        #เบ็คตัดสินใจที่จะลืมเรื่องพ่อไปก่อน ก็คือยังโกธรอยู่ แล้วไปคิดเรื่องสองพี่น้องแทน พอหลังจากจับต้นชนปลายได้ก็เลยรีบไปหาทั้งสองคน
        #ทั้งสองคนยังอยู่ที่หาด และเอลนี่ก็กำลังทำร้ายลานี่ ก็คือเบ็กจะไดเห็นว่าที่ลานีี่บอกว่าเอลนี่เริ่มไม่เป็นตัวของตัวเองนี่มันเป็นยังไง
        #แล้วพอเอลนี่เห็นเบ็กก็พุ่งเข้าไปคว้าคอทันที แล้วก็พยายามขู่เบ็กให้กลัว
        #แต่เบ็กก็ไม่ยอมแพ้ แล้วก็พยายามเถียงเอลนี่ ทั้งคู่ทะเลาะกันไปมาก่อนที่เบ็กจะบอกเอลนี่ว่าตัวเองรู้ความจริงทุกเรื่องแล้ว แล้วก็ไม่โกธร
        #เอลนี่ก็เลยยอมใจเย็นลงแล้วยอมให้เบ็กปลอบตัวเอง
        #ลานี่ก็ปรับความเข้าใจกับพี่ชาย และเอลนี่ก็สัญญาว่าจะไม่เก็บทุกอย่างไว้กับตัวเองแบบนี้อีก
      