define f = Character("คุณพ่อ", color="#000000")
define b = Character("เบ็ก", color="#000000")
define e = Character("เอลนี่", color="#a54848")
define l = Character("ลานี่", color="#30a8b8")
define el = Character("ลานี่ & เอลนี่", color="#9a26a5")
define c = Character("คนขับรถ", color="#000000")
define j = Character("ผู้ประกาศข่าว", color="#000000")

transform grayed:
  matrixcolor SaturationMatrix(0) * BrightnessMatrix(-0.25)

transform reset_color:
  matrixcolor SaturationMatrix(1) * BrightnessMatrix(0)

transform left:
  xcenter 0.25

transform right:
  xcenter 0.75

transform center:
  xcenter 0.5

label start:
  scene intro
  play music "sea.mp3" fadeout 1 loop
 
  j " สวัสดีครับท่านผู้ฟังทุกท่าน และนี่คือรายการแจ้งฝนฟ้าอากาศ รายการที่จะคอยแจ้งข่าวสารเกี่ยวกับฝนฟ้าอากาศให้คุณทราบอย่างสม่ำเสมอ!"
  j " วันนี้ผมมาอยู่กับผมจอร์ชเช่นเคยนะครับ "
  
  scene intro2
  j " ในวันนี้มีรายงานด่วนจากทีมงานที่พึ่งลงพื้นที่ไปเมื่อหลายวันก่อน ทีมงานพบว่าสภาพอากาศบริเวณชายฝั่งไม่ค่อยสู้ดีนัก "
  j " ระดับน้ำรอบชายฝั่งPaitaกำลังสูงขึ้นอย่างต่อเนื่อง และคาดว่าจะเพิ่มขึ้นเรื่อยๆ จนถึงสิ้นปีส่งผลให้บ้านเรือนเสียหายไปหลายหลัง "
  j " แนะนำให้ผู้อาศัยทุกท่านรีบอพยพโดยด่วน เพื่อความปลอดภัยของชาวเมืองทุกท่าน "
  j " ย้ำ! ขอให้ผู้อาศัยทุกท่านรีบอพยพโดยด่วน "

  scene introb
  show son with dissolve
  " เสียงวิทยุทำให้ทุกอย่างหยุดลง ตัวคุณที่เป็นเด็กไม่รู้ประสีประสามองผู้เป็นพ่อที่นิ่งไป หลังจากที่ได้ยินเสียงจากวิทยุด้วยแววตาสับสน "
  f " เราเองก็คงจะทำงานนี้ต่อไปได้อีกไม่นานแล้วสินะ ถ้าสถานการณ์ยังแย่แบบนี้ต่อไปคงต้องขนของเร็วกว่าที่คิด "

  scene 2father
  with dissolve
  scene 3father with dissolve
  scene 2father 
  with dissolve
  " คุณได้ยินเสียงถอนหายใจ น้ำเสียงของคุณพ่อดูเหนื่อยๆ เล็กน้อย "
  f " เบ็ก ทำไมลูกไม่ไปเล่นสักหน่อยล่ะ พวกเพื่อนๆ กำลังรออยู่ไม่ใช่เหรอ"

  scene who
  with dissolve
  " คำพูดของคุณพ่อทำให้ถึงเพื่อนทั้งสองคนที่คุณได้เป็นเพื่อนกันที่ชายหาด "

  scene beachdayblur 
  with dissolve
  show run with dissolve
  " คุณพยักหน้าและเห็นด้วย และวิ่งไปที่สถานนัดพบที่พวกคุณทั้งสามคนได้นัดกันไว้ "

  scene who
  with dissolve
  " คุณวิ่งมาสักพัก ผ่านชายหาดผ่านเรือประมงมากมาย จนรู้สึกว่าขาของคุณเริ่มล้า "
  " ในจังหวะที่คุณรู้สึกอ่อนแรงและกำลังจะล้ม ก็มีมือคู่นึงมาคว้าคุณเอาไว้ มือคู่นั้นเป็นของ... "

 
  menu:

        "คนซ้าย":
            jump Elny

        "คนขวา":
            jump Lany

  label Elny:

        scene beachday
        show  fall down1
        " ปรากฏว่าเจ้าของมือหนาที่จับคุณไว้ก็คือ เอลนี่ คุณได้ยินคนตรงหน้าบ่นกับตัวเองเบาๆ ถึงความซุ่มซ่ามของคุณ "
        e " ซุ่มซ่ามจริงๆ "

        show fall down2

        " แม้คำพูดจะดูใจร้ายไปหน่อยแต่จริงๆ แล้วเอลนี่ก็เป็นคนที่ใจดีมากไม่ต่างจากผู้เป็นน้องสาว "
        " เสียอย่างเพียงอย่างเดียวก็คือการที่เจ้าตัวใช้คำพูดไม่เก่งและขี้อายไปเสียหน่อย "

        e " จะให้จับอีกนานมั้ยเนี่ย เห็นมั้ยว่ามันเมื่อย "

        e " ......... "
        
        show  fall down3

        e " ดูจากสีหน้าแล้วน่าจะยังสบายดีนี่ งั้นก็เลิกเหม่อแล้วรีบลุกขึ้นมาได้ละ "

        jump continue

  label Lany:

        scene beachday
        show lfall down1

        " เมื่อคุณลืมตาขึ้นมา พบว่าตัวเองไม่ได้ล้มไปกับพื้น เพราะ ลานี่ จับมือคุณเอาไว้ได้ทัน ในขณะที่เธอก็พยายามสังเกตไปด้วยว่าคุณบาดเจ็บตรงไหนรึเปล่า "
        l " เป็นอะไรรึเปล่าคะ บาดเจ็บตรงไหนรึเปล่า ลุกขึ้นไหวมั้ย "
        l " .......คือว่า"

        " คุณจ้องมองใบหน้าของเด็กสาวอย่างลืมตัว เพราะเธอจับมือคุณไว้ ใบหน้าของพวกคุณจึงไม่ได้ห่างกันมากนัก "
        " ดวงตาของเธอประดับไว้ด้วยความกังวลและมันก็เป็นแบบนี้ตั้งแต่ครั้งแรกที่ลานี่กับเด็กชายได้พบกัน "
        show lfall down2

        l " ..... "

        

        " เมื่อเด็กชายเริ่มสังเกตสีหน้ากระอั่กกระอ่วนของลานี่ได้เพราะเขาไม่รีบลุกขึ้น ทำให้เด็กชายรู้ตัวว่าเขาเผลอจ้องหน้าเธอนานเกินไปจนได้ "

        show lfall down3
        l " อ๊า ลุกขึ้นได้แล้วสินะคะ ดีแล้วละค่ะ "

        jump continue

  label continue:

        scene who1
        with dissolve

        " หลังจากคุณลุกยืนขึ้น ร่างของคนสองคนที่คุ้นเคยก็ปรากฏขึ้นตรงหน้าคุณ "
        " คุณกล่าวคำขอบคุณหลังจากที่โดนช่วยเอาไว้ "

        scene beachdayblur
        show elny angry at left 
        show lany at right, grayed
        e " วันหลังจะไปไหนก็หัดดูทางหน่อยสิ "

        show elny sigh at grayed
        show lany smile at reset_color
        l " ต้องระวังไม่ให้บาดเจ็บ ไม่งั้นเดี๋ยวจะเป็นแผลเป็นเอาได้นะคะ "

        show elny angry at reset_color
        show lany sigh at grayed
        e " ก็ตามที่ลานี่บอก ถ้าเป็นอะไรไปจะทำยังไงฮะ จำไม่ได้รึไงว่าครั้งล่าสุดที่เธอล้มน่ะเธอร้องไห้หนักแค่ไหน??" #elny angry and lany sigh at grayed
        b " อะไรเล่า! เมื่อกี้ก็ไม่ได้ล้มสักหน่อยนี่เอลนี่ขี้บ่น " #elnny angry and lany sigh, both at grayed

        show elny angry at reset_color
        e " นี่! " #elny angry at reset_color
        b " แบร่!! "

        show elny sigh 
        e " เฮ้อ.. เพราะงี้ยังไงล่ะ ฉันถึงได้ไม่ชอบพวกเด็กๆ " #elny sigh

        show elny sigh2 at grayed
        show lany sigh at reset_color
        l " อ.. เอลนี่ อย่าพูดแบบนั้นกับเด็กๆ สิ " #elny sigh2 at grayed and lany sigh at reset_color

        show lany smile
        l " เอาเป็นว่าไม่เจ็บตัวก็ดีแล้วล่ะ เพราะงั้นใจเย็นก่อนนะทั้งสองคน " #elny sigh2 at grayed and lany smile

        show elny sigh2 at reset_color
        show lany smile at grayed
        e " ..... " #elny sigh2 at reset_color and lany smile at grayed

        show elny
        e " เพราะลานี่หรอกนะ ฉันถึงใจเย็นลงน่ะ " #elny and lany smile

        show elny at grayed
        show lany smile at reset_color
        l " แล้วทำไมวันนี้ถึงรีบมาขนาดนี้ละค่ะ ปกติเธอจะมาหาพวกเราช้ากว่านี้นี่นา " #elny at grayed and lany smile at reset_color

        show elny at reset_color
        show lany smile at grayed
        e " นั่นสิ ขอฉันฟังเหตุผลหน่อยว่าอะไรทำให้เธอต้องรีบวิ่งมาขนาดนี้ " #elny at reset_color and lany smile at grayed

        show elny at grayed
        " คุณมองทั้งสองคนก่อนจะเริ่มเล่าสิ่งที่ตัวเองได้ยินมาจากวิทยุ " #elny at grayed and lany smile 


        scene beachdayblur
        #(only)elny sigh2 at center, reset_color 

        show elny sigh2 at center, reset_color 
        with dissolve
        e " ..... "
        e " เข้าใจล่ะ ว่าทำไมตาแก่นั่นถึงอยากให้เธอรีบมาหาพวกเรา "
        e " เธอ.."
        
        show elny sigh3
        e " ต้องย้ายบ้านเร็วๆ นี้แล้วไงล่ะ " #(only)elny sigh3 

        show elny sigh2 
        b " ม.. หมายความว่ายังไงน่ะ เอลนี่พูดเรื่องอะไรอยู่เหรอ " #(only)elny sigh2 at grayed

        show elny sigh3 
        e " ตาแก่นั่นคงอยากให้เธออยู่กับพวกเรามากๆ จะได้สร้างความทรงจำดีๆ ก่อนจากกัน " #(only)elny sigh3 at reset_color
        e " แต่พูดไปเด็กอย่างเธอก็ไม่เข้าใจหรอก สรุปสั้นๆ ก็คือถ้าเขาไม่ย้ายออกไปเร็วๆ นี้ตัวเธอเองรวมถึงครอบครัวคงไม่รอดแน่ " 

        show elny sigh4 
        b " ไม่เห็นจะเข้าใจเลย! ทำไมฉันต้องย้ายออกไปด้วยล่ะ แล้วทั้งสองคนจะตามมาด้วยรึเปล่า " #(only)elny sigh3 at grayed

        show elny sigh3 
        e " พวกฉันไปไหนไม่ได้หรอกนะ " #(only)elny sigh3 at reset_color
        
        show elny sigh 
        b " ทำไมย้ายไม่ได้ล่ะ! " #(only)elny sigh at grayed

        show elny angry 
        e " เป็นเด็กแท้ๆ อย่าถามมากจะได้มั้ย ถ้าฉันพูดไปแล้วคิดว่าตัวเองจะเข้าใจรึไง " #(only)elny angry, reset_color

        scene beachdayblur 

        show elny angry at center
        b " ก็ต้องเข้าใจสิ เพราะพวกเราเป็นเพื่อนกันนี่นา! " #elny sigh3 at left and lany shock at right
      
        scene beachdayblur
        show elny sigh3 at left
        show lany sigh at right
        el " ......" #elny sigh2 and lany sigh at grayed

        show elny sigh3 
        show lany sigh at grayed
        e " เอาเป็นว่าพวกเราก็มีเหตุผลของพวกเราแหละน่า " #elny sigh3 and lany sigh at grayed

        show elny sigh2 at grayed
        show lany sigh at reset_color
        l " เพราะงั้นอยากให้เข้าใจแล้วก็อย่าโกธรพวกเราเลยนะคะ " #elny sigh3 at grayed and lany sigh at reset_color

        b " ....... "

        scene beachdayblur

        show elny at center
        e " ที่นี้ก็เข้าใจแล้วใช่มั้ย เอาล่ะ จากนี้จะขอแนะนำในฐานะเพื่อนละกันนะ " #(only)elny at reset_color with dissolve
        e " ถ้าการคาดการณ์ของฉันไม่ผิด อีกไม่นานน้ำจะสูงขึ้น และในอีกไม่กี่วันที่นี่จะกลายเป็นทะเลด้วยแน่นอน "
        e " เพราะงั้นหลังจากวันนี้ก็เชื่อฟังที่ตาแก่พูดแล้วอย่ามาที่นี่อีก เข้าใจมั้ย.."
        b " ....ไม่เห็นจะเข้าใจเลย " 

        show elny angry
        e " เห็นมั้ยล่ะ! เพราะงั้นตั้งแต่พรุ่งนี้เป็นต้นไปก็อยู่ที่บ้านและอย่ามาที่ทะเล เพราะมันอันตราย เข้าใจมั้ย! " #(only)elny angry
        b " อะไรเนี่ย ทำไมต้องปิดบังกันด้วยเล่า! ทั้งสองคนไม่เห็นจะอธิบายอะไรเลย! ก็ได้! จะไม่มาที่ชายหาดอีกแล้ว "
        b " เอลนี่ใจร้าย! เอลนี่ขี้งก! "
        
        show elny sigh2 
        " เบ็กวิ่งออกไปและไม่หันกลับมามองทั้งคู่อีก โดยที่ไม่รู้เลยว่าใบหน้าของทั้งคู่ประดับความเศร้าสร้อยไว้หลังจากที่เด็กชายวิ่งหนีไปแล้ว " #(only)elny sigh2
        " หลังจากแผ่นหลังเด็กชายห่างไปไกล ลานี่ก็ได้เอ่ยถามพี่ชาย "

        l " จะดีเหรอเอลนี่ ไม่อธิบายอะไรให้เด็กคนนั้นฟังน่ะ แล้วก็เรื่องตัวตนของพวกเรา..."
        show elny sigh3
        e " ช่างเถอะลานี่ ให้เด็กนั่นคิดไปแบบนั้น ดีแล้วล่ะ " #(only)elny sigh3

        play music "dream.mp3" fadeout 1 loop
        scene bs
        with dissolve

        b " ลานี่.. เอลนี่.."
        b " ทั้งสองคน....."
        " ....... "
        " ........... "

        scene bs
        with dissolve
        with hpunch

        b " เหวอ!! "


        scene bedroomday
        play music "morning.mp3" fadeout 1 loop
        
        show wake 1 at center
        b " อูย เจ็บๆ อะไรเนี่ย ฝันหรอกเหรอ.. เพราะจะได้กลับไปที่บ้านเกิดรึเปล่านะก็เลยฝันถึงสองคนนั้นอีก " #wake 1 at center 

        show wake 3
        b " นี่มันก็ผ่านมา20ปีได้แล้วสินะ หลังจากที่เรากับญาติย้ายมาตอนนั้น " #wake 3
        b " พ่อเองก็เสียไประหว่างนั้นแล้วด้วย จากเหตุการณ์เอลนีโญเมื่อ20ปีก่อน ทำไมพ่อถึงไม่ย้ายออกมาพร้อมกับเรากันนะ " 

        show wake 4
        b " อาชีพชาวประมงมีอะไรสำคัญนักหนาถึงกับต้องสละชีวิตเพื่อมันด้วย.. " #wake 4

        show wake 2
        b " แต่เดี๋ยว.. แดดแยงตาขนาดนี้นี่มันกี่โมงแล้วเนี่ย! " #wake 2
        b " ...... " 

        show wake 1
        b " 11 โมง!! ไม่ได้การแล้ว ต้องรีบไปแล้วก่อนที่จะไม่ทันรถ!! " #wake 1

        scene bs
        with dissolve

        scene cityday
        with dissolve
        play music "city.mp3" fadeout 1 loop

        show wait 1 at center
        b " โอย ให้ตายเถอะคนเยอะชะมัด.. จะมีรถบ้างมั้ยนะเวลาป่านนี้แล้ว " #wait 1 at center
        b " คือว่า ขอโทษนะครับ พอจะไปส่งผมที่หาดPaitaได้มั้ยครับ "

        scene cityday

        show driver 3 at right
        show wait 1 at left, grayed
        c " อะไรนะ หาดPaita? หนุ่มๆ แบบนี้มีธุระอะไรถึงต้องไปที่นั่นล่ะ " #driver 3 at right and wait 1 at left, grayed

        show driver at grayed
        show wait 2 at reset_color
        b " ถ้าให้พูดก็คงยาวน่ะครับ พอดีไม่ได้กลับไปนานแล้วเลยจะกลับไปเยี่ยมหลุมศพของพ่อหน่อยนะครับ " #driver 3 at grayed and wait 2 at reset_color

        show driver 2 at reset_color
        show wait 2 at grayed
        c " อย่างงั้นเหรอ อย่าบอกนะว่า พ่อหนุ่มก็เป็นคนที่ต้องหนีจากเหตุการณ์น้ำท่วมจากเอลนีโญเมื่อ20ปีก่อนเหมือนกันเรอะ " #driver 2 at reset_color and wait 2 at grayed

        show driver 2 at grayed
        show wait 2 at reset_color
        b " จะพูดอย่างนั้นก็ได้แหละครับ ผมเองตั้งแต่ย้ายบ้านไปก็ไม่ได้กลับไปอีกเลยน่ะครับ " #driver 2 at grayed and wait 2 at reset_color
        
        show driver 1 at reset_color
        show wait 3 at grayed
        c " คนบ้านเดียวกันนี่เอง! งั้นก็ขึ้นมาสิ เดี๋ยวลุงจะพาไปส่งให้รวดเดียวถึงเลย " #driver 1 at reset_color and wait 3 at grayed

        scene bus
        play music "car.mp3" fadeout 1 loop

        
        " มันก็นานมาแล้วตั้งแต่ที่คุณจะได้เดินทางกลับบ้าน ครั้งล่าสุดที่คุณได้กลิ่นของทะเลเห็นจะเป็นเมื่อ20ปีก่อน "
        " คุณนั่งบนรถบัสเงียบๆ เพียงลำพังเพราะเวลานี้ไม่ใช่เวลารถวิ่ง แต่ลุงคนขับก็ยังอาสาไปส่งทั้งๆ ที่คุณมาสายขนาดนี้ "
        " คงเป็นเพราะว่าคุณเคยมาจากที่ชายหาดนั่นละมั้ง "

        scene bs
        with dissolve
        play music "dream.mp3" fadeout 1 loop


        " คุณหลับตาลง นึกถึงช่วงเวลาดีๆ ที่เคยมีในสมัยยังเป็นเด็ก "
        " ทันใดนั้นใบหน้าของคนสองคนก็พุดขึ้นมาในใจ "

        scene who2
        " สิ่งที่จำได้มีเพียงแค่ชื่อและใบหน้าอันแสนเรือนราง "
        " เป้าหมายอีกอย่างในการกลับไปบ้านเกิดในครั้งนี้ คือการตามหาเพื่อนสมัยเด็กของตัวเองอีกครั้ง.. "
        " เพราะคุณยังจำได้ดีว่าก่อนจากมาคุณพูดแย่ๆ ใส่พวกเขาไป ทั้งๆ ที่พวกเขาทำไปทั้งหมดก็เพราะเป็นห่วง "

        b " สองคนนั้นแค่เตือนเราเท่านั้นเอง เราที่เป็นเด็กแต่ไปว่าเขาแบบนั้น "
        b " แย่ที่สุดเลย.."

        scene bs
        with dissolve

        c " เอ้า ถึงแล้วล่ะไอ้หนุ่ม! ตื่นได้แล้วๆ "

        scene arrival
        play music "sea.mp3" fadeout 1 loop

        " คุณลืมตาขึ้นมาก็พบว่าคุณมาถึงชายหาดเป็นที่เรียบร้อย "
        " คุณรีบลงมาจากรถ ก่อนจะเจอแสงแดดยามบ่ายกระทบเข้ากับร่างกาย "

        c " ลุงต้องไปแล้วล่ะไอ้หนุ่ม เพราะอีกเดี๋ยวก็ต้องกลับไปทำงานแล้ว "
        c " ทะเลที่นี่ไม่ได้เปลี่ยนไปเลย ขอเที่ยวให้สนุกล่ะ! "

        " ..... "
        scene beachday
        with fade

        " เป็นไปตามที่คุณลุงคนขับรถพูด ทุกอย่างยังคงเหมือนเดิม ชายหาดไม่เคยเปลี่ยนไปเลย "
        " คุณใช้สายตาทอดมองออกไปเรื่อยๆ หวังจะเก็บบรรยากาศระลึกถึงความหลังเท่าที่ทำได้ "
        " หางตาของคุณก็เหลือบไปเห็นใครบางคนเข้า "

        show lanyb dark at center
        " ด้วยส่วนสูงที่คุ้นเคยและการแต่งกายที่ชวนให้รู้สึกคิดถึงอย่างบอกไม่ถูก "
        " คุณตัดสินใจที่จะลองหันไปหาคนๆ นั้น และแล้วร่างคนที่คุ้นเคยก็ปรากฏสู่สายของคุณ "

        show lanyb 1 with dissolve
        b " ลานี่.. "

        show lanyb 2 
        l " เบ็ก? นั่นเบ็กเหรอ.."

        " เป็นเธอจริงๆ คุณไม่ได้ดูผิดจริงๆ ด้วย! "

        b " ลานี่! ใช่ลานี่จริงๆ ด้วยดีใจจังที่ได้เจอกันอีก ตอนนั้นก่อนที่จะย้ายออกไป ขอโทษนะที่พูดไม่ดีใส่น่ะ " 

        show lanyb 3
        l " ไม่เป็นไรหรอกจ้ะ ตอนนั้นเธอก็ยังเด็กด้วยนี่นา พวกเราไม่โกธรหรอกนะที่เธอจะทำตัวแบบนั้นน่ะ "
        b " ช่วงนี้เป็นยังไงบ้างเหรอ ว่าแต่ลานี่ ทำไมเธอดูแทบไม่เปลี่ยนไปเลยล่ะ ฉันรู้สึกว่าเธอไม่ได้สูงขึ้นเลยนะ แถมยังแต่งตัวเหมือนสมัยก่อนอีก "
        b " แล้วก็ทำไมเธอถึงดู.. เศร้าๆ ล่ะลานี่ มีอะไรรึเปล่า "

        show lanyb cry2
        l " ไม่มีอะไรหรอก ก็แค่ฉันดีใจที่ได้เจอเธอน่ะเบ็ก แล้วก็จริงๆ แล้วที่ร่างกายฉันไม่ได้เปลี่ยนไปเลยมันมีเหตุผลอยู่ล่ะ "
        l " ฉันรู้อยู่แล้วว่าสุดท้ายยังไงวันที่จะต้องบอกเธอต้องมาถึง "
        l " ฉันกับพี่ชายฉันไม่ได้ตั้งใจจะปิดบังเธอเลยนะเบ็ก จริงๆ แล้วพวกเราไม่ได้เป็นมนุษย์หรอกนะ "

        show lanyb cry3
        l " ความจริงก็คือ พวกเราเป็นปรากฏการณ์ทางสมุทรศาสตร์ที่จำแลงกายมาต่างหากล่ะ.. "
        
        " คุณมองหน้าลานี่เหมือนว่าเธอเป็นบ้าไปแล้ว ซึ่งหญิงสาวก็ไม่ได้โกธรอะไรที่เพื่อนสมัยเด็กของตัวเองทำหน้าเหมือนกับว่าเธอเป็นคนบ้า "
        " เพราะนั่นก็ควรจะเป็นรีแอคชั่นปกติที่มนุษย์ควรจะมีให้สิ่งเหนือธรรมชาติอย่างพวกเธอจริงๆ นั่นแหละ "
        b " ฮ่าๆ ลานี่มุกของเธอตลกดีนะ "
        l " ฉันขอโทษนะที่จู่ๆ ก็พูดอะไรแปลกๆ แต่ฉันที่ฉันพูดไม่ใช่เรื่องโกหกหรอกนะ ฉันจะแสดงให้เธอดูเองว่าฉันไม่ใช่มนุษย์ "

        " ทันทีที่ลานี่พูดจบ หญิงสาวเดินตรงไปที่ทะเลจนน้ำทะเลสูงถึงหัวเข่าก่อนจะตวัดมือของตัวเองขึ้นคล้ายกับกำลังเต้นรำ เบ็กรู้สึกตกตะลึงกว่าเดิมเมื่อเห็น " #cutscene ลานี่เต้นตรงน้ำ โดยที่มีเบ็กมองอยู่ไกลๆ
        " ไม่ใช่เพราะว่าจู่ๆ หญิงสาวก็เริ่มเต้นรำ แต่เป็นเพราะว่าหญิงสาวกำลังเต้นรำไปพร้อมกับสายน้ำราวกับเธอเป็นหนึ่งเดียวกับมัน "
        
        b " เธอ...ควบคุมน้ำได้?? "
        " แม้คำพูดแทบจะไม่สามารถกลั่นออกมาจากลำคอได้ ความกลัวเริ่มกัดกินแต่เบ็กก็กลั้นใจถามอีกฝ่ายออกไป "
        l " อื้ม พวกเราเกิดมาพร้อมกับโลกนี้เลย ในตอนที่รู้สึกตัวอีกทีก็ฉันก็ทำแบบนี้ได้แล้วล่ะ "
        l " พวกเราก็ไม่รู้ด้วยซ้ำว่าทำไมพวกเราถึงต้องเกิดมา สิ่งเดียวที่พวกเรารู้ก็คือพวกเรามีหน้าที่ที่ต้องทำ " #ซูมไปที่ลานี่ที่กำลังเล่นกับน้ำที่เป็นรูปร่างปลาบนมือ

        " ถึงคุณจะไม่อยากเชื่อแต่จะให้ทำยังไงได้อีก ในเมื่อความจริงมาประเคนตรงหน้าแบบนี้ " #ตัดกลับมาที่เบ็กที่เหงื่อตก #เบ็ก at righht with lany at left
        b " ฉันงงไปหมดแล้วลานี่ คือนี่มันอย่างกับอยู่ในหนังรึการ์ตูนเลย ฮะๆ "
        b " ไม่ได้ล้อเล่นจริงๆ ด้วยสินะ "
        l " ถ้าเธออยากลองจับ จะลงมาในน้ำก็ได้นะ "
        b " ม ไม่เป็นไร ขอบใจนะ "

        " คุณปฎิเสธเธอไปตรงๆ ก่อนจะสังเกตได้ว่ามีคนหายไป "
        b " จะว่าไปตอนนี้เอลนี่เป็นยังไงบ้างเหรอลานี่ "
        l " ....... "
        " สีหน้าของลานี่ซีดลง เธอจับมือของคุณให้มานั่งที่โคดหินใกล้ๆ ก่อนจะเริ่มพูดอีกครั้ง "
        
        l " เอลนี่เขาแยกตัวไปอยู่คนเดียวแล้วน่ะ ตั้งแต่เมื่อปีก่อนที่เหตุการณ์ เอลนีโญ เกิดขึ้นที่นี่ "
        b " เอลนีโญ? "
        l " จริงสิ ฉันลืมบอกชื่อเต็มของพวกเราไปเลย "
        l " ชื่อเต็มของฉันคือลานีญา และพี่ชายของฉันเอลนีโญ พวกเราก็คือปรากฏการณ์ทางสมุทรศาสตร์ที่กำลังเกิดขึ้นในประเทศนี้ยังไงล่ะ "
        b " ได้ยังไงล่ะลานี่ แล้วลานี่ที่ฉันเห็นตรงหน้าคืออะไรกันล่ะ "
        l " ฉันก็ไม่รู้เหมือนกัน แต่สิ่งที่เกิดขึ้นอยู่นี่ก็คือพวกเราจริงๆ เพียงแต่ตั้งแต่ศตวรรษที่17ที่พวกเราถูกค้นพบโดยชาวเปรูว่าพวกเราคือสาเหตุของการเปลี่ยนแปลงอย่างผิดปกติในทะเล พวกเราก็มีร่างกายและจิตสำนึกขึ้นมาแล้วล่ะ "
        l " ฉันกับพี่ชายมีร่างกายที่เป็นอมตะ ไม่รู้สึกหิวและไม่มีวันแก่ แถมพวกเราก็ออกห่างจากทะเลไม่ได้ด้วย "
        b " งั้นแสดงว่าที่พวกเธอไม่ย้ายบ้านไปกับฉันตอนนั้นก็.... "
        l " ใช่ ไม่ใช่ว่าพวกฉันไม่อยากตามเธอไปนะเบ็ก แต่พวกเราไปไม่ได้ต่างหาก "
        b " ลานี่... "
        l " อย่าทำหน้าเศร้าสิเบ็ก มันไม่ใช่ความผิดเธอหรอกนะ ก็ตอนนั้นพวกเราเลือกที่จะไม่อธิบายเองนี่นา "
        l " พวกฉันเป็นปรากฏการณ์ที่ไม่มีที่มาแถมยังสร้างปัญหาไว้ตั้งมากมายขนาดนี้อีก เป็นตัวตนที่ไร้ประโยชน์เพราะงั้นตอนนั้นเอลนี่เลยเลือกที่จะเก็บไว้เป็นความลับจากเธอยังไงล่ะ "
        b " แต่เธอก็ไม่ได้อยากให้มันเป็นแบบนี้นี่! พวกเธอไม่ได้อยากทำร้ายใครสักหน่อย "
        l " ..... "
        b " ถึงพวกเธอจะไม่ใช่มนุษย์ แต่ตอนนี้เธอก็ร่างกายแล้วก็มีความรู้สึกนึกคิดเป็นของตัวเองนี่?! "
        b " ถ้าเลือกได้พวกเธอก็คงไม่ได้อยากทำร้ายโลกใบนี้แล้วก็ใช้ชีวิตเหมือนคนทั่วไป เพราะงั้น- "
        b " อย่าพูดเหมือนกับว่าตัวเองไม่ควรเกิดมาจะได้มั้ยเล่า "

        #maybe elny sudenly appear cuz he sense beck has come back from far away. then they begin to argue while lany try to protect beck from her brother. elny just live at the beach but far away from his sister.
        
        l " ขอบคุณนะเบ็กที่พูดแบบนั้นน่ะ ฉันขอบคุณมากจริงๆ แต่ฉันก็ไม่อยากให้เธอต้องมายุ่งเกี่ยวกับพวกเราไปมากกว่านี้แล้วล่ะ "
        b " ยังไงนะลานี่ หมายความว่ายังไง "
        l " ฉันคิดมาสักพักแล้วล่ะตั้งแต่ที่เธอจากไป ตั้งแต่ที่เอลนี่เปลี่ยนไป เบ็ก รู้รึเปล่าว่าตอนนี้เขาเป็นยังไงบ้าง "
        l " จริงสิ ฉันพูดอะไรไปเนี่ยเธอจะไปรู้ได้ยังไง งั้นฉันจะอธิบายให้เธอฟังเองว่าตอนนั้นมันเกิดอะไรขึ้น..."

        #flashback come in
        #So many fuckin cutscene
        l " เธอรู้อยู่แล้วใช่มั้ย ว่าโลกนี้มีสิ่งที่เรียกว่าวัฏจักรของสภาพอากาศ เดิมที่ก็มีแค่พวกเขาที่อยู่บนโลกใบนี้นี่แหละ "
        l " อย่างที่ฉันพูดไปก่อนหน้านี้ เมื่อราวๆ ศตวรรษที่17ในตอนที่พวกเราถูกค้นพบ ในตอนนั้นฉันยังไม่เกิดมาหรอกนะมีแค่เอลนี่เท่านั้น "
        l " ในตอนนั้นเองที่ชาวประมงคนนั้นสังเกตถึงความผิดปกติของจำนวนของปลาในน้ำที่ลดน้อยลง แถมยังพบว่าช่วงท้ายปีที่ควรจะหนาวจู่ๆ ก็ฝนตก "
        l " ก็เลยสัญนิษฐานกันว่าเป็นปรากฏการณ์เหนือธรรมชาติในวันที่พระเยซูประสูติน่ะ และเขาถูกตั้งชื่อในฐานะ เอญนีโญ ที่แปลว่าเด็กชายในภาษาสเปนด้วยล่ะ "
        l " แต่ฉันเชื่อว่าในเหล่ามนุษย์อย่างพวกเธอในยุคนี้ที่มีความรู้ด้านนี้คงต้องรู้แล้วล่ะว่าพวกเราไม่ใช่เหตุการณ์เหนือธรรมชาติน่ะ "
        l " หลังจากนั้นผ่านมาจนศตวรรษที่20 ฉันก็เกิดมาพร้อมกับตั้งชื่อว่า ลานีญา ที่แปลว่าเด็กสาวในสเปนตามพี่ชาย "
        l " ในตอนที่ฉันนรู้สึกตัวฉันแทบไม่รู้อะไรเกี่ยวกับตัวเองเลย ก็ได้เอลนี่นี่แหละช่วยเอาไว้ "
        l " พวกเราสองพี่น้องอยู่ด้วยกันที่ชายหาดมาเป็นปีๆ ได้เจอผู้คมากมาย รวมถึงเธอด้วยนะเบ็ก "
        l " จนก่อนที่เธอจะไป เอลนี่ก็ไม่ได้อาการแย่ขนาดนี้หรอกนะ แต่ตั้งแต่ที่พ่อของเธอเสียไป เขาก็อาการแย่ลงมากๆ เลยล่ะ "
        l " โดยปกติพี่ชายกับฉันจะพลัดกันทำหน้าที่น่ะ พี่ชายฉันหรือเอลนีโญจะคอยทำหน้าที่นำลมอ่อนๆ พัดจากที่นี่ไปแถบเอเชียน่ะ"
        l " ปกติแล้วเอลนี่จะไม่ทำอันตรายต่อสภาพแวดล้อมโดยรอบมากหรอก แต่เมื่อราวๆ 20ปีที่ผ่านมานี้อาการของพวกเราดูแย่ขึ้นมากๆ เลย "
        l " ขนาดฉันเองก็ยังแทบจะคุมตัวเองไม่ไหวเลยนะ ส่วนเอลนี่ก็เริ่มควบคุมตัวเองไม่อยู่ "
        l " เขาเริ่มไม่ได้ยินเสียงรอบข้างหรือว่าเสียงฉัน บางทีก็ทำลายข้าวของไปทั่ว อย่างเลวร้ายที่สุดคือเขาแยกไม่ออกว่าฉันเป็นน้องสาวของเขา "    #Elny struggle Lany with his hand
        l " ตอนที่พี่เขาได้สติขึ้นมาอีกทีตอนนั้นพี่ก็พยายามไล่ฉัให้ออกไปห่างๆ เพราะเขากลัวว่าตัวเองจะทำร้ายฉันขึ้นมา "
        l " ฉันเองก็พยายามเขาแล้ว เพราะร่างกายของฉันฉันเลยไม่มีทางตายได้อยู่แล้ว แต่เขาก็เลือกที่จะจากฉันไป "
        l " เป็นคนที่หัวรั้นมากเลยเนอะ.... "
        
        " เมื่อนึกถึงพฤติกรรมปากไม่ตรงกับใจแถมยังหัวดื้อของเอลนี่ ลานี่ถอนหายใจ "
        l " ในเมื่อเธอรู้เรื่องทั้งหมดแล้ว ก๋ถึงเวลาที่เธอต้องกลับไปแล้วล่ะเบ็ก ฉันน่ะว่าไปอย่างแต่เธอน่ะเป็นแค่มนุษย์นะ "
        l " ฉันจะไม่ยอมให้เธอได้ไปเจอเอลนนี่หรอก รีบกลับไปแล้วก็อย่าได้กลับมาที่นี่อีก ลืมเรื่องพวกเราไปซะ "   

 