define f = Character("คุณพ่อ", color="#000000")
define b = Character("เบ็ก", color="#000000")
define e = Character("เอลนี่", color="#a54848")
define l = Character("ลานี่", color="#30a8b8")
define el = Character("ลานี่ & เอลนี่", color="#9a26a5")
define c = Character("คนขับรถ", color="#000000")
define j = Character("ผู้ประกาศข่าว", color="#000000")
define d = Character("ดิเอโก้", color="#000000")
define a = Character("เบลนด้า", color="#1d1a4b")
define r = Character("ร้อดดิโก้", color="#331a1a")
define w = Character("???", color="#000000")
define m = Character("เสียงในใจ", color="#474747")
define p = Character("หมอ", color="#474747")

transform grayed:
  matrixcolor SaturationMatrix(0) * BrightnessMatrix(-0.25)

transform reset_color:
  matrixcolor SaturationMatrix(1) * BrightnessMatrix(0)

transform left:
  xcenter 0.25

transform right:
  xcenter 0.75

transform center:
  xcenter 0.5

label start:
  scene intro
  play music "sea.mp3" fadeout 1 loop
 
  j " สวัสดีครับท่านผู้ฟังทุกท่าน และนี่คือรายการแจ้งฝนฟ้าอากาศ รายการที่จะคอยแจ้งข่าวสารเกี่ยวกับฝนฟ้าอากาศให้คุณทราบอย่างสม่ำเสมอ!"
  j " วันนี้ผมมาอยู่กับผมจอร์ชเช่นเคยนะครับ "
  
  scene intro2
  j " ในวันนี้มีรายงานด่วนจากทีมงานที่พึ่งลงพื้นที่ไปเมื่อหลายวันก่อน ทีมงานพบว่าสภาพอากาศบริเวณชายฝั่งไม่ค่อยสู้ดีนัก "
  j " ระดับน้ำรอบชายฝั่งPaitaกำลังสูงขึ้นอย่างต่อเนื่อง และคาดว่าจะเพิ่มขึ้นเรื่อยๆ จนถึงสิ้นปีส่งผลให้บ้านเรือนเสียหายไปหลายหลัง "
  j " แนะนำให้ผู้อาศัยทุกท่านรีบอพยพโดยด่วน เพื่อความปลอดภัยของชาวเมืองทุกท่าน "
  j " ย้ำ! ขอให้ผู้อาศัยทุกท่านรีบอพยพโดยด่วน "

  scene introb
  show son with dissolve
  " เสียงวิทยุทำให้ทุกอย่างหยุดลง ตัวคุณที่เป็นเด็กไม่รู้ประสีประสามองผู้เป็นพ่อที่นิ่งไป หลังจากที่ได้ยินเสียงจากวิทยุด้วยแววตาสับสน "
  f " เราเองก็คงจะทำงานนี้ต่อไปได้อีกไม่นานแล้วสินะ ถ้าสถานการณ์ยังแย่แบบนี้ต่อไปคงต้องขนของเร็วกว่าที่คิด "

  scene 2father
  with dissolve
  scene 3father with dissolve
  scene 2father 
  with dissolve
  " คุณได้ยินเสียงถอนหายใจ น้ำเสียงของคุณพ่อดูเหนื่อยๆ เล็กน้อย "
  f " เบ็ก ทำไมลูกไม่ไปเล่นสักหน่อยล่ะ พวกเพื่อนๆ กำลังรออยู่ไม่ใช่เหรอ"

  scene who
  with dissolve
  " คำพูดของคุณพ่อทำให้ถึงเพื่อนทั้งสองคนที่คุณได้เป็นเพื่อนกันที่ชายหาด "

  scene beachdayblur 
  with dissolve
  show run with dissolve
  " คุณพยักหน้าและเห็นด้วย และวิ่งไปที่สถานนัดพบที่พวกคุณทั้งสามคนได้นัดกันไว้ "

  scene who
  with dissolve
  " คุณวิ่งมาสักพัก ผ่านชายหาดผ่านเรือประมงมากมาย จนรู้สึกว่าขาของคุณเริ่มล้า "
  " ในจังหวะที่คุณรู้สึกอ่อนแรงและกำลังจะล้ม ก็มีมือคู่นึงมาคว้าคุณเอาไว้ มือคู่นั้นเป็นของ... "

 
  menu:

        "คนซ้าย":
            jump Elny

        "คนขวา":
            jump Lany

  label Elny:

        scene beachday
        show  fall down1
        " ปรากฏว่าเจ้าของมือหนาที่จับคุณไว้ก็คือ เอลนี่ คุณได้ยินคนตรงหน้าบ่นกับตัวเองเบาๆ ถึงความซุ่มซ่ามของคุณ "
        e " ซุ่มซ่ามจริงๆ "

        show fall down2

        " แม้คำพูดจะดูใจร้ายไปหน่อยแต่จริงๆ แล้วเอลนี่ก็เป็นคนที่ใจดีมากไม่ต่างจากผู้เป็นน้องสาว "
        " เสียอย่างเพียงอย่างเดียวก็คือการที่เจ้าตัวใช้คำพูดไม่เก่งและขี้อายไปเสียหน่อย "

        e " จะให้จับอีกนานมั้ยเนี่ย เห็นมั้ยว่ามันเมื่อย "

        e " ......... "
        
        show  fall down3

        e " ดูจากสีหน้าแล้วน่าจะยังสบายดีนี่ งั้นก็เลิกเหม่อแล้วรีบลุกขึ้นมาได้ละ "

        jump continue

  label Lany:

        scene beachday
        show lfall down1

        " เมื่อคุณลืมตาขึ้นมา พบว่าตัวเองไม่ได้ล้มไปกับพื้น เพราะ ลานี่ จับมือคุณเอาไว้ได้ทัน ในขณะที่เธอก็พยายามสังเกตไปด้วยว่าคุณบาดเจ็บตรงไหนรึเปล่า "
        l " เป็นอะไรรึเปล่าคะ บาดเจ็บตรงไหนรึเปล่า ลุกขึ้นไหวมั้ย "
        l " .......คือว่า"

        " คุณจ้องมองใบหน้าของเด็กสาวอย่างลืมตัว เพราะเธอจับมือคุณไว้ ใบหน้าของพวกคุณจึงไม่ได้ห่างกันมากนัก "
        " ดวงตาของเธอประดับไว้ด้วยความกังวลและมันก็เป็นแบบนี้ตั้งแต่ครั้งแรกที่ลานี่กับเด็กชายได้พบกัน "
        show lfall down2

        l " ..... "

        

        " เมื่อเด็กชายเริ่มสังเกตสีหน้ากระอั่กกระอ่วนของลานี่ได้เพราะเขาไม่รีบลุกขึ้น ทำให้เด็กชายรู้ตัวว่าเขาเผลอจ้องหน้าเธอนานเกินไปจนได้ "

        show lfall down3
        l " อ๊า ลุกขึ้นได้แล้วสินะคะ ดีแล้วละค่ะ "

        jump continue

  label continue:

        scene who1
        with dissolve

        " หลังจากคุณลุกยืนขึ้น ร่างของคนสองคนที่คุ้นเคยก็ปรากฏขึ้นตรงหน้าคุณ "
        " คุณกล่าวคำขอบคุณหลังจากที่โดนช่วยเอาไว้ "

        scene beachdayblur
        show elny angry at left 
        show lany at right, grayed
        e " วันหลังจะไปไหนก็หัดดูทางหน่อยสิ "

        show elny sigh at grayed
        show lany smile at reset_color
        l " ต้องระวังไม่ให้บาดเจ็บ ไม่งั้นเดี๋ยวจะเป็นแผลเป็นเอาได้นะคะ "

        show elny angry at reset_color
        show lany sigh at grayed
        e " ก็ตามที่ลานี่บอก ถ้าเป็นอะไรไปจะทำยังไงฮะ จำไม่ได้รึไงว่าครั้งล่าสุดที่เธอล้มน่ะเธอร้องไห้หนักแค่ไหน??" #elny angry and lany sigh at grayed
        b " อะไรเล่า! เมื่อกี้ก็ไม่ได้ล้มสักหน่อยนี่เอลนี่ขี้บ่น " #elnny angry and lany sigh, both at grayed

        show elny angry at reset_color
        e " นี่! " #elny angry at reset_color
        b " แบร่!! "

        show elny sigh 
        e " เฮ้อ.. เพราะงี้ยังไงล่ะ ฉันถึงได้ไม่ชอบพวกเด็กๆ " #elny sigh

        show elny sigh2 at grayed
        show lany sigh at reset_color
        l " อ.. เอลนี่ อย่าพูดแบบนั้นกับเด็กๆ สิ " #elny sigh2 at grayed and lany sigh at reset_color

        show lany smile
        l " เอาเป็นว่าไม่เจ็บตัวก็ดีแล้วล่ะ เพราะงั้นใจเย็นก่อนนะทั้งสองคน " #elny sigh2 at grayed and lany smile

        show elny sigh2 at reset_color
        show lany smile at grayed
        e " ..... " #elny sigh2 at reset_color and lany smile at grayed

        show elny
        e " เพราะลานี่หรอกนะ ฉันถึงใจเย็นลงน่ะ " #elny and lany smile

        show elny at grayed
        show lany smile at reset_color
        l " แล้วทำไมวันนี้ถึงรีบมาขนาดนี้ละค่ะ ปกติเธอจะมาหาพวกเราช้ากว่านี้นี่นา " #elny at grayed and lany smile at reset_color

        show elny at reset_color
        show lany smile at grayed
        e " นั่นสิ ขอฉันฟังเหตุผลหน่อยว่าอะไรทำให้เธอต้องรีบวิ่งมาขนาดนี้ " #elny at reset_color and lany smile at grayed

        show elny at grayed
        " คุณมองทั้งสองคนก่อนจะเริ่มเล่าสิ่งที่ตัวเองได้ยินมาจากวิทยุ " #elny at grayed and lany smile 


        scene beachdayblur
        #(only)elny sigh2 at center, reset_color 

        show elny sigh2 at center, reset_color 
        with dissolve
        e " ..... "
        e " เข้าใจล่ะ ว่าทำไมตาแก่นั่นถึงอยากให้เธอรีบมาหาพวกเรา "
        e " เธอ.."
        
        show elny sigh3
        e " ต้องย้ายบ้านเร็วๆ นี้แล้วไงล่ะ " #(only)elny sigh3 

        show elny sigh2 
        b " ม.. หมายความว่ายังไงน่ะ เอลนี่พูดเรื่องอะไรอยู่เหรอ " #(only)elny sigh2 at grayed

        show elny sigh3 
        e " ตาแก่นั่นคงอยากให้เธออยู่กับพวกเรามากๆ จะได้สร้างความทรงจำดีๆ ก่อนจากกัน " #(only)elny sigh3 at reset_color
        e " แต่พูดไปเด็กอย่างเธอก็ไม่เข้าใจหรอก สรุปสั้นๆ ก็คือถ้าเขาไม่ย้ายออกไปเร็วๆ นี้ตัวเธอเองรวมถึงครอบครัวคงไม่รอดแน่ " 

        show elny sigh4 
        b " ไม่เห็นจะเข้าใจเลย! ทำไมฉันต้องย้ายออกไปด้วยล่ะ แล้วทั้งสองคนจะตามมาด้วยรึเปล่า " #(only)elny sigh3 at grayed

        show elny sigh3 
        e " พวกฉันไปไหนไม่ได้หรอกนะ " #(only)elny sigh3 at reset_color
        
        show elny sigh 
        b " ทำไมย้ายไม่ได้ล่ะ! " #(only)elny sigh at grayed

        show elny angry 
        e " เป็นเด็กแท้ๆ อย่าถามมากจะได้มั้ย ถ้าฉันพูดไปแล้วคิดว่าตัวเองจะเข้าใจรึไง " #(only)elny angry, reset_color

        scene beachdayblur 

        show elny angry at center
        b " ก็ต้องเข้าใจสิ เพราะพวกเราเป็นเพื่อนกันนี่นา! " #elny sigh3 at left and lany shock at right
      
        scene beachdayblur
        show elny sigh3 at left
        show lany sigh at right
        el " ......" #elny sigh2 and lany sigh at grayed

        show elny sigh3 
        show lany sigh at grayed
        e " เอาเป็นว่าพวกเราก็มีเหตุผลของพวกเราแหละน่า " #elny sigh3 and lany sigh at grayed

        show elny sigh2 at grayed
        show lany sigh at reset_color
        l " เพราะงั้นอยากให้เข้าใจแล้วก็อย่าโกธรพวกเราเลยนะคะ " #elny sigh3 at grayed and lany sigh at reset_color

        b " ....... "

        scene beachdayblur

        show elny at center
        e " ที่นี้ก็เข้าใจแล้วใช่มั้ย เอาล่ะ จากนี้จะขอแนะนำในฐานะเพื่อนละกันนะ " #(only)elny at reset_color with dissolve
        e " ถ้าการคาดการณ์ของฉันไม่ผิด อีกไม่นานน้ำจะสูงขึ้น และในอีกไม่กี่วันที่นี่จะกลายเป็นทะเลด้วยแน่นอน "
        e " เพราะงั้นหลังจากวันนี้ก็เชื่อฟังที่ตาแก่พูดแล้วอย่ามาที่นี่อีก เข้าใจมั้ย.."
        b " ....ไม่เห็นจะเข้าใจเลย " 

        show elny angry
        e " เห็นมั้ยล่ะ! เพราะงั้นตั้งแต่พรุ่งนี้เป็นต้นไปก็อยู่ที่บ้านและอย่ามาที่ทะเล เพราะมันอันตราย เข้าใจมั้ย! " #(only)elny angry
        b " อะไรเนี่ย ทำไมต้องปิดบังกันด้วยเล่า! ทั้งสองคนไม่เห็นจะอธิบายอะไรเลย! ก็ได้! จะไม่มาที่ชายหาดอีกแล้ว "
        b " เอลนี่ใจร้าย! เอลนี่ขี้งก! "
        
        show elny sigh2 
        " เบ็กวิ่งออกไปและไม่หันกลับมามองทั้งคู่อีก โดยที่ไม่รู้เลยว่าใบหน้าของทั้งคู่ประดับความเศร้าสร้อยไว้หลังจากที่เด็กชายวิ่งหนีไปแล้ว " #(only)elny sigh2
        " หลังจากแผ่นหลังเด็กชายห่างไปไกล ลานี่ก็ได้เอ่ยถามพี่ชาย "

        l " จะดีเหรอเอลนี่ ไม่อธิบายอะไรให้เด็กคนนั้นฟังน่ะ แล้วก็เรื่องตัวตนของพวกเรา..."
        show elny sigh3
        e " ช่างเถอะลานี่ ให้เด็กนั่นคิดไปแบบนั้น ดีแล้วล่ะ " #(only)elny sigh3

        play music "dream.mp3" fadeout 1 loop
        scene bs
        with dissolve

        b " ลานี่.. เอลนี่.."
        b " ทั้งสองคน....."
        " ....... "
        " ........... "

        scene bs
        with dissolve
        with hpunch

        b " เหวอ!! "


        scene bedroomday
        play music "morning.mp3" fadeout 1 loop
        
        show wake 1 at center
        b " อูย เจ็บๆ อะไรเนี่ย ฝันหรอกเหรอ.. เพราะจะได้กลับไปที่บ้านเกิดรึเปล่านะก็เลยฝันถึงสองคนนั้นอีก " #wake 1 at center 

        show wake 3
        b " นี่มันก็ผ่านมา20ปีได้แล้วสินะ หลังจากที่เรากับญาติย้ายมาตอนนั้น " #wake 3
        b " พ่อเองก็เสียไประหว่างนั้นแล้วด้วย จากเหตุการณ์เอลนีโญเมื่อ20ปีก่อน ทำไมพ่อถึงไม่ย้ายออกมาพร้อมกับเรากันนะ " 

        show wake 4
        b " อาชีพชาวประมงมีอะไรสำคัญนักหนาถึงกับต้องสละชีวิตเพื่อมันด้วย.. " #wake 4

        show wake 2
        b " แต่เดี๋ยว.. แดดแยงตาขนาดนี้นี่มันกี่โมงแล้วเนี่ย! " #wake 2
        b " ...... " 

        show wake 1
        b " 11 โมง!! ไม่ได้การแล้ว ต้องรีบไปแล้วก่อนที่จะไม่ทันรถ!! " #wake 1

        scene bs
        with dissolve

        scene cityday
        with dissolve
        play music "city.mp3" fadeout 1 loop

        show wait 1 at center
        b " โอย ให้ตายเถอะคนเยอะชะมัด.. จะมีรถบ้างมั้ยนะเวลาป่านนี้แล้ว " #wait 1 at center
        b " คือว่า ขอโทษนะครับ พอจะไปส่งผมที่หาดPaitaได้มั้ยครับ "

        scene cityday

        show driver 3 at right
        show wait 1 at left, grayed
        c " อะไรนะ หาดPaita? หนุ่มๆ แบบนี้มีธุระอะไรถึงต้องไปที่นั่นล่ะ " #driver 3 at right and wait 1 at left, grayed

        show driver at grayed
        show wait 2 at reset_color
        b " ถ้าให้พูดก็คงยาวน่ะครับ พอดีไม่ได้กลับไปนานแล้วเลยจะกลับไปเยี่ยมหลุมศพของพ่อหน่อยนะครับ " #driver 3 at grayed and wait 2 at reset_color

        show driver 2 at reset_color
        show wait 2 at grayed
        c " อย่างงั้นเหรอ อย่าบอกนะว่า พ่อหนุ่มก็เป็นคนที่ต้องหนีจากเหตุการณ์น้ำท่วมจากเอลนีโญเมื่อ20ปีก่อนเหมือนกันเรอะ " #driver 2 at reset_color and wait 2 at grayed

        show driver 2 at grayed
        show wait 2 at reset_color
        b " จะพูดอย่างนั้นก็ได้แหละครับ ผมเองตั้งแต่ย้ายบ้านไปก็ไม่ได้กลับไปอีกเลยน่ะครับ " #driver 2 at grayed and wait 2 at reset_color
        
        show driver 1 at reset_color
        show wait 3 at grayed
        c " คนบ้านเดียวกันนี่เอง! งั้นก็ขึ้นมาสิ เดี๋ยวลุงจะพาไปส่งให้รวดเดียวถึงเลย " #driver 1 at reset_color and wait 3 at grayed

        scene bus
        play music "car.mp3" fadeout 1 loop

        
        " มันก็นานมาแล้วตั้งแต่ที่คุณจะได้เดินทางกลับบ้าน ครั้งล่าสุดที่คุณได้กลิ่นของทะเลเห็นจะเป็นเมื่อ20ปีก่อน "
        " คุณนั่งบนรถบัสเงียบๆ เพียงลำพังเพราะเวลานี้ไม่ใช่เวลารถวิ่ง แต่ลุงคนขับก็ยังอาสาไปส่งทั้งๆ ที่คุณมาสายขนาดนี้ "
        " คงเป็นเพราะว่าคุณเคยมาจากที่ชายหาดนั่นละมั้ง "

        scene bs
        with dissolve
        play music "dream.mp3" fadeout 1 loop


        " คุณหลับตาลง นึกถึงช่วงเวลาดีๆ ที่เคยมีในสมัยยังเป็นเด็ก "
        " ทันใดนั้นใบหน้าของคนสองคนก็พุดขึ้นมาในใจ "

        scene who2
        " สิ่งที่จำได้มีเพียงแค่ชื่อและใบหน้าอันแสนเรือนราง "
        " เป้าหมายอีกอย่างในการกลับไปบ้านเกิดในครั้งนี้ คือการตามหาเพื่อนสมัยเด็กของตัวเองอีกครั้ง.. "
        " เพราะคุณยังจำได้ดีว่าก่อนจากมาคุณพูดแย่ๆ ใส่พวกเขาไป ทั้งๆ ที่พวกเขาทำไปทั้งหมดก็เพราะเป็นห่วง "

        b " สองคนนั้นแค่เตือนเราเท่านั้นเอง เราที่เป็นเด็กแต่ไปว่าเขาแบบนั้น "
        b " แย่ที่สุดเลย.."

        scene bs
        with dissolve

        c " เอ้า ถึงแล้วล่ะไอ้หนุ่ม! ตื่นได้แล้วๆ "

        scene arrival
        play music "sea.mp3" fadeout 1 loop

        " คุณลืมตาขึ้นมาก็พบว่าคุณมาถึงชายหาดเป็นที่เรียบร้อย "
        " คุณรีบลงมาจากรถ ก่อนจะเจอแสงแดดยามบ่ายกระทบเข้ากับร่างกาย "

        c " ลุงต้องไปแล้วล่ะไอ้หนุ่ม เพราะอีกเดี๋ยวก็ต้องกลับไปทำงานแล้ว "
        c " ทะเลที่นี่ไม่ได้เปลี่ยนไปเลย ขอเที่ยวให้สนุกล่ะ! "

        " ..... "
        scene beachday
        with fade

        " เป็นไปตามที่คุณลุงคนขับรถพูด ทุกอย่างยังคงเหมือนเดิม ชายหาดไม่เคยเปลี่ยนไปเลย "
        " คุณใช้สายตาทอดมองออกไปเรื่อยๆ หวังจะเก็บบรรยากาศระลึกถึงความหลังเท่าที่ทำได้ "
        " หางตาของคุณก็เหลือบไปเห็นใครบางคนเข้า "

        show lanyb dark at center
        " ด้วยส่วนสูงที่คุ้นเคยและการแต่งกายที่ชวนให้รู้สึกคิดถึงอย่างบอกไม่ถูก "
        " คุณตัดสินใจที่จะลองหันไปหาคนๆ นั้น และแล้วร่างคนที่คุ้นเคยก็ปรากฏสู่สายของคุณ "

        show lanyb 1 with dissolve
        b " ลานี่.. "

        show lanyb 2 
        l " เบ็ก? นั่นเบ็กเหรอ.."

        " เป็นเธอจริงๆ คุณไม่ได้ดูผิดจริงๆ ด้วย! "

        b " ลานี่! ใช่ลานี่จริงๆ ด้วยดีใจจังที่ได้เจอกันอีก ตอนนั้นก่อนที่จะย้ายออกไป ขอโทษนะที่พูดไม่ดีใส่น่ะ " 

        show lanyb 3
        l " ไม่เป็นไรหรอกจ้ะ ตอนนั้นเธอก็ยังเด็กด้วยนี่นา พวกเราไม่โกธรหรอกนะที่เธอจะทำตัวแบบนั้นน่ะ "
        b " ช่วงนี้เป็นยังไงบ้างเหรอ ว่าแต่ลานี่ ทำไมเธอดูแทบไม่เปลี่ยนไปเลยล่ะ ฉันรู้สึกว่าเธอไม่ได้สูงขึ้นเลยนะ "
        b " แล้วก็ทำไมเธอถึงดู.. เศร้าๆ ล่ะลานี่ มีอะไรรึเปล่า "

        show lanyb cry2
        l " ไม่มีอะไรหรอก ก็แค่ฉันดีใจที่ได้เจอเธอน่ะเบ็ก แล้วก็จริงๆ แล้วที่ร่างกายฉันไม่ได้เปลี่ยนไปเลยมันมีเหตุผลอยู่ล่ะ "
        l " ฉันรู้อยู่แล้วว่าสุดท้ายยังไงก็ต้องได้พูดเรื่องนี้สักวัน "
        l " ฉันกับพี่ชายฉันไม่ได้ตั้งใจจะปิดบังเธอเลยนะเบ็ก จริงๆ แล้วพวกเราไม่ได้เป็นมนุษย์หรอกนะ "

        show lanyb cry3
        l " ความจริงก็คือ พวกเราเป็นปรากฏการณ์ทางสมุทรศาสตร์ที่จำแลงกายมาต่างหากล่ะ.. "
        
        " คุณมองหน้าลานี่เหมือนว่าเธอเป็นบ้าไปแล้ว ซึ่งหญิงสาวก็ไม่ได้โกธรอะไร "
        " เพราะนั่นก็ควรจะเป็นรีแอคชั่นปกติที่มนุษย์ควรจะมีให้สิ่งเหนือธรรมชาติอย่างพวกเธอจริงๆ นั่นแหละ "
        b " ลานี่ตลกจังพูดอะไรกันเนี่ย- "
        l " ฉันขอโทษนะที่จู่ๆ ก็พูดอะไรแปลกๆ แต่ฉันที่ฉันพูดไม่ใช่เรื่องโกหกหรอกนะ ฉันจะแสดงให้เธอดูเองว่าฉันไม่ใช่มนุษย์ "

        " ทันทีที่ลานี่พูดจบ หญิงสาวเดินตรงไปที่ทะเลจนน้ำทะเลสูงถึงหัวเข่าก่อนจะตวัดมือของตัวเองขึ้น
        คล้ายกับกำลังเต้นรำ เบ็กรู้สึกตกตะลึงกว่าเดิมเมื่อเห็น " #cutscene ลานี่เต้นตรงน้ำ โดยที่มีเบ็กมองอยู่ไกลๆ
        " ไม่ใช่เพราะว่าจู่ๆ หญิงสาวก็เริ่มเต้นรำ แต่เป็นเพราะว่าหญิงสาวกำลังเต้นรำไปพร้อมกับสายน้ำราวกับเธอเป็นหนึ่งเดียวกับมัน "
        
        b " เธอ...ควบคุมน้ำได้?? "
        " แม้จะรู้สึกกลัวแต่เบ็กก็กลั้นใจถามอีกฝ่ายออกไป "

        l " อื้ม ในตอนที่พวกเราเกิดมา รู้สึกตัวอีกทีก็ทำแบบนี้ได้แล้วล่ะ "
        l " พวกเราก็ไม่รู้ด้วยซ้ำว่าทำไมพวกเราถึงต้องเกิดมา สิ่งเดียวที่พวกเรารู้ก็คือพวกเรามีหน้าที่ที่ต้องทำ " #ซูมไปที่ลานี่ที่กำลังเล่นกับน้ำที่เป็นรูปร่างปลาบนมือ

        " ถึงคุณจะไม่อยากเชื่อแต่จะให้ทำยังไงได้อีก ในเมื่อความจริงมาประเคนตรงหน้าแบบนี้ " #ตัดกลับมาที่เบ็กที่เหงื่อตก #เบ็ก at righht with lany at left
        b " ฉันงงไปหมดแล้วลานี่ คือนี่มันอย่างกับอยู่ในหนังรึการ์ตูนเลย "
        b " ไม่ได้ล้อเล่นจริงๆ ด้วยสินะ "
        l " ถ้าเธออยากลองจับ จะลงมาในน้ำก็ได้นะ "
        b " ม ไม่เป็นไร ขอบใจนะ "

        " คุณปฎิเสธเธอไปตรงๆ ก่อนจะสังเกตได้ว่าเอลนี่ไม่ได้อยู่ด้วย "
        b " จะว่าไปตอนนี้เอลนี่เป็นยังไงบ้างเหรอลานี่ "
        l " ....... "
        " สีหน้าของลานี่ซีดลง เธอจับมือของคุณให้มานั่งที่โคดหินใกล้ๆ ก่อนจะเริ่มพูดอีกครั้ง "
        
        l " เอลนี่เขาแยกตัวไปอยู่คนเดียวแล้วน่ะ ตั้งแต่เมื่อปีก่อนที่เหตุการณ์ เอลนีโญ เกิดขึ้นที่นี่ "
        b " เอลนีโญ? "
        l " จริงสิ ฉันลืมบอกชื่อเต็มของพวกเราไปเลย "

        scene lany and elny with their formal outfit iow original outfit
        l " ชื่อเต็มของฉันคือลานีญา และพี่ชายของฉันเอลนีโญ พวกเราก็คือปรากฏการณ์ทางสมุทรศาสตร์ที่กำลังเกิดขึ้นในประเทศนี้ยังไงล่ะ "
        b " ได้ยังไงล่ะลานี่ แล้วลานี่ที่ฉันเห็นตรงหน้าคืออะไรกันล่ะ "
        l " ฉันก็ไม่รู้เหมือนกัน แต่สิ่งที่เกิดขึ้นอยู่นี่ก็คือพวกเราจริงๆ เพียงแต่ตั้งแต่ศตวรรษที่17ที่พวกเราถูกค้นพบโดยชาวเปรูว่า
        พวกเราคือสาเหตุของการเปลี่ยนแปลงอย่างผิดปกติในทะเล พวกเราก็มีร่างกายและจิตสำนึกขึ้นมาแล้วล่ะ "

        l " ฉันกับพี่ชายมีร่างกายที่เป็นอมตะ ไม่รู้สึกหิวและไม่มีวันแก่ แถมพวกเราก็ออกห่างจากทะเลไม่ได้ด้วย "
        b " งั้นแสดงว่าที่พวกเธอไม่ย้ายบ้านไปกับฉันตอนนั้นก็.... "
        l " ใช่ ไม่ใช่ว่าพวกฉันไม่อยากตามเธอไปนะเบ็ก แต่พวกเราไปไม่ได้ต่างหาก "
        b " ลานี่... "
        l " อย่าทำหน้าเศร้าสิเบ็ก มันไม่ใช่ความผิดเธอหรอกนะ ก็ตอนนั้นพวกเราเลือกที่จะไม่อธิบายเองนี่นา "
        l " พวกฉันเป็นปรากฏการณ์ที่ไม่มีที่มาแถมยังสร้างปัญหาไว้ตั้งมากมายขนาดนี้อีก เป็นตัวตนที่ไร้ประโยชน์
        เพราะงั้นตอนนั้นเอลนี่เลยเลือกที่จะเก็บไว้เป็นความลับจากเธอยังไงล่ะ "

        b " แต่เธอก็ไม่ได้อยากให้มันเป็นแบบนี้นี่! พวกเธอไม่ได้อยากทำร้ายใครสักหน่อย "
        l " ..... "
        b " ถึงพวกเธอจะไม่ใช่มนุษย์ แต่ตอนนี้เธอก็มีร่างกายแล้วก็มีความรู้สึกนึกคิดเป็นของตัวเองนี่?! "
        b " ถ้าเลือกได้พวกเธอก็คงไม่ได้อยากทำร้ายโลกใบนี้แล้วก็ใช้ชีวิตเหมือนคนทั่วไป เพราะงั้น- "
        b " อย่าพูดเหมือนกับว่าตัวเองไม่ควรเกิดมาจะได้มั้ยเล่า "

        #maybe elny sudenly appear cuz he sense beck has come back from far away. then they begin to argue while lany try to protect beck from her brother. elny just live at the beach but far away from his sister.
        
        l " ขอบคุณนะเบ็กที่พูดแบบนั้นน่ะ ฉันขอบคุณมากจริงๆ ที่พยายามเข้าพวกเรานะ
        แต่ฉันก็ไม่อยากให้เธอต้องมายุ่งเกี่ยวกับพวกเราไปมากกว่านี้แล้วล่ะ "

        b " หมายความว่ายังไงน่ะลานี่ "
        l " ฉันคิดมาสักพักแล้วล่ะตั้งแต่ที่เธอจากไป ตั้งแต่ที่เอลนี่เปลี่ยนไป เบ็ก รู้รึเปล่าว่าตอนนี้เขาเป็นยังไงบ้าง "
        l " จริงสิ ฉันพูดอะไรไปเนี่ยเธอจะไปรู้ได้ยังไง งั้นฉันจะอธิบายให้เธอฟังเองว่าตอนนั้นมันเกิดอะไรขึ้น..."

        #flashback come in
        #So many fuckin cutscene
        l " เธอรู้อยู่แล้วใช่มั้ย ว่าโลกนี้มีสิ่งที่เรียกว่าวัฏจักรของสภาพอากาศ เดิมที่ก็มีแค่พวกเขาที่อยู่บนโลกใบนี้นี่แหละ "

        l " อย่างที่ฉันพูดไปก่อนหน้านี้ เมื่อราวๆ ศตวรรษที่17ในตอนที่พวกเราถูกค้นพบ ในตอนนั้นฉันยังไม่เกิดมาหรอกนะมีแค่เอลนี่เท่านั้น "
        l " ในตอนนั้นเองที่ชาวประมงคนนั้นสังเกตถึงความผิดปกติของจำนวนของปลาในน้ำที่ลดน้อยลง แถมยังพบว่าช่วงท้ายปีที่ควรจะหนาวจู่ๆ ก็ฝนตก "
        l " ก็เลยสัญนิษฐานกันว่าเป็นปรากฏการณ์เหนือธรรมชาติในวันที่พระเยซูประสูติน่ะ
        จากนั้นเขาก็ถูกตั้งชื่อว่า เอญนีโญ ที่แปลว่าเด็กชายในภาษาสเปนด้วยล่ะ "

        l " แต่ฉันเชื่อว่าในเหล่ามนุษย์อย่างพวกเธอในยุคนี้ที่มีความรู้ด้านนี้คงต้องรู้แล้วล่ะว่าพวกเราไม่ใช่เหตุการณ์เหนือธรรมชาติน่ะ "

        l " หลังจากนั้นผ่านมาจนศตวรรษที่20 ตอนนั้นที่ฉันก็เกิดมาสภาพอากาศตอนนั้นแย่ลงมาก เปรูไม่มีฝนตกเลยแถมพื้นดินก็เริ่มแห้งแล้ง 
        พวกเราเลยรู้ว่าฉันคือปรากฏการณืตรงกับข้ามกับพี่ชายของฉันก็เลยตั้งชื่อฉันว่า ลานีญา ที่แปลว่าเด็กสาวในสเปนตามพี่ชาย "

        l " ในตอนที่ฉันรู้สึกตัวฉันแทบไม่รู้อะไรเกี่ยวกับตัวเองเลย ก็ได้เอลนี่นี่แหละช่วยเอาไว้ "
        l " พวกเราสองพี่น้องอยู่ด้วยกันที่ชายหาดมาเป็นปีๆ ได้เจอผู้คมากมาย รวมถึงเธอด้วยนะเบ็ก "
        l " ก่อนหน้านี้เอลนี่ก็ไม่ได้อาการแย่ขนาดนี้หรอกนะ แต่ตั้งแต่ที่พ่อของเธอเสียไป เขาก็อาการแย่ลงมากๆ เลยล่ะ "
        l " โดยปกติพี่ชายกับฉันจะพลัดกันทำหน้าที่น่ะ พี่ชายฉันหรือเอลนีโญจะคอยทำหน้าที่นำลมอ่อนๆ
        พัดจากที่นี่ไปแถบเอเชียแต่ว่าเพราะลมแรงไม่พอเลยพัดลมอุ่นๆ เข้าฝั่งแทน "
        l " ในช่วงนั้นน้ำก็จะอุ่นขึ้นมากจนเกิดการระเหยขึ้นไปยังชั้นบรรยากาศจนทำให้ฝนตกมากกว่าเดิมจนเกิดน้ำท่วม 
        ปลาก็ลดน้องลงเพราะในน้ำอุ่นเกินไปจนแพลงตอนไม่สามารถอยู่ได้ "
        l " ส่วนฉันก็จะทำหน้าที่คล้ายๆ พี่ชายล่ะ แต่ฉันแค่จะนำลมแรงเคลี่อนผ่านเปรูไปยังแถบเอเชีย 
        ทำให้ผิวน้ำของเปรูถูกแทนด้วยน้ำเย็นที่ขึ้นมาจากใต้ผิวน้ำอย่างรวดเร็ว กลับกันปลาจะยิ่งเพิ่มจำนวนมากขึ้นเพราะแพลงตอนมีจำนวนมากขึ้นล่ะ "

        l " ปกติแล้วเอลนี่จะไม่ทำอันตรายต่อสภาพแวดล้อมโดยรอบมากหรอก แต่เมื่อราวๆ 10ปีที่ผ่านมานี้อาการของพวกเราดูแย่ขึ้นมากๆ เลย "
        l " ขนาดฉันเองก็ยังแทบจะคุมตัวเองไม่ไหวเลยนะ แต่เอลนี่ควบคุมตัวเองแทบไม่อยู่แล้วล่ะ "
        l " เขาเริ่มไม่ได้ยินเสียงรอบข้างหรือว่าเสียงฉัน บางทีก็ทำลายข้าวของไปทั่ว
        อย่างเลวร้ายที่สุดคือเขาแยกไม่ออกว่าฉันเป็นน้องสาวของเขา "    #Elny struggle Lany with his hand

        l " ตอนที่พี่เขาได้สติขึ้นมาอีกทีตอนนั้นพี่ก็พยายามไล่ฉันให้ออกไปห่างๆ เพราะเขากลัวว่าตัวเองจะทำร้ายฉันขึ้นมา "
        l " ฉันเองก็พยายามคุยกับเขาแล้ว เพราะร่างกายที่เป็นอมตะฉันเลยไม่มีทางตายได้อยู่แล้ว แต่เขาก็เลือกที่จะจากฉันไป "
        l " เป็นคนที่หัวรั้นมากเลยเนอะ.... "
        
        " เมื่อนึกถึงพฤติกรรมปากไม่ตรงกับใจแถมยังหัวดื้อของเอลนี่ ลานี่ถอนหายใจ "

        l " ในเมื่อเธอรู้เรื่องทั้งหมดแล้ว ก็ถึงเวลาที่เธอต้องกลับไปแล้วล่ะเบ็ก ฉันน่ะว่าไปอย่างแต่เธอน่ะเป็นแค่มนุษย์นะ "
        l " ฉันจะไม่ยอมให้เธอได้ไปเจอเอลนี่หรอก รีบกลับไปแล้วก็อย่าได้กลับมาที่นี่อีก ลืมเรื่องพวกเราไปซะ "   
        l " จะให้ฉันทำได้ยังไงละหลังจากที่ฉันรู้ว่าพวกเธอกำลังลำบากมากแค่ไหน?? "
        l " มันไม่สำคัญอีกแล้วเบ็ก ตอนนี้เธอต้องรีบกลับไปนะ เดี๋ยวนี้เลย "

        " สีหน้าอีกฝ่ายดูซีเรียสขึ้นอย่างเห็นได้ชัด คุณสัมผัสได้ว่าจู่ๆ ลานี่ก็ดูร้อนรนขึ้นมามาก คุณพยายามจะอธิบายให้เธอฟัง
        แต่แล้วก็มีเสียงเด็กหนุ่มดังขึ้นจากด่างหลังเด็กสาว มันเป็นเสียงที่คุณยังจำได้ดี "
        " ราวกับว่าคุณพึ่งได้ยินเมื่อวาน "

        e " ....... "
        b " เอลนี่!! ฉันมีเรื่องจะ- "

        " ทันทีที่คุณจะพยายามเดินไปหาเอลนี่ เด็กสาวก็เดินมาขวางทางระหว่างเด็กหนุ่มกับคุณไว้ก่อนจะหันไปหาพี่ชาย "
        " เอลนี่ปรากฏตัวขึ้นในสภาพที่ดูย่ำแย่ แววตาดูหมองลงไปมาก 
        ขอบตาก็ดำคล้ำ ผมกระเซอะกระเซิงดูเหมือนกับไม่ใช่เอลนี่ที่คุนรู้จัก "

        scene elny try to hurt beck while lany try to protect him
        l " หยุดนะเอลนี่ พี่จะทำร้ายเขาไม่ได้นะ!! เขาก็แค่อยากจะช่วยพี่เท่านั้นเอง ?!"
        e " ฉันไม่ต้องการให้ใครช่วยทั้งนั้น ถอยไปซะลานี่ "
        e " ถ้าเจ้าเด็กนั่นอยากจะช่วยฉันนักก็ให้มันมาเจอฉันสิ "

        " ลานี่หน้าซีดตอนที่เอลนี่เดินใกล้เข้ามาอีกก้าว เธอรีบหันกลับมาหาคุณก่อนจะรีบพลักคุณออกไปให้ไกลที่สุดด้วยพลังของเธอ "

        scene bs
        with fade
        " คุณถูกลานี่พลักเข้าอย่างจังจนคุณล้มถลาไปไกล เมื่อลุกขึ้นมาอีกทีก็พบว่าลานี่กับเอลนี่จากไปแล้ว "
        " เย็นวันนั้นเพราะเหตุการณ์เมื่อครู่ทำให้คุณไม่สามารถทนอยู่ที่นี่ต่อไปได้และรีบเรียกรถกลับบ้านของคุณด้วยความกลัว"

        scene bedroomday
        with fade

        " ตั้งแต่เรื่องวันนั้นก็ผ่านมาสองวันได้แล้ว "
        " คุณก็ไม่ได้กลับไปที่ชายหาดอีกเลยตั้งแต่ตอนนั้น คุณไม่สามารถสลัดความกลัวที่มีต่อเอลนี่ได้ 
        แม้คุณอยากจะช่วยเขามากแค่ไหนก็ตาม "
        " คุณพร่ำคิดกับตัวเองตลอดสองวันนี้ว่าเขาควรจะทำตามที่ลานี่บอกหรือจะกลับไปที่ชายหาดนั่นดี? "

        b " ถ้าเกิดว่าได้ออกไปข้างนอกให้สมองแล่นสักหน่อยน่าจะดี.... "

        scene bs
        with fade
        " คุณที่คิดได้แบบนั้นก็ลุกขึ้นไปอาบน้ำก่อนจะเตรียมตัวให้พร้อมออกไปเดินเล่นในเมือง "
        " เมื่อเตรียมตัวเสร็จคุณก็รีบออกไปทันทีโดยที่ไม่ลืมล็อคห้อง "

        scene cityday
        with fade
        " ในเมืองยังสดใสเช่นเคยเหมือนตอน ผู้คนพลุกพล่านและรถมากมายขับผ่าน "
        " คุณตัดสินใจที่จะไปทานข้าวเช้าที่ร้านประจำ ขาของคุณเดินไปอย่างมั่นคง "
        " ไม่นานคุณก็เดินมาถึงร้านประจำ มีสาวเสิร์ฟออกมาต้อนรับและพาคุณไปยังที่นั่งข้างหน้าต่าง
        ที่มีคนนั่งอยู่ก่อนแล้วที่มีที่ว่างเหลืออยู่อีกที่ "
        " เธอกล่าวขอโทษ เพราะตอนนี้ในร้านเป็นเวลาเร่งรีบทำให้ไม่ค่อยมีที่ว่างในร้านมากนัก "
        " คุณบอกปัดสาวเสิร์ฟก่อนจะสั่งเมนูเดิมอย่างที่คุณสั่งประจำ "
        " ตรงหน้าคุณมีชายคนหนึ่งนั่งรับประทานอาหารของเขาเงียบๆ อยู่ก่อนแล้วก่อนคุณจะมานั่งร่วมโต๊ะ 
        เขาขานรับเบาๆ ตอนที่คุณขอร่วมโต๊ะด้วยจนกระทั่งเขาละสายตาจากจาน "
        " และสายตาของคุณกับเขาก็สบเข้าด้วยกัน "

        d " อ้าว นี่มันเจ้าร้อดตัวน้อยนี่! บังเอิญจังเลย "
        b " คุณลุงดิเอโก้ "
        d " ไม่เจอกันตั้ง5ปี เธอดูโตขึ้นอีกแล้วนะ "
        b " ส่วนคุณก็ยังดูหนุ่มเหมือนเคยเลย ว่าแต่ทำไมถึงเรียกผมว่า ร้อด ล่ะ "
        d " อ้อ โทษทีๆ พอดีว่านายหน้าตาเหมือนร้อดดิโก้ พ่อของนายมากๆ เลยน่ะสิก็เลยเผลอเรียกไปแบบนั้นน่ะ "
        d " ว่าแต่เป็นยังไงบ้างล่ะตั้งแต่ที่เธอขอย้ายออกไปเพราะบอกว่าอยากยืนด้วยลำแข้งตัวเอง "
        d " ทั้งๆ ที่จะอยู่บ้านฉันตลอดไปก็ได้แท้ๆ ยังไงพวกเราก็เป็นครอบครัวกันนี่ "
        b " ฮะๆ ไม่ได้หรอกครับดิเอโก้ อีกอย่างผมเองก็โตแล้วด้วยจะมัวแต่ใหุ้ณดูแลได้ยังไงละ "
        d " ยังทำตัวโตเกินไวไม่เปลี่ยนเลยนะ "
        d " แต่เธอที่ปกติจะเป็นแบบนั้นวันนี้สีหน้าเธอดูแย่ลงนะ เป็นอะไรล่ะ นอนไม่พอรึไง "

        " คำพูดของดิเอโก้ทำให้คุณนึกถึงเรื่องของสองพี่น้อง บางทีคุณคงจะคิดมากเกินไปจนเก็บสีหน้าเอาไว้แล้วไม่อยู่จริงๆ "
        
        b " ก็ นิดนึงน่ะ พอดีว่าผมทะเลาะกับเพื่อนมาน่ะ "
        d " เพื่อน? "
        b " อื้ม เป็นเพื่อนสมัยเด็กที่เคยสนิทกันมากๆ เลยน่ะ แต่ดูเหมือนเขาจะไม่อยากคุยกับผมแล้ว "

        " คุณตัดสินใจที่จะไม่เล่าเรื่องทั้งหมดให้เกี่ยวกับสองพี่น้องให้ดิเอโก้ฟัง บางทีมันอาจจะดีกว่าถ้ารู้แค่ว่าทั้งสองนเป็นแ่เพื่อนสมัยเด็กธรรมดาๆ "
        " แทนที่คุณจะได้รับการตอบกลับจากดิเอโก้ในทันที ดิเอโก้กลับทำสีหน้าครุ่นคิดแทน "

        b " ดิเอโก้?? "
        d " ฮะ อ่า หะ?! ว- ว่ายังไงนะไอ้หนูร้อด "
        b " ก็คุณดูเหม่อๆ น่ะสิ "
        d " อ้อๆ พอดีว่ากำลังคิดอะไรอยู่นิดหน่อยน่ะ ว่าแต่หลังจากนี้นายมีแพลนอะไรรึเปล่าล่ะ "
        b " ไม่มีหรอก "
        d " งั้นก็ดีเลย หลังจากกินข้าวเสร็จไปที่ๆ นึงกับฉันหน่อยสิ ได้รึเปล่า? "
        b " ได้สิครับ ไม่เห็นต้องถามเลย "

        " ดิเอโก้ยิ้มให้คุณก่อนที่คุณจะเริ่มจัดการกับอาหารตรงหน้าที่พึ่งมาเสิร์ฟสดๆ ร้อนๆ ให้หมด "
        " หลังจากที่จัดการกับอาหารตรงหน้าเสร็จ คุณก็นั่งรถมากับดิเอโก้ "

        #fade black to in car scene
        " ระหว่างทางพวกุณก็ไม่ได้สนทนาอะไรกันมากนัก จะมีก็แต่การถามสาระทุกข์สุขดิบทั่วไป "
        " ก่อนคุณสังเกตได้ว่าดิเอโก้กำลังขับไปชายหาด ร่างกายของคุณก็รู้สึกเกร็งขึ้นมาโดยที่ไม่รู้ตัว "
        " ดิเอโก้ที่ขัรถอยู่สังเกตว่าคุณเงียบไปก็พยายามพูดให้คุณรู้สึกดีขึ้น "

        d " พวกเรากำลังจะไปเยี่ยมใครบางคนที่อยู่ในป่าใกล้ๆ กับชายหาดน่ะ "
        b " คนรู้จักเหรอครับ? "
        d " เป็นคนที่ฉันและนายรู้จักดีเลยแหละ "
        " คุณรู้สึกติดใจกับคำพูดของดิเอโก้ คุณก็ไม่ได้ถามอะไรมากกว่านั้นแต่เพราะได้อิเอโก้คลายความสงสัยเมื่อกี้ ทำให้คุณรู้สึกสงบใจลงได้บ้าง "

        scene bs
        with fade
        
        #change to damn cutsecene, graveyard

        d " พวกเรามาถึงแล้วล่ะ "
        b " นี่คือ... "
        d " ร้อดดิโก้แล้วก็เบลนด้าน่ะ "
        b " เบลนค้า... "
        d " ชื่อของแม่ของนายยังไงล่ะ แสดงว่าร้อดดิโก้ไม่เคยเล่าให้ฟังเลยสิท่า "
        b " ครับ แล้วคุณจะพาผมมาที่นี่ทำไมล่ะ "
        d " เพื่อที่จะมาอธิบายว่าเพื่อนสมัยเด็กของนายมีความหมายยังไงกับนายแล้วก็ครอบรัวของพวกเราน่ะ "
        d " ส่วนเรื่องแม่ของนายก็อย่าไปถือสาพ่อของนายเลยนะ คงเป็นเพราะการจากไปอย่างกระทันหันของเบลนด้า "
        d " หลายๆ อย่างเกิดขึ้นทำให้ร้อดดิโก้คงไม่ได้อธิบายให้นายฟังน่ะ "
        d " ฉันเองก็ไม่อยากจะเล่าถ้าหากหมอนั่นไม่อยากจะพูด "
        d " แต่ว่าพอได้เห็นสีหน้าของนายในวันนี้ตอนที่พูดถึงสองคนนั้นแล้วฉันถึงได้ตัดสินใจว่าต้องบบอกเรื่องนี้ให้นายได้รู้ "
        b " ...... " #zoom into beck face
        d " เกี่ยวกับลานี่แล้วก็เอลนี่ "
        b " ดิเอโก้ คุณรู้จักเพื่อนสมัยเด็กของผมด้วยเหรอครับ "
        d " ฮ่าๆ รู้จักดีเลยล่ะ และมันก็เป็นสิ่งที่ฉันกำลังจะเล่าต่อด้วย "

        scene #
        with fade 

        #a scene with young deigo and rodigo in the past
        d " เมื่อตอนสมัยฉันกับร้อดยังเป็นวัยรุ่นพวกเราสนิทกันมากๆ และพพ่อของนายก็ยังเป็นคนที่ร่าเริงมากๆ อีกด้วย "
        d " พวกฉันในสมัยนั้นก็ยังอาศัยอยู่แถวทะเลเหมือนกัน "
        d " และนั่นก็เป็นช่วงที่ร้อดดิโก้กับพวกเอลนี่เจอกันนั่นแหละ "
        d " วันนั้นเป็นตอนที่ร้อดกับฉันทะเลาะกัน ทำให้จู่ๆ เจ้านั่นหนีไปไหนก็ไม่รู้ "
        d " แต่ตอนที่เจ้านั่นกลับมาก็มาเล่าเรื่องพวกเอลนี่ให้ฟังอย่างตื่นเต้นเลยล่ะ "

        scene bs 
        with fade

        #ซีนย้อนอดีต ท้องฟ้าก่อน ละค่อยเป็นซีนวัยรุ่นสองคนนั่งคุย

        r " ดิเอโก้ ฉันกลับมาแล้ว!!! นายต้องไม่เชื่อแน่ว่าฉันเจออะไร! "
        d " กลับมาแบบบนี้หายโกธรแล้วรึไง "
        r " เออช่างเถอะน่า! นายต้องไม่เชื่อแน่ว่าฉันไปเจออะไรมา "
        d " สำหรับนายคงไม่มีอะไรน่าตกใจไปมากกว่าที่ฉันแกล้งสารภาพรักกับเบลนด้าก่อนแล้วละมั้ง "
        r " คนอุส่าหายโกธรก็อย่าไปขุดมันขึ้นมาสิไอ้หมอนี่ "
        r " ช่างมันก่อนเถอะ ฟังฉันนะดิเอโก้ที่ชายหาดฉันไปเจอเด็กแปลกๆ มาด้วยล่ะ "
        r " มันอาจจะฟังดูบ้าแต่ว่า ฉันเห็นมันกับตาเลยว่าเด็กคนนั้นควบคุมน้ำได้น่ะ! "
        d " นี่นายไปโดนตัวไหนมาเนี่ย- "
        r " ฉันรู้ว่ามันอาจจะฟังดูไร้สาระ แต่ฉันเห็นจริงๆ นะดิเอโก้ 
        เพราะเด็กพวกนั้นฉันเลยลืมเรื่องนายไปสนิทเลยเนี่ย! "
        r " เด็กนั่นจับน้ำได้อย่างกัมันจับได้จริงๆ อย่างงั้นแหละ "
        d " ไม่รู้ว่านายพล่ามไร้สาระอะไรแต่ถ้าฉันแกล้งนายแรงเดินไปก็ขอโทษนะ "
        r " ฉันไม่ได้เพี้ยนนะเว้ยดิเอโก้ "
        d " เอออๆ "

        scene bs 
        with fade

        d " ในตอนนั้นที่ฉันได้ยินเรื่องเด็กสองคนนั้นเป็นครั้งแรก ฉันไม่ได้เอะใจอะไรเลยได้แต่เมินๆ ตำพูดพวกนั้นไป "
        d " ใครจะไปคิดละว่าหลังจากนั้นพวกเราก็ได้เจอกันจริงๆ อีกเยอะเลยน่ะ "
        d " หลังจากนั้นร้อดดิโก้ก็ยังไปหาสองคนนั้นเรื่อยๆ แถมยังเอาเรื่องมาเล่าให้ฉันฟังอีก "
        d " วันนั้นละมั้ง คืนนั้นฉันดื่มหนักมากเลยกะจะไปสูดอากาศที่ชายหาด
        แล้วด้วยความเมาละมั้ง ฉันก็เผลอทำกุญแจรถตกลงไปในทะเล "
        d " ตอนนั้นก็คิดแล้วล่ะว่ายังไงก้คงหาไม่เจอแล้วแน่ๆ "

        #Elny return key to diego scene
        e " นี่ ไอ้นี่เนี่ยใช่ของนายรึเปล่า "
        d " หะ นั่นใคร "
        d " ตอนที่เงยหน้าขึ้นมาจากน้ำอีกทีก็เห็นเด็กผู้ชายในชุดสีแดงยื่นกุญแจมาให้ "
        d " ตอนนั้นเพราะอยู่คนเดียวตรงชายหาดแถมยังเมาก็เลยคิดว่าเป็นผี ตอนนั้นฉันก็เลยวิ่งหางจุกตูดหนีมาเลยล่ะ "
        
        #at home, rodigo return key that he recieve from Elny diego lie on sofa while rodigo is beside him
        d " พอกลับไปถึงบ้านก็หลับเป็นตายทำเอาลืมแทบจะทุกอย่างเลย 
        แต่ว่าจู่ๆ วันต่อมาร้อดดิโก้ก็เอากุญแจมมาคืนให้แทน "

        r " ทำไมเมื่อคืนนายถึงทิ้งเอลนี่ไว้แบบนั้นเล่า "
        d " พูดเรื่องอะไรของนายร้อดดิโก้ เมื่อคืนฉันไม่ได้เจอใครสักหน่อย "
        r " แล้วนี่มันอะไรเล่า เมื่อคืนนายเมาแล้วก็ทำกุญแจหล่นลงไปในทะเลใช่มั้ยล่ะ "

        " รอดดิโก้ยื่นกุญแจที่ดิเอโก้ทำตกลงไปในทะเลคืนให้อีกฝ่าย "

        r " เอลนี่เขาอุส่าเก็บมาให้แต่นายจะวิ่งหนีเพื่อ "
        d " เอลนี่? นั่นมันชื่อของเด็กที่นายพูดถึงมาตลอดนี่ "

        #ซีนเสียงในใจของดิเอโก้ที่กำลังพูดกับตัวเอง
        m " แต่ว่าเรื่องที่ร้อดดิโก้เล่ามาตลอดมันแทบจะไร้สาระทั้งหมดเลยนี่ แต่แล้วถ้าเป็นอย่างงั้น
        ทำไมกุญแจถึงมาอยู่กับหมอนี่ได้ล่ะ?? "
        m " งั้นที่ร้อดดิโก้พูดมาตลอดก็เป็นความจริง... "
        m " ถึงจะไม่อยากเชื่อมากแค่ไหนแต่เพราะกุญแจมาอยู่ตรงหน้าแล้วทำให้ต้องเชื่ออย่างช่วยไม่ได้ "

        d " นายกำลังจะพูดว่าเด็กที่นายพูดถึงมาตลอดมีอยู่จริงๆ รึไง "
        r " แล้วฉันจะโกหกนายไปทำไมเล่า "
        d " สมมติว่าเด็กที่นายพูดถึงมีอยู่จริงนายก็ไม่ควรไปยุ่งกับพวกเด็กพวกนั้นสิ จากที่นายเล่าเด็กพวกนั้นมีพลังแปลกๆ ด้วยนี่! "
        r " แต่พวกนั้นก็เล่นกับฉันมาตลอดเพราะงั้นก็ไม่เป็นอะไรหรอก เชื่อใจฉันเถอะน่า "
        d " เฮ้อ ถ้านายว่าแบบนั้นฉันจะลองเชื่อนายก็ได้ "

        scene bs 
        with fade
        m " หลังจากตอนนั้นเอง ฉันก้เริ่มเชื่อขึ้นมาบ้างแล้วว่าเด็กสองคนนั้นมีอยู่จริงๆ "
        m " จนวันนึงฉันก็เลยตัดสินใจตามร้อดดิโก้ไปที่ชายหาด เพื่อจะลองไปเจอเด็กทั้งสองคนนั้น "
        
        scene beachdayblur
        with fade 

        d " นี่จะให้เดินไปอีกนานแค่ไหนเนี่ยร้อด ถ้ายังฝืนเดินไปมากกว่านี้พวกเราจะเปียกน้ำกันแล้วนะ "
        r " น่าๆ ก็ปกติเวลามาหาทั้งสองคนมันต้องทำแบบนี้นี่ "
        d " ให้ตายสิ เพราะงี้นายถึงตัวเปียกกลับมาบ้านได้ตลอดเลยสินะ "
        r " ฮ่าๆ ก็นะ รออยู่นี่แปปนึงนะดิเอโก้ "
        d " เดี๋ยวๆ จะเดินลงน้ำไปทำไมน่ะร้อด! "
        r " น่าๆ ยืนอยู่ตรงนั้นแหละน่า เดี๋ยวฉันจะเรียกสองคนนั้นออกมาให้เอง "

        " ภายใต้เสียงโวยวายของผู้พี่ร้อดดิโก้ไม่ได้หวั่นใจเลยแม้แต่น้อย เขาก้าวขาเดินลงน้ำอย่างมั่นคง "
        " น้ำเย็นท่วมจนถึงหัวเข่าของชายหนุ่ม ร้อดดิโก้หยุดลงก่อนจะสูดหายเข้าลึกๆ และตะโกนจนสุดเสียง "

        d " เอลนี่!!! เจ้าบ้าขี้โวยวาย!!! "
        r " ตะโกนบ้าอะไรของนายอยู่คนเดียวเนี่ยร้อด กลับมาได้แล้ว- "

        #ซีนน้ำวน
        #ซีนเอลนี่โผล่มาจากน้ำ
        " ก่อนที่ดิเอโก้จะเดินเข้าไปห้ามคนเป็นน้อง เบื้องหน้าของทั้งคู่
        ก็ปรากฏเป็นวังวนน้ำหมุนขนาดเล็กก่อนที่สิ่งมีชีวิตรูปร่างคล้ายเด็กชายและเด็กหญิงโผล่ออกมา "
        " และคนที่ดิเอโก้เห็นตรงหน้าก็ไม่ใช่ใครที่ไหน เขายังจำมันได้ดีถึงผมสีแดง
        และสีหน้าเรียบนิ่งของเด็กหนุ่มที่เขาเห็นในคืนนั้น "

        r " น- นายมัน!! "
        
        #ซีนดิเอโก้ล้ม
        " ดิเอโก้ตกใจถอยหลังจนเผลอสะดุดล้มลงไปนั่งกับกองทรายเข้าให้ "
        e " ฉันจำนายได้นะ พี่ชายของไอ้เจ้าบ้าที่เรียกฉันว่าไอ้บ้า "
        e " ดูเหมือนว่านายคงจะอยากมาพิสูจน์สิท่าว่าฉันมีอยู่จริงๆ น่ะ "
        l " พี่คะ คนๆ นี้คือใครเหรอคะ? "
        " เด็กสาวเอ่ยถามพี่ชายพร้อมมีท่าทีเป็นกังวล เธอดูจะระแวงคนแปลกหน้าเป็นพิเศษ "

        e " ก็คนที่ร้อดดิโก้เล่าให้ฟังบ่อยๆ พี่ชายของเจ้านี่น่ะ "

        #ซีนร้อดโดนเขกหัว
        " ในตอนที่ตอบคำถามของน้องสาวเสร็จ เอลนี่ก็เดินไปเขกหัวร้อดดิโก้ไปทีเอาคืนที่ร้อดดิโก้เรียกเขาว่าบ้า "
        d " นายคือเด็กที่โผล่มาตอนนั้นอย่างงั้นหรอ น- นายไม่ใช่ผีหรอกรึไง... "
        e " เรียกใครว่าผีฮะ ฉันชื่อว่าเอลนี่ฉันไม่ใช่ผีแต่ก็ไม่ใช่มนุษย์ 
        ส่วนนี่น้องสาวฉันชื่อลานี่ พวกเราทั้งคู่เป็นปรากฏการณ์ทางสมุทรศาสตร์ที่จู่ๆ ก็มีตัวตนขึ้นมา "
        e " แล้วก็จะเรียกฉันยังไงมันก็ขึ้นอยู่กับนายแต่อย่ามาเรียกฉันว่าไอ้บ้าเหมือนน้องชายของนายก็พอ "
        d " ได้...เอลนี่ ฉันจะเชื่อ เห็นมาตั้งขนาดนี้แล้วฉันก็คงจะต้องเชื่อแล้วล่ะ "
        d " แต่ที่ผ่านมานายคงลำบากมากๆ เลยสินะ ขอโทษที่น้องชายฉันทำตัวบ้าๆ บอๆ ใส่นายด้วย "
        e " ช่างเถอะ ฉันอยู่กับหมอนี่มานานจนต้านทานเชื้อคนบ้าไปละ  "
        r " พูดแบบนี้ได้ไงละเอลนี่ ก็นายขี้บ่นแถมยังชอบทำตัวปากไม่ตรงกับใจอีก ถ้าไม่ให้เรียกไอ้บ้าแล้วจะให้เรียกว่าอะไรเล่า- "

        " แล้วร้อดดิโก้ก็โดนเอลนี่เขกหัวไปอีกรอบนึง"

        scene bs 
        with fade

        #ซีนทุกคนไปวิ่งเล่นด้วยกัน
        m " ตั้งแต่ตอนนั้นมา ฉัน รอดดิโก้ เอลนี่แล้วก็ลานี่ ก็ไปเที่ยวเล่นด้วยกันอยู่ตลอด พวกเราอยู่ด้วยกันมาหลายปี "

        #ซีนเบลนด้าตั้งท้องกับร้อด + เอลนี่ ลานี่ได้ยินข่าว ดีใจ
        m " จนกระทั่งแม่ของนายเบลนด้าได้เข้ามาในชีวิตของพวกเรา4คน "
        m " แรกๆ เอลนี่ก็ดูจะไม่ชอบใจอยู่หรอกแต่เพราะทุกคนช่วยกันกล่อม เบลนด้าก็เลยได้มาเล่นกับพวกเราได้บ่อยขึ้้น "
        m " จนวันนึงร้อดดิโก้ตัดสินใจแต่งงานกับเบลนด้า หลังจากนั้นพวกเขาก้ได้แต่งงานกัน "
        m " เอลนี่ตกใจมากถึงขนาดจะบุกไปบ้านร้อด เพราะตอนนั้นสองพี่น้องเป็นคนสุดท้ายที่รู้เรื่องนี้น่ะ "
        m " แต่ทุกอย่างก็ผ่านพ้นไปด้วยดี จนกระทั่งเบลนด้าตั้งท้องนายขึ้นมา "
        m " นั่นเป็นอีกรอบนึงที่เอลนี่บุกไปบ้านร้อด ทีแรกก็นึกว่าจะโกธรสะอีก "
        m " แต่หมอนั่นก็แค่มาแสดงความยินดีแล้วก้บอกให้ร้อดดิโก้เป็นพ่อที่ดีเท่านั้นเอง "
        m " ลานี่เองตอนที่ได้ยินก็ตื่นเต้นมากๆ เลยนะ "
        m " ถึงขั้นต้องมาถึงบ้านพวกฉันแล้วก็มาช่วยดูแลเบลนด้าแล้วก็นายตั้งแต่อยู่ในท้องเลยล่ะ "

        #มาเยี่ยมบ้าน แล้วก็คอยร้องเพลงให้ฟัง อาจจะฟอชาโดว์ว่าเบ็กได้ยินเพลงกล่อมเด็กนี่มาโดยตลอดที่จริงแล้วมาจากลานี่ ส่วนที่รู้สึกสนิทกับสองนนั้นโดยทันทีก็เป็นเพราะอยู่ด้วยกันมาตลอด
        m " ทั้งสองคนนั้นรักแล้วก็แคร์นายกับเบลนด้ามากๆ ขนาดฉันเองที่ตอนแรกๆ ยังผวา "
        m " สองนั้นยังรู้สึกเข้าใจแล้วก็ตื้นตันกับภาพตรงหน้าเลยนะ "
        m " ...มันเป็นช่วงเวลาที่มีความสุขมากจริงๆ นะ "
        m " มากจนอยากให้เรื่องแบบนี้ดำเนินตลอดไปนานเท่านานเลยล่ะ "

        scene #ซีนลานี่เอลนี่แล้วก้ทุกคนอยู่ด้วยกัน เอลนี่ลานี่อยู่ที่พื้น เบลนด้านั่งอยู่บนโซฟา มีสองพี่น้องคอยดูแลอยู่ใกล้ๆ
        with fade

        l " เด็กคนนี้ชื่อว่าอะไรเหรอคะเบลนด้า "
        a "  เด็กคนนี้เขาชื่อว่าเบ็นนิกโน่จ้ะ เรียกสั้นๆ ว่าเบ็ก เป็นผู้ชายที่จะต้องเติบโตมาและแข็งแรงให้ได้เหมือนกับพวกเธอเลย "
        l " ชื่อน่ารักจังเลย สมกับที่เบลนด้าเป็นคนตั้งเลยนะ "
        e " เห็นด้วย แต่หวังว่าเด็กที่ออกมาจะไม่เหมือนคนเป็นพ่อนะ โดยเฉพาะนิสัย... "
        r " อะไรเนี่ยเอลนี่ พูดแบบนี้มันว่ากันนี่! "
        a " ก็แหม ก็ตั้งแต่สมัยก่อนแล้วนี่คะทีุ่ณชอบแกล้งกับเอลนี่บ่อยๆ "

        #ร้อดดิโก้โวยวายเล่นๆ พร้อมทุกคนที่หัวเราะ
        " เสียงหัวเราะร่าของทุกคนดังขึ้นมาพร้อมๆ กันพร้อมกับท่าทีโวยวายเล่นๆ ของร้อดดิโก้ "
        " เย็นวันนั้นลานี่กับเอลนี่ก็เลือกที่จะอยู่กับเบลนด้าแล้วก็คอยร้องเพลงกล่อมเด็กและลูบท้องให้ทั้งวัน "
        " เสียงของลานี่ไม่เหมือนมนุษย์คนไหน มันเป็นเสียงที่ไพเราะราวเสียงหยาดน้ำค้างในยามเช้า ผ่อนคลายราวกับกำลังฟังเสียงของคลื่นทะเลในฤดูร้อน "

        l " ฉันขอให้เด็กคนนี้เติบโตมาแข็งแรง เป็นที่รักของทุกคนแล้วก็อยู่กับพวกเราไปนานๆ เลยนะ "
        e " แค่เด็กคนนี้โตมาได้แบบปลอดภัยฉันก็ไม่มีอะไรจะอวยพรแล้วล่ะ "
        a " ขอบคุณนะทั้งสองคน ฉันก็หวังว่าหลังจากที่เด็กคนนี้โตไปพวกเธอก็จะยังคอยอยู่กับเด็กคนนี้แทนฉันทีนะ "

        " ในตอนนั้นพวกเราไม่รู้เลยว่าตอนนั้นเบลนด้าหมายความว่าแบบนั้นจริงๆ หรือว่าเธอแค่พูดเล่นไปเฉยๆ "
        " จนกระทั่งในบ่ายวันหนึ่งที่มีพายุเข้าอย่างหนัก "

        scene bs 
        with fade

        a " โอ้ย ท้องมันปวดไปหมด.. "
        r " เบลนด้า เป็นอะไรไป! "
        a " คุณคะ...ฉันปวดท้องเหมือนจะคลอดเลย โอ้ย! "

        " เบลนด้ากุมท้องตัวเองแน่น ความเจ็บปวดจากท้องน้อยส่งไปทั่วร่างราวกับกายจะแหลกเป็นเสี่ยงๆ "
        " เบลนด้าล้มลงกับพื้นโดยที่มีร้อดดิโก้ที่ทำสีหน้าสับสนคอยพยุงอยู่ห่างๆ "
        " เพราะสถานการณ์คับขันเอามากๆ ทำให้ต่างคนต่างทำอะไรไม่ถูก ในตอนนั้นเองที่กำลังจะสิ้นหวัง "
        " เสียงเปิดประตูหน้าก็ดังขึ้น ดิเอโก้ที่วางแผนจะมาดูอาการเบลนด้าในตอนบ่ายก็เข้ามาพอดี "

        d " เบลนด้า?! ร้อดดิโก้เกิดอะไรขึ้น เบลนด้ายังไม่ถึงกำหนดคลอดเลยนี่! "
        r " ม ไม่รู้เหมือนกัน จู่ๆ เบลนด้าก็- "
        a " ด- เด็ก... ต้องไปโรงพยาบาล คุณคะลูกของเรา... "

        " ถึงจะไร้เรี่ยวแรงเต็มที่แต่สายตาของเธอก็ยังมุ่งมั่นที่จะช่วยลูกชายของเธอ 
        เธอจับแขนของสามีแน่นด้วยแรงทั้งหมดของเธอ "

        d " ร้อดดิโก้ตั้งสติหน่อย! รีบไปเอากุญแจรถมาเร็ว ตอนนี้ฝนเริ่มตกแรงขึ้นเรื่อยๆ 
        พวกเราต้องรีบแล้วก่อนที่ฝนจะตกหนักไปมากกว่านี้ "

        " ร้อดดิโก้พยังหน้ารับคำก่อนจะรีบวิ่งไปหยิบกุญแจรถแล้วออกมาช่วยดิเอโก้พยุงเบลนด้าไปขึ้นรถ "

        scene bs 
        with fade

        #ภาพล้อรถพร้อมกับถนนที่เปียกชุ่ม

        " หลังจากที่รถคันเก่งเคลื่อนตัวออกมาจากบ้านพักริมชายหาดอย่างเร่งรีบ 
        ภายในรถมีเบลนด้าที่นั่งอยู่โดยที่มีร้อดดิโก้คอยปลอบอยู่ไม่ห่าง "

        " ดิเอโก้ที่รับหน้าที่คนขับก็ไม่รอช้ารีบขับตรงไปยังโรงพยาบาลอย่างรวดเร็ว 
        แต่ก็ไม่สามารถเร่งความเร็วไปมากกว่านี้ได้เพราะอาจจะทำให้เกิดอุบัติเหตุได้ "

        " สภาพอากาศที่ย่ำแย่ พายุฝนโหมลงมากระหน่ำทำให้การเดินทางล่าช้าไปมาก 
        กว่าจะไปถึงโรงพยาบาลก็ทำเอาเบลนด้าสลบไปเพราะความเจ็บปวดแล้ว "

        " เมื่อมาถึงโรงพยาบาลเบลนด้าก็โดนย้ายตัวไปห้องทำคลอดอย่างรวดเร็ว 
        ส่วนร้อดดิโก้เพราะเป็นห่วงเบลนด้าก็เกือบจะเข้าไปขัดขวางการทำงานของหมอ "

        " แต่ก็ยังโชดีที่ยังมีดิเอโก้คอยห้ามเอาไว้ ทำให้เบลนด้าถึงมือหมออย่างทันท่วงที "

        " ชายหนุ่มทั้งสองโล่งใจที่ในที่สุดทั้งแม่และเด็กก็พ้นขีดอันตราย "

        " แต่เมื่อเวลาผ่านไปชายหนุ่มยังไม่ทันที่รอยยิ้มจางหายไปจากใบหน้า 
        คนเป็นหมอก็เดินออกมาจากห้องทำคลอดด้วยสีหน้าเคร่งเครียด "

        " และแล้วสิ่งที่ร้อดดิโก้ไม่อยากให้เกิดขึ้นมากที่สุดก็เกิดขึ้น
        เมื่อคุณหมอออกมาแจ้งข่าวร้ายให้แก่ชายหนุ่มทั้งสอง "

        p " ต้องขอแสดงความเสียใจด้วยนะครับ ทางเราได้พยายามอย่างสุดความสามารถแล้ว 
        แต่ดูเหมือนว่าภรรยาของคุณมีร่างกายที่ค่อนข้างจะอ่อนแอ "
        p " และดูเหมือนว่าหลังจากคลอดเด็กออกมาอาการของเธอก็เข้าขั้นวิกฤตทันทีครับ "
        p " ที่ผมอยากจะพูดคือการที่ภรรยาของคุณยังมีสติจนมาถึงโรงพยาบาลก็นับว่าปาฏิหาริย์มากแล้วครับ "
        p " เดี๋ยวขอเชิญญาติคนไข้เข้าห้องฉุกเฉินด้วยนะครับ "

        " ทันทีที่คุณหมออนุญาตให้เข้าเยี่ยมเป็นครั้งสุดท้าย ร้อดดิโก้ก็รีบวิ่งฝ่าทั้งพยาบาลและหมอเข้าไปในห้องเพื่อไปหาภรรยา "

        scene bs 
        with fade

        #เสียงวิ่ง ซีนขาวิ่ง

        " เมื่อเข้ามาถึงภายในห้องฉุกเฉิน ร้อดดิโก้ก็เห็นหญิงสาวนอนอยู่บนเตียง
        เธอมีหน้าซีดขาวและหายใจรวยรินเต็มทีพร้อมทารกในอ้อมแขน "
        " หญิงสาวพึมพำอะไรบางอย่าง สติของเธอเริ่มเลือนลางทำให้ชายหนุ่มต้องเขยิบเข้าไปฟังใกล้ๆ "
        a " ...ลูก ออกมาแข็งแรงดีละค่ะ คุณดูสิคะ "
        
        " ถึงเสียงจะดูเหนื่อยอ่อนแต่ก็ยังมีความยินดีปนอยู่ในน้ำเสียง 
        เธอยื่นลูกของเธอให้คนเป็นสามีพลางลูบแก้มนุ่มของทารกตัวน้อย "

        " ร้อดดิโก้ตัวสั่นน้ำตาไหลอาบแก้ม แม้ภรรยาของเขาจะอยู่ตรงนี้แล้ว 
        ถึงแม้เขาจะอยู่ตรงนี้แล้วแต่เขากลับทำไมอะไรเพื่อช่วยเธอไม่ได้เลย "

        " หญิงสาวละมือจากเด็กน้อยก่อนจะเปลี่ยนไปปาดน้ำตาให้สามี 
        รอยยิ้มที่เธอมอบให้เขายังคงเหมือนวันแรกที่พวกเขาเจอกัน "

        a " ขอโทษนะคะที่ไม่ได้บอกคุณเรื่องที่ร่างกายฉันอ่อนแอตั้งแต่แรก ฉันแค่กลัว "
        a " กลัวว่าคุณจะรับไม่ได้ที่มีผู้หญิงอ่อนแอแบบฉันอยู่ข้างๆ... "
        r " พูดอะไรของคุณน่ะเบลนด้า ผมไม่มีทางที่จะปล่อยมือคุณเพียงเพราะเรื่องแค่นี้สักหน่อย "
        r " ไม่ว่าจะเรื่องอะไรผมก็ตัดสินใจแล้วว่าคุณก็คือคู่ชีวิตของผม "
        r " คุณคือภรรยาของผม คุณคือแม่องเด็กคนนี้ คุณคือ...ทุกๆ อย่างของผมเบลนด้า... "
        a " ขอโทษนะคะร้อดดิโก้ ฉันขอโทษจริงๆ 
        แต่ฉันก็อยากจะมีลูกกับคุณ อยากจะ...ใช้ชีวิตเหมือนคนทั่วไป "
        a " แล้วอย่างน้อยๆ ฉันจะมั่นใจว่าคุณจะไม่เหงาหลังจากที่ฉันจะไม่อยู่แล้วแน่ๆ... "
        r " คุณมันโหดร้ายเกินไปแล้วนะเบลนด้า คุณจะทิ้งผมไปไม่ได้นะ ได้โปรด.. "
        r " แค่ผมคนเดียวเลี้ยงดูเด็กคนนี้ไม่ไหวหรอก ผมทำไม่ได้ถ้าไม่มีคุณเบลนด้า ได้โปรด ผม- "
        a " ถ้าเป็นคุณฉันเชื่อว่าคุณจะต้องเลี้ยงเขามา....เติบโต เป็นเด็..กที่ดี "
        a " ก็เพราะ....คุณคือพ่อของเขานี่คะร้อดดิโก้... "
        a " ถ้าเป็นคุณ...ละก็..จะต้อง..."

        " ชายหนุ่มส่ายหน้าพยายามสรรหาข้อแก้ตัวต่างๆ นาๆ เพื่อที่จะทำให้ภรรยาเปลี่ยนใจ และถึงแม้มันจะได้ผลเธอก็คงทำอย่างที่หวังไม่ได้ "
        " เสียงชีพจรของเธอเริ่มเบาลงเรื่อยๆ หญิงสาวจับมืออีกฝ่ายแน่น ดวงตาทั้งสองเอ่อล้นไปด้วยน้ำตา "

        a " ไม่ว่าที่ไหน....ฉันก็จะคอยอยู่เคียงข้าง...คุณแล้วก็เบ็กเสมอนะคะ "
        a " ฉันรักคุณ ฉัน...รักคุณมากๆ เลยนะคะ ....รักมากกว่าใครคนไหนบนโลกใบนี้ "
        a " ร้อด...ดิโก้ ฉันรั...กคุณ.."

        " เมื่อสิ้นประโยคมืออุ่นที่เคยโอบใบหน้าและปาดน้ำตาของชายหนุ่มไว้ก็หล่นลงข้างตัวของผู้เป็นภรรยา "
        " ชีพจรของเธอไม่ดังอีกต่อไปและเป็นสัญญาณว่าชีวิตนึงได้ห้องฉุกเฉินนี้ได้กลับคืนสู่ธรรมชาติแล้ว "

        r " ไม่นะเบลนด้า อยู่กับผมสิ เบลนด้าขอร้องล่ะ! เบลนด้า!!! "

        " ร้อดดิโก้ไม่สามารถเก็บอารมณ์ที่ถาโถมเข้ามาไว้ได้อีกต่อไป 
        เขารีบเข้าไปกอดร่างที่ไร้ชีวิตของภรรยาพร้อมกับทารกในอ้อมแขน "

        " ภรรยาของเขาได้จากไปแล้ว ทิ้งเขาไว้เพียงลำพังกับทารกตัวน้อย "

        r " โอ้ พระเจ้า ถ้าโลกใบนี้ไม่มีเธอแล้ว มันจะมีความหมายอะไรเล่า "

        " หลังจากนั้นเมื่อเบลนด้าเสีย เหล่าผู้คนที่เศร้าโศกก็กลับมาที่บ้านตรงชายหาดอีกครั้ง
        และที่นั่นก็มีเด็กสองคนที่กำลังรอฟังข่าวดีอยู่ "
        " น่าเศร้า ที่เด็กทั้งสองจะไม่ได้ยินข่าวดีอย่างที่หวังไว้ "

        scene bs #diego sad face then twin darken face, but lany more sad
        with fade

        d " เบลนด้าเธอ...เสียแล้วนะ เธอจากไปแทบจะทันทีหลังจากที่เธอคลอดเบ็กออกมาน่ะ "
        d " โชคดีที่เด็กยังปลอดภัยดี ส่วนร้อดดิโก้เองตอนนี้หมอนั่นก็ยังทำใจไม่ได้เลย "
        e " ด...ได้ยังไง "
        d " เมื่อวานพายุเข้าแล้วฝนก็ตกหนักมากก็เลยต้องขับรถช้าๆ 
        พวกเราเลยไปถึงโรงพยาบาลช้ากว่าที่คิดน่ะสิ "

        " เด็กชายหน้าซีดเมื่อยามที่เขาคิดตามที่ดิเอโก้พูด "

        e " พายุ..ฝนตก..."
        l " ฮึกก...ไม่จริงน่าเบลนด้า ทำไมล่ะ... "
        d " ฉันก็อยากจะโทษว่าทุกอย่างมันเป็นเพราะฉันที่ไม่รู้ตัวให้เร็วกว่านี้หรอก
        แต่หมอก็บอกว่าต่อให้มาเร็วกว่านี้เบลนด้าก็คง...ทนไม่ไหวอยู่ดี "

        e " เพราะฉัน..."
        " เด็กชายพึมพำ "

        d " หะ เมื่อกี้นายพูดว่าอะไรนะเอลนี่ "
        e " นายพูดว่าฝนตกใช่มั้ย...นั่นมันก็เพราะ ฉัน ไม่ใช่รึไง "
        d " ม หมายความว่ายังไง- "
        e " ปรากฏการณ์เอลนีโญน่ะจะทำให้รอบๆ ชายฝั่งมีอุณหภูมิสูงขึ้น
        จนทำให้เกิดฝนตกหนักมากกว่าปกติ ทีนี้ก็ไม่ต้องให้ฉันพูดต่อแล้วใช่มั้ย.... "
        e " เป็นเพราะฝนนั่น ฝนที่ฉันทำให้มันเกิดขึ้น..."
        e " ฉันเป็นคนพรากเธอไปจากเด็กคนนั้น...ฉันเป็นคนที่ทำให้เบลนด้าต้องตาย ฉัน- "
        d " ใจเย็นก่อนสิเอลนี่! ฉันก็บอกแล้วนี่ว่าหมอบอกว่าร่างกายเบลนด้า- "

        " ดิเอโก้รีบพุ่งเข้าไปจับไหล่ทั้งสองข้างของเด็กชายเพื่อดึงสติแต่ก็โดนอีกฝ่ายพลักออกมา "
        " ดิเอโก้เสียสูญทำให้ตัวของเขาเอนไปข้างหลังโคคดหินข้างๆ โชคยังดีที่ลานี่มาจับอีกฝ่ายไว้ทัน "
        " พาลทำเอาเด็กสาวต้องเรียกพี่ชายอย่าหวาดผวา ถ้าเธอไม่ช่วยดิเอโก้เอาไว้ละก็... "
        l " พ พี่คะใจเย็นก่อนสิ!! "
        e " แต่ถ้ามันเร็วขึ้นได้สักนิดนึงก็ยังดีนี่! ต่อให้ไม่มีโอกาสรอดแต่ว่า แต่ว่า...! "

        " มือของเด็กชายสั่นเป็นครั้งแรกอย่างที่ไม่เคยรู้สึกมาก่อน 
        นี่เป็นครั้งแรกจากก้นบึ้งของหัวใจจริงๆ ที่เขารู้สึกว่าอยากจะหายไปมากขนาดนี้ "

        e " ฉันมันก็แค่สัตว์ประหลาดในคราบมนุษย์ เป็นปรากฏการณ์ทางสมุทรศาสตร์ที่สามารถนำพาภัยพิบัติและความตายมาสู่ทุกคนได้ "
        e " ถ้ารู้แบบนี้ตั้งแต่แรก ฉันไม่น่ามาปรากฏตัวให้พวกนายเห็นเลย...."
        e " ฉันขอโทษ....ที่สร้างบาดแผลให้กับพวกนาย "
        e " เพื่อเป็นการไถ่โทษฉันจะไม่โผล่หน้ามาให้นายรวมถึงครอบครัวของนายได้เห็นอีก "

        " เด็กชายหันหลังของตนก่อนที่จะหายตัวไปราวกับสายลมโดยที่ไม่ฟังคำแย้งหรือบอกลา "

        l " ฉันขอโทษจริงๆ นะคะ ฉันขอโทษจริงๆ "
        " เช่นเดียวกับเด็กชาย หลังจากที่พูดจบเด็กหญิงก็หายตัวไปราวกับตรงนั้นไม่เคยมีเธออยู่ "

        " หลังจากที่เด็กชายหนีมาไกลพอสมควร เขาหยุดและทอดสายตาไปไกล 
        พลางตั้งคำถามกับตัวเอง "
        " ทำไมฉันถึงต้องเกิดมาเป็นปรากฏการณ์ทางสมุทรศาสตร์? "
        " ทำไมถึงมีตัวตนขึ้นมา แล้วจะเกิดขึ้นมาทำไมถ้าเขาจะสร้างความเจ็บปวดมากมายให้กับคนรอบตัวมากขนาดนี้ "
        " แม้จะตั้งคำถามเดิมๆ ซ้ำแล้วซ้ำเล่าก็ไม่เคยได้คำตอบกับตัวเองเลยสักครั้ง "

        " จากเหตุการณ์การสูญเสียของเบลนด้านั้นทำให้ทุกคนตกอยู่ในความเศร้า รวมถึงร้อดดิโก้เอง "
        " เขาไม่อาจจะทำใจได้ในทันทีว่าภรรยาของตัวเองไม่ได้อยู่บนโลกใบนี้อีกแล้ว "
        " ทำให้หลายครั้งหลายคราที่ตัวเขาเองเผลอโทษ
        ลูกชายเพียงคนเดียวของเขาไปว่าเป็นคนพรากภรรยาจากเขาไป "
        " โดยที่ลืมคำนึงถึงไปว่า ไม่ใช่แค่เขาที่เสียภรรยาไป แต่ลูกชายของเขาเองก้ได้เสียมารดาไปเช่นกัน "

        " ทำให้ในช่วงเวลาที่เขาต้องต่อสู้กับความเศร้า เขาจึงเลือกที่จะทิ้งลูกชายไว้กับพี่ชายของตน "
        " แม้จะมีเสียงห้ามจากพี่ชายว่าไม่ควรทำแบบนี้ แต่ก็ไม่อาจทำให้เขาตาสว่างและหลุดออกจากบ่วงความเศร้าได้ "
        " จึงเลือกที่จะหนีปัญหามาอย่างหมาขี้แพ้และทิ้งแม้กระทั่งลูกชายตัวเองเอาไว้ "
        " เด็กชายที่อยู่กับดิเอโก้ก็ค่อยๆ เติบโตมาอย่างช้าๆ จนมีอายุได้ 4 ขวบ "
        " เบ็กเติบโตมามีร่างกายที่แข็งแรงต่างจากผู้เป็นแม่ ทั้งยังเป็นคนที่ร่าเริงและสดใส "
        " และด้วยเหตุผลบางอย่างทำให้เด็กชายมักไปวิ่งเล่นที่ทะเลบ่อยๆ แม้ตนจะไม่ได้มีเพื่อนไปเล่นด้วยก็ตาม "
        " ในตอนนั้นเองที่เด็กชายได้เจอกับใครบางคนเข้า "

        scene bs 
        with fade

        #เบ็กวิ่งเล่นอยู่ตรงชายหาด เห็นหอยวิ้งๆ ก้เลยหยิบขึ้นมา พอเงยหน้าก้เจอเอลนี่ยืนอยู่ ไม่ต้องอธิบายอะไร

        b " ..... "
        e " ..... "

        " สายตาของทั้งสองคนสบกันอยู่นานแสนนานจนคนโตกว่าตัดสินใจ
        ที่จะเดินหนีแต่ก็โดนมือเล็กนั่นจับชายเสื้อเอาไว้ "

        e " ปล่อย "

        " เอลนี่พูดเสียงแข็งพยายามทำให้ตัวเองดูน่ากลัวมากที่สุดเท่าที่จะทำได้
        เพื่อที่จะทำให้เด็กคนนี้กลัว "
        " เขาไม่ได้ตั้งใจจะเข้าไปมีปฏิสัมพันธ์กับมนุษย์คนไหนอีกเลย
        ตั้งแต่ที่ตัดสินใจที่จะไม่ไปเจอพวกร้อดดิโก้อีก "
        " ครั้งนี้ก็เช่นกัน เขาไม่อยากจะเป็นเพื่อนกับใครอีกจึงเลือกที่จะไม่ยุ่งกับเด็กคนนี้เหมือนกัน "
        " แต่ถึงจะคิดแบบนั้น เอลนี่ก็ไม่สามารถสลัดเด็กชายหลุดได้เลย "
        " ทั้งเดินหนีหรือแม้กระทั่งพูดจาแรงใส่ๆ เด็กคนนี้ก็ยังตามเขามาอยู่เรื่อยๆ "

        e " อะไรของนายเนี่ยเจ้าตัวเล็ก ไม่มีเพื่อนให้เล่นด้วยรึไง "
        b " ไม่มี! "
        e " แล้วไม่เหนื่อยรึไง เอาแต่เดินตามฉันอยู่ได้ "
        b " ม่ายเหนื่อยย! "

        " เด็กชายตอบเสียงใสก่อนยื่นเปลือกหอยให้เอลนี่ "
        " เอลนี่ถอนหายใจ เขาแทบจะหมดหนทางที่จะไล่เด็กคนนี้ไป "
        " ด้วยความรำคาญจึงเผลอปัดเมื่อเด็กชายจนเปลือกหอยหล่นลงไปในทะเล "
        " ถึงจะไม่ได้ตั้งใจแต่ก็ดูเหมือนจะดึงความสนใจของเด็กชายได้ "

        e " ไม่ใช่ความผิดฉันนะ เพราะนายมันน่ารำคาญเอง "

        " เด็กชายไม่ได้ตอบหรือร้องไห้ แต่กลับวิ่งลงไปในน้ำก่อนจะพยายามหาเปลือกหอยที่ว่า "
        " เอลนี่ไม่ได้สนใจและกำลังจะเดินออกไปจนกระทั่งที่
        หางตาของเขาเห็นว่าเด็กชายกำลังเดินลงไปในทะเลเรื่อยๆ "
        " เขาไม่ได้มีความตั้งใจจะมีปฏิสัมพันธ์กับมนุษย์คนไหนเลยและไม่ต้องการจะมีอีก "
        " แต่ทุกๆ ก้าวที่เด็กชายลลงทะเลไปเรื่อยๆ ทำให้เอลนี่เป็นกังวลโดยที่ไม่รู้ตัว "
        " เพราะว่าเด็กตรงหน้ากำลังเดินลงไปในทะเลและไม่มีผู้ใหญ่คนไหนหรอกที่เห็นแบบนั้นแล้วจะไม่รีบเข้าไปช่วย "
        " ถึงแม้ว่าผู้ใหญ่อย่างเขาจะไม่ใช่มนุษย์ก็ตาม... "

        # เอลนี่อุ้มเบ็กขึ้นมาจากน้ำฃ

        e " ทำอะไรของนายเนี่ยไอ้เด็กบ้า! ถ้าจมน้ำขึ้นมาจะทำยังไงฮะ?! "
        b " ก็เปลือกหอยมันน แงงงงง!! "
        e " โอเคๆ แค่หาให้มันให้เจอก็พอใช่มั้ย "

        " เอลนี่ถอนหายใจให้กับเสียงร้องของเด็กชายกำชับวงแขนที่อุ้มเด็กชายอยู่ให้แน่นขึ้น
        พลางเอามืออีกข้างที่ว่างอยู่มายืดไปข้างหน้าอย่างเหลืออด "
        " ไม่กี่วิผ่านไปมวลน้ำขนาดเล็กก็ลอยขึ้นมาอยู่ตรงหน้าของทั้งสอง "
        " และข้างในก็มีเปลือกหอยที่เด็กชายทำหล่นไปลอยอยู่ข้างใน "

        b " เปลือกหอย! "
        e " พอใจแล้วใช่มั้ยงั้นทีนี่ก็กลับไปได้แล้ว...หะ?? "

        " เด็กชายหยิบเปลือกหอยออกมาจากมวลน้ำก่อนนจะยื่นให้เอลนี่ "

        b " ให้พี่ชายนะ "
        













        






        

        